{
    "description": "<p>For data exploration and rapid prototyping, the productivity of an interactive scripting environment is hard to beat: simply grab data, run code, and iterate based on immediate feedback. However, that story starts to break down when the data you have to process is big, or the computations expensive. Your local machine becomes the bottleneck, and you are left with a slow and unresponsive environment.</p> <p>In this talk, we will introduce <a href=\"http://mbrace.io/\">MBrace</a>, an open-source and free engine for scalable cloud programming. Using the MBrace programming model, you can keep working in your beloved familiar scripting environment, and easily execute C# or F# code on a cluster of machines on Azure. We will focus primarily on live demos, provisioning an Azure cluster, and analyzing large datasets in a distributed fashion; in particular, we will discuss how this setup is relevant to data science and machine learning.</p> <p>Mathias Brandewinder has been developing software for about 10 years, and loving every minute of it, except maybe for a few release days. His language of choice was C#, until he discovered F# and fell in love with it. He enjoys arguing about code and how to make it better, and gets very excited when discussing TDD or functional programming. His other professional interests include machine learning and applied math. Mathias is a Microsoft F# MVP and the founder of Clear Lines Consulting. He is based in San Francisco, blogs at <a href=\"http://www.clear-lines.com/blog,\">www.clear-lines.com/blog,</a>and can be found on Twitter as <a href=\"https://twitter.com/brandewinder\">@brandewinder</a>. He’s the author of <a href=\"http://www.amazon.co.uk/Machine-Learning-Projects-NET-Developers/dp/1430267674/\">“Machine Learning Project for .NET Developers” (Apress)</a>.</p> ",
    "end_time": 1452634200,
    "link": "https://www.meetup.com/FSharpBristol/events/227291273/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "FSharpBristol",
    "start_time": 1452623400,
    "title": "Crunching through big data with MBrace, Azure & F#, with Mathias Brandewinder"
}