{
    "cancelled": false,
    "description": "<p>Later this month we are starting a series of Remote Expert Talks for members of all our Meetups round the World.</p> <p>In the meantime we would like to invite you to this webinar which is about building High-Performing Remote-First Digital teams</p> <p>When: April 15 at 2pm. It will last around one hour with plenty of time for questions</p> <p>Register: <a href=\"https://www.equalexperts.com/webinar-building-high-performing-remote-first-teams/?utm_source=meet-up&amp;utm_medium=social&amp;utm_campaign=remote-first-webinar\" class=\"linkified\">https://www.equalexperts.com/webinar-building-high-performing-remote-first-teams/?utm_source=meet-up&amp;utm_medium=social&amp;utm_campaign=remote-first-webinar</a></p> <p>Why attend this webinar</p> <p>While many companies these days are comfortable with remote-friendly working – where a handful of people work remotely, or people have the option to work from home from time-to-time – most processes, tools, and meetings still revolve around the office. Indeed, until recently, very few companies had developed a remote-first approach: when the majority of your team work remotely, with no centralised office.</p> <p>Opinions on remote working differ from one organisation to the next. But one thing is true: coronavirus (Covid-19) has forced our hands. For most organisations, remote working is no longer an option, it's a necessity.</p> <p>But it's not easy to get things running smoothly. Building bespoke digital services requires close collaboration within a cross functional team. This can be hard to achieve even when in the same physical space, but needs even more support, structure and attention when everyone is remote.</p> <p>What you will learn</p> <p>Our teams have been operating following remote first principles for several years. In this workshop we will cover the tools, techniques and processes that our teams follow. You will hear how we build high-performing teams by creating empathy and increasing collaboration.</p> <p>We have been running this workshop with our client teams to help them adapt. Some of the teams have taken to this new remote first approach so well they have been more productive over the last few weeks than any time over the last five months.</p> <p>This interactive webinar will be run by two of our experts. There will be plenty of time to ask questions.</p> <p>Who should attend</p> <p>This webinar is perfect for anyone working in the following:</p> <p>Medium to large organisations<br/>High growth, disruptive startups<br/>Tech, digital, IT, &amp; systems infrastructure teams<br/>Complex sectors such as banking and financial services, government and retail.</p> <p>Register: <a href=\"https://www.equalexperts.com/webinar-building-high-performing-remote-first-teams/?utm_source=meet-up&amp;utm_medium=social&amp;utm_campaign=remote-first-webinar\" class=\"linkified\">https://www.equalexperts.com/webinar-building-high-performing-remote-first-teams/?utm_source=meet-up&amp;utm_medium=social&amp;utm_campaign=remote-first-webinar</a></p> ",
    "end_time": 1586959200,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/269926735/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "experttalks",
    "start_time": 1586955600,
    "title": "Building High-Performing Remote-First Digital Teams"
}