{
    "cancelled": false,
    "description": "<p>The production of software is a complex, collaborative process that stretches our ability as human beings to cope with its demands.</p> <p>Many people working in software development spend their careers without seeing what good really looks like.</p> <p>Our history is littered with inefficient processes creating poor quality output, too late to capitalise on the expected business value. How have we got into this state? How do we get past it? What does good really look like?</p> <p>Continuous Delivery changes the economics of software development for some of the biggest companies in the world, whatever the nature of their software development, find out how and why.</p> <p>**<br/>Dave’s talk will be followed by a Virtual Fishbowl session where all attendees will have the opportunity to take part in a live discussion</p> <p>SPEAKER:<br/>Dave Farley is the founder and director of Continuous Delivery Ltd. He is a regular conference speaker, YouTuber and widely read blogger on technology and software development.</p> <p>Dave is a thought leader in the field of software development and has a long track record in doing innovative work, creating high-performance teams, shaping organisations for success and creating outstanding software.</p> <p>Dave is author of the award-winning book 'Continuous Delivery' that describes, what many regard as, the state-of-the-art in software development process.</p> <p>Dave is also one of the authors of the 'Reactive Manifesto' which describes a modern approach to high-performance, efficient, system design. He was the Head of Development for LMAX Ltd. a company that is widely respected for the quality of its software and innovative approach to design. He was also part of the team that created the LMAX Disruptor, which won the Duke Award for open source software.</p> ",
    "end_time": 1591209000,
    "link": "https://www.meetup.com/experttalks-bristol/events/270783638/",
    "location": null,
    "org": "experttalks",
    "start_time": 1591203600,
    "title": "The Rationale for Continuous Delivery - Dave Farley"
}