{
    "cancelled": false,
    "description": "<p>\"Your Digital Transformation isn’t Digital or Transformation.... and will probably fail\"</p> <p>Using a range of real-life examples, this Expert Talk will explore the following ideas and questions:</p> <p>Not all change is transformation – and too much change, too quickly, is a recipe for failure not success.</p> <p>Digital is a means, not an end – Successful strategies are built around solving valuable problems that differentiate you in the market.</p> <p>Most transformations fail – Why? People are too busy and too scared of the unknown to readily accept the new. Many organisations make the mistake of emphasising the size of the transformation, to bounce colleagues out of a rut. This tends to mean failure through resistance.</p> <p>Why are people so busy and resistant to change? In this age of amazing technological advancements at work, incredible efficiencies have been made possible. Why aren’t we working 15 hour weeks?</p> <p>SPEAKER: David Cox. Transformation Manager at Equal Experts</p> <p>David started out as a market researcher in the Publishing industry. He has since worked in B2B and B2C environments, with experience across Europe, the US and Australia. In his role as Digital Products Director, he led a multi-million pound agile transformation at a FTSE 100 company with over 300 years of history, helping introduce new ways of working, and successfully migrating complex legacy systems with multiple dependencies.<br/>As Director of Transformation at Informa, he recently helped enable a culture of experimentation across all levels of the organisation in the US and UK. This included new approaches to the use of data in decision-making, product strategy, and optimising the organisation’s design.<br/>As Transformation Manager, he advises public and private clients, cross-pollinating ideas to help them transform successfully according to their unique situation.</p> ",
    "end_time": 1597255200,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/272063014/",
    "location": null,
    "org": "experttalks",
    "start_time": 1597251600,
    "title": "Summer Series: Your Digital Transformation isn’t Digital or Transformation...."
}