{
    "cancelled": false,
    "description": "<p>Bringing \"Agility\" to technology delivery is not just about following processes or rituals.</p> <p>It involves a complete change in the mindset of all the stakeholders.</p> <p>There are lots of challenges in this journey, including but not limited to stakeholder engagement, problem ownership, trust, team autonomy, deep user understanding, technology mindset changes. This talk will highlight the challenges faced and approaches that the team used to overcome them.</p> <p>SPEAKERS:<br/>Sreekandh Balakrishnan<br/>CTO, Enchanting Travels, Travelopia Group</p> <p>After completing his Bachelor's degree in Computer Science, Sreekandh worked in the software industry for several years as a Developer before finding his true calling in solving business problems through technology. Sreekandh loves everything tech, ancient Indian culture, and Sanskrit scriptures. He enjoys reading about startups, building winning teams, and working on product development.</p> <p>**</p> <p>Rajesh Kumar Thiagarajan<br/>Lead Consultant, Equal Experts, Bangalore</p> <p>Rajesh is a global product, technology &amp; business leader whose mission is to help teams be purpose-driven and build game-changing products &amp; services.<br/>Currently, he works as a lead consultant at \"Equal Experts\" (EE). At EE, he is responsible for helping the clients of EE in their digital transformation journey. He mainly focuses on business-strategy-oriented digital solutions and related transformational initiatives.</p> <p>**</p> <p>Uttam Kini<br/>Principal Consultant, Equal Experts, Bangalore</p> <p>Uttam is a polyglot software engineer who likes to solve problems that usually involve writing software.</p> <p>**<br/>The link to the recording of this Talk will be posted in the Comments shortly after it takes place.</p> ",
    "end_time": 1603269000,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/273793396/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "experttalks",
    "start_time": 1603265400,
    "title": "Breakfast Meetup: Client Spotlight: Journey from \"Doing Agile\" to \"Being Agile\""
}