{
    "cancelled": false,
    "description": "<p>This natural experiment that is COVID-19 has challenged how we are able to express our sociality – our “human-ness”.</p> <p>Prior to the pandemic, leaders were expected to be “in charge”, manage their teams, drive performance and foster creativity. Though these accountabilities have not changed, the landscape - the context in which such leadership endures - has.</p> <p>Through the lens of anthropology, the study of humans,</p> <p>What does leadership look like in a remote working environment?<br/>How do we foster trust, build relationships, and maintain cohesion?<br/>How do we remain efficient?<br/>How do we make our interactions more meaningful, more human?</p> <p>COVID-19 will not be the last human disruptor.</p> <p>So, let’s talk about it!</p> <p>**</p> <p>Speaker: Dr Monika Sumra</p> <p>With over 20 years of leadership and team-building experience, Dr. Monika Sumra has helped organizations excel in their leadership and culture change efforts. Monika is co-developer of BUNKA™, an anthropologically-based leadership, results, and organizational cultural improvement methodology. She is also co-developer of the BUNKA™ KATA Method for Problem-Solving and Continuous Improvement, a team-building coaching-based approach.</p> <p>As a business anthropologist, Monika is uniquely qualified to investigate the degree to which people are aligned with organizational culture and the impact of such alignment on performance outcomes. She also provides strategic support to tech organizations in their efforts to gain deeper insight into how people react to, and use technology, as well as what social norms, values, beliefs and practices endure as a result. Monika works with her clients to implement change-management strategies towards achieving desired business outcomes and has helped save close to $1 Billion over her career thus far.</p> <p>Dr. Sumra is also a highly sought-after executive coach for leaders desiring to improve personal, team, and/or organizational performance. She is known to challenge organizational leaders, pulling and pacing them to see beyond their comfort zones to reach their personal leadership ”sweet spot”. She will get you to a place where you will “think about thinking”. Many have described their coaching experience with Monika as professionally rewarding and life-changing.</p> <p>In November 2019, Monika completed her doctoral research at the University of Toronto, Canada specializing in leadership. She also holds an MSc and BSc in women’s studies and biosocial anthropology. Monika is also a public speaker, Lean Six Sigma Black Belt, published author, researcher, teacher, and scientist. Of all her roles, her most important and rewarding are those of wife and mother.</p> <p>The foundational principle of her efforts is, “though we may not agree with every perspective, opinion, or approach, we are beholden to one another to understand”…Monika Sumra</p> <p>**<br/>A link to the recording of this Talk will be placed in the Comments shortly after it takes place</p> ",
    "end_time": 1610564400,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/275120164/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "experttalks",
    "start_time": 1610560800,
    "title": "Remote Leadership in a COVID-19 World - an anthropological perspective"
}