{
    "cancelled": false,
    "description": "<p>A breakfast talk from Australia as part of our celebration of International Women's Day.<br/>****<br/>About 18 months ago, someone said to Sandra they'd be dead before they saw Company Boards being and working Agile. But, as it turns out, she's more optimistic.</p> <p>During her 8 years on the Board of CHOICE, a 60-year-old social enterprise, she and her fellow Board directors oversaw a significant transformation.</p> <p>While much of this transformation has been within the organization, it's been enabled by a Board open to new ways of working. A Board that has learned to focus on outcomes over outputs, a Board committed to continuous learning and improvement, and a Board wholly supportive of empowering and enabling the organization to do great things.</p> <p>As Chair of the Board for 3 of those 8 years, Sandra talks about their 'accidental' Agile journey, why and how they practice new ways of working, and how business agility and Agile helps with challenges they have at the Board level.</p> <p>If you've ever thought that Company Boards don't think about customer needs and will never understand Agile, this session will hopefully surprise and delight you.</p> <p>SPEAKER:</p> <p>Sandra Davey<br/>Product Space, Founder.<br/>Non-Exec Directorships.</p> <p>As a product coach with Product Space in Australia, Sandy draws on her 25-year experience in digital product management to help people, teams, and leaders adopt new ways of working in the pursuit of creating and delivering value.</p> <p>What really drives her though is unlocking human potential in the workplace, and a mashup of product-led thinking and working Agile is how she does it.</p> <p>She's also a Non-Executive Director, serving on the Boards of auDA and Screenrights.</p> <p>Sandra is immediate Past Chair of CHOICE, Australia's largest consumer advocacy organization where she spent considerable time mashing her Agile and product craft with the strategic nuance and governance experience required of Board Directors. She does this because she has a deep interest in understanding and helping Boards and management support and enable the inevitable \"business / organizational agility\" journeys happening within organizations.</p> <p>****<br/>This talk will be recorded and the link to the recording added to the comments shortly after the event takes place.<br/>****</p> ",
    "end_time": 1615280400,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/276478491/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "experttalks",
    "start_time": 1615276800,
    "title": "Business Agility on Company Boards"
}