{
    "cancelled": false,
    "description": "<p>Discover if your company is keeping pace in today's digital ecosytem, learn about Agile in Victorian times and explore how to adopt new working behaviours and make them stick.</p> <p>Three lightning talks (10 minutes each), by women from the Equal Experts network, to celebrate International Women's Day.</p> <p>*********<br/>1. The digital race is on. Is your company keeping pace in today’s digital ecosystem?<br/>*********<br/>Let’s talk Formula One racing. Companies want their digital platforms to be like a precision race car delivering value while finishing the race intact.</p> <p>This talk will explore various ways to create and maintain a high performing digital platform while ensuring that your organization is prepared to navigate the road ahead. We will explore key concepts in winning the race:</p> <p>Put the pedal to the metal. Pace and timing is critical. Do you know the right pace for your organization?<br/>Know when to tap the brakes. Keep your organization in sync. Succeeding in the digital era is a team sport that requires everyone to perform at their optimum levels.<br/>Steer into a skid. Knowing when to pivot is critical – but so is having the confidence to stay the course.</p> <p>SPEAKER:<br/>Lisa Copland, SVP, Client Engagement, Equal Experts North America.</p> <p>*********<br/>2. Florence Nightingale - Agile Pioneer.<br/>*********<br/>Florence Nightingale - we know her as the Lady with the Lamp - but she was so much more than that.</p> <p>In this talk, I will persuade you that in her relentless focus on outcomes, and the best way to achieve them fast, she was a pioneer of the agile delivery methods that we use today.</p> <p>SPEAKER:<br/>Julia Bellis, Product Lead, Equal Experts</p> <p>*********<br/>3. Reframing Change…a mile at a time.<br/>*********<br/>In a fast paced world, with increasing pressure to adapt and change, how do we adopt new behaviours and make them stick?</p> <p>SPEAKER:<br/>Katie Coleman, VP, Client Engagement, Equal Experts North America</p> <p>*********<br/>All talks will be recorded and the link to the recording posted in the Comments shortly after the event takes place.<br/>*********</p> ",
    "end_time": 1614798000,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/276526656/",
    "location": null,
    "org": "experttalks",
    "start_time": 1614794400,
    "title": "IWD Lightning Talks - Session 2"
}