{
    "cancelled": false,
    "description": "<p>Breakfast meeting: Learn about the cost of delay as a prioritisation tool for cloud migration, exposing the language barriers in software delivery, and how to encourage an inclusive approach to delivery.</p> <p>Three lightning talks (10 minutes each), by women from the Equal Experts network.</p> <p>*********<br/>1. Using cost of delay to prioritise cloud migration.<br/>*********<br/>Picture the scenario. You're a large organisation wanting to migrate ~40 business-critical customer service applications to a new platform and hosting environment.</p> <p>The fact that staying put is no longer an option. The pace of change is fast, and all things being equal, a company running their core business on a cloud will likely outperform a company that is not. And getting all of your critical applications into the cloud is no easy process. Where to start? What application goes first?</p> <p>Join us to learn a different way to prioritise your migration and get your top business value into the clouds quicker using the cost of delay, an indicative calculation used to measure and understand the benefits you stand to lose by delaying a decision.</p> <p>SPEAKER:<br/>Bethan Timmins, Managing Director, Equal Experts Australia and New Zealand</p> <p>*********<br/>2. Exposing the language barriers in software delivery.<br/>*********<br/>In this talk we will take a deep dive into one specific example where some might call it Exploratory Testing and others Chaos Engineering, and why that language difference can be so limiting.</p> <p>The different roles that make up a software delivery team have a shared goal of creating and supporting high value software for their users. Unfortunately, this division in labour has also brought with it a division in language which often results in each role creating their own version of tools and techniques, rather than building off of the progress of other roles.</p> <p>Abby has the unique experience of working across a few different roles in her career including QA, DevOps, Platform Engineering, Release Engineering, and SRE. This diversity of experience has exposed some of the cost of these differences in terminology, and it is time we as an industry start building bridges between these roles.</p> <p>SPEAKER:<br/>Abby Bangser, SRE, Duffel Technology Ltd</p> <p>*********<br/>3. Decolonise, design, deliver.<br/>*********<br/>Remember back in 2018 when a Google algorithm was classifying black people as “gorillas”?</p> <p>And then we found out about that male bias in medical trials, resulting in women incorrectly being diagnosed (and treated) for a plethora of conditions.</p> <p>These incidents weren’t just about a lack of diversity. There was a deeper phenomenon at play: colonialism.</p> <p>Male vs female customer segmentation. Emotional vs rational responses by users. Radical candour to achieve psychological safety.</p> <p>These are all easily accepted ideas that reflect post-Enlightenment Eurocentric ideas and values. Many of these ideas are (unsurprisingly) not shared by the majority of our planet’s 7.6b inhabitants.</p> <p>Let’s shed a light on some of these deeply held beliefs and assumptions, and share some practical steps we can take to have a truly inclusive approach to delivery.</p> <p>SPEAKER:<br/>Neha Datt, Product Principal Consultant, Equal Experts.</p> <p>*********<br/>All talks will be recorded and the link to the recording posted in the Comments shortly after the event takes place.<br/>*********</p> ",
    "end_time": 1614762000,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/276526636/",
    "location": null,
    "org": "experttalks",
    "start_time": 1614758400,
    "title": "IWD Lightning Talks - Session 1"
}