{
    "cancelled": false,
    "description": "<p>Learn the tools we used to do Discovery remotely for Pret a Manger in lockdown, go beyond Cunningham’s Tech Debt analogy and explore when content goes wrong (and why).</p> <p>Three lightning talks (10 minutes each), by women from the Equal Experts network.</p> <p>*********<br/>1. Designing a service for Pret a Manger as the world changed in 2020.<br/>*********</p> <p>Remote usability testing is nothing new but doing Discovery for Pret a Manger in lockdown, where we couldn’t observe users and in-store operational processes, was more of a challenge.<br/>We used a range of techniques to design a Click and Collect service for Pret customers as the world changed rapidly in 2020, and shopping behaviours changed.</p> <p>In just 10 minutes, you’ll understand:<br/>-Using remote research methods to understand users’ context and operational processes.<br/>-Setting up experimental trials to design in-shop processes.<br/>-How we tried to predict customer food and drink buying behaviour after lockdown.</p> <p>SPEAKERS:<br/>Erica Kucharczyk, User Experience Research Consultant, Equal Experts.<br/>Liz Leakey, Principal Consultant, Equal Experts.</p> <p>*********<br/>Beyond Cunningham’s Tech Debt analogy.<br/>*********<br/>1992; the world is listening to a scary amount of Nirvana, Moby drops the Rave anthem “Go”, and where the hell has Laura Palmer gone?</p> <p>Somewhere in a remote location Ward Cunningham is frantically trying to come up with a way to get stakeholders to support his technical projects. The Tech Debt analogy was born, and this today still permeates boardrooms, Jira ticket labels, and a healthy amount of meetup topics.</p> <p>You’d expect that by now we would have cracked this tough one, but no…we’re still left to wonder why Bank of Corp X isn’t chasing us up for overdue payments.</p> <p>This talk wants to offer an alternative to thinking tech debt by surfacing first why the analogy hasn’t always been good to us, and how a further extension into the financial world could satisfy our need of growing value-add technical capital.</p> <p>SPEAKER:<br/>Giovanna Faso, Head of Engineering Ops, OLX Group.</p> <p>*********<br/>When content goes wrong (and why).<br/>*********<br/>Yes, we’ll show you funny examples. Then, we’ll share how product and service content can be the best for your users – and is never laughed at.</p> <p>In just 10 minutes, you’ll know:</p> <p>-Why good content matters.<br/>-When to start thinking about content.<br/>-How to keep improving your content.</p> <p>SPEAKERS:<br/>Mia O’Donoghue, Senior Content Designer, Equal Experts.<br/>Katy Beale, Content Designer, Equal Experts.</p> <p>*********<br/>All talks will be recorded and the link to the recording posted in the Comments shortly after the event takes place.<br/>*********</p> ",
    "end_time": 1616594400,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/276623758/",
    "location": null,
    "org": "experttalks",
    "start_time": 1616590800,
    "title": "IWD Lightning Talks - Session 3"
}