{
    "cancelled": false,
    "description": "<p>Breakfast Meetup: Let’s shed a light on some deeply held beliefs and assumptions, and share some practical steps we can take to have a truly inclusive approach to delivery.</p> <p>Remember back in 2018 when a Google algorithm was classifying black people as “gorillas”?</p> <p>And then we found out about that male bias in medical trials, resulting in women incorrectly being diagnosed (and treated) for a plethora of conditions.</p> <p>These incidents weren’t just about a lack of diversity. There was a deeper phenomenon at play: colonialism.</p> <p>Male vs female customer segmentation. Emotional vs rational responses by users. Radical candour to achieve psychological safety.</p> <p>These are all easily accepted ideas that reflect post-Enlightenment Eurocentric ideas and values. Many of these ideas are (unsurprisingly) not shared by the majority of our planet’s 7.6b inhabitants.</p> <p>Let’s shed a light on some of these deeply held beliefs and assumptions, and share some practical steps we can take to have a truly inclusive approach to delivery.</p> <p>**</p> <p>SPEAKER:<br/>Neha Datt, Product Principal Consultant, Equal Experts.</p> <p>Neha is a senior digital advisor, agile leadership coach and conference speaker with a strong background in strategy, organisation design and human change.</p> <p>She has almost 20 years of collaborating with teams to deliver great products and services for global customers, across various industries.</p> <p>She is focusing now on ethical, sustainable, purpose-driven businesses.</p> <p>**</p> <p>This talk will be recorded and a link to the recording posted in the Comments shortly after the event.</p> <p>**</p> ",
    "end_time": 1616661000,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/276963135/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "experttalks",
    "start_time": 1616659200,
    "title": "IWD Lightning Talk – Decolonise, Design, Deliver – with Neha Datt"
}