{
    "cancelled": false,
    "description": "<p>This talk starts at 8.30am</p> <p>It’s 2021. You work in a product company.</p> <p>Focusing on outcomes and customer needs isn’t good enough anymore.</p> <p>Sure: product development has matured and we have a rich foundation of powerful practices focused on meeting outcomes and customer needs.</p> <p>However from blitz-scaling to hyper-personalisation, these “good” practices have also created unsustainable businesses and entrenched systemic biases.</p> <p>We’ll challenge the definition of “good” product practices and show you how to create the antidote to unethical, unsustainable, non inclusive product management. It is, after all, 2021.</p> <p>We’ll explore some powerful case studies, and unpick precisely why our existing toolkits are incomplete. Notwithstanding the role of capitalism in driving a product’s direction, there are robust, analytical practices teams can adopt to bring ethics, sustainability and cultural inclusion into their products.</p> <p>***<br/>SPEAKERS:</p> <p>Neha Datt</p> <p>Neha’s role as a hands-on product advisor, trainer and coach is focused on bringing a people-centred approach to designing business strategy, delivering products and shaping organisational culture.</p> <p>Her focus on people – while working within highly technical areas – is the result of over 15 years’ experience in designing and delivering intentional user experiences across a wide range of industries.</p> <p>A strong advocate of lean, modern agile and service design, Neha helps organisations of all sizes - from startups to enterprises - to build products and teams that make a real difference to people.</p> <p>Neha is a director of Mercurial Phoenix, a new venture studio and consultancy based in London, and a member of the Equal Experts, and Sullivan &amp; Stanley networks. She is also getting used to talking about herself in the 3rd person.</p> <p>Contact Neha on Twitter or via her website www.mercp.com.</p> <p>**</p> <p>Marcel Britsch</p> <p>Marcel is an independent Digital Consultant, Product Owner and Business Analyst.</p> <p>He helps organisations build solid products and services in a sustainable way, by facilitation, pairing, coaching or hands-on product management. He believes that project success is strongly linked to happy teams, value-focused decision-making and fast feedback cycles.</p> <p>He is passionate about finding the best tools and techniques to optimise team culture, ways of working and solution design. He considers projects that follow classic waterfall / big-design-up-front practices to be too likely doomed to go anywhere near them, but loves to help organisations build products and transform in incremental evolutionary fashion.</p> <p>Outside of work he is interested in SciFi and comic books, Theravada Buddhist meditation and number theory. He can be found at www.beautifulabstraction.com or his blog www.thedigitalbusinessanalyst.com</p> <p>****<br/>This talk will be recorded and the link to the recording added to the Comments shortly after the event takes place.<br/>****</p> ",
    "end_time": 1633509000,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/281005826/",
    "location": null,
    "org": "experttalks",
    "start_time": 1633505400,
    "title": "Product practices. Why focusing on outcomes and customer needs is not enough."
}