{
    "cancelled": false,
    "description": "<p>The advent of the cloud came to give us testing superpowers: one properly configured Kubernetes file and one can easily spin up a bunch of Docker containers that faithfully represent the production environment.</p> <p>However, with ease of use comes abuse, and the proliferation of test environments is beginning to be a real headache to many organisations, both in terms of management and cost.</p> <p>I have suffered this first hand, and from my experience at the trenches a number of strategies have materialised: universal feature flags, meta-automation, and test environment rationalisation.</p> <p>These techniques will allow you detect when you have overlapping and superfluous testing efforts, introducing the opportunity for cost savings, all while making sure your suite of tests environments remains flexible enough so as to take into account the different needs at different development stages.</p> <p>With these strategies you’ll feel confident that your test environments give you what you need, but no more.</p> <p>SPEAKER:<br/>Abraham Marín-Pérez</p> <p>Abraham is a Java programmer, consultant, author, and public speaker with more than ten years of experience in a variety of industries.</p> <p>Originally from Valencia, Spain, Abraham has built most of his career in London, UK, working with entities like JP Morgan or the United Kingdom’s Home Office, frequently in collaboration with Equal Experts.</p> <p>Thinking his experiences could be useful to others, Abraham became a Java news editor at InfoQ, authored “Real-World Maintainable Software”, and co-authored “Continuous Delivery in Java”. He also helps run the London Java Community.</p> <p>Always the learner, Abraham is currently studying a degree in Physics.</p> <p>**<br/>This talk will be recorded and the link to the recording added to the Comments shortly after the event.<br/>**</p> ",
    "end_time": 1646766000,
    "link": "https://www.meetup.com/ExpertTalks-Bristol/events/283947379/",
    "location": null,
    "org": "experttalks",
    "start_time": 1646762400,
    "title": "How to Manage Multiple Test Environments in a Hyperconnected Cloud World"
}