{
    "cancelled": false,
    "description": "<p>Since **You Build It You Run It** was outlined in 2006, on-call product teams as an operating model has gone from being a controversial idea… to being a controversial idea.</p> <p>Enterprise organisations don’t do it, but they do talk about why they don’t do it:</p> <p>* “It’s too expensive”<br/>* “Developers won’t want to do it”<br/>* “Nobody would be accountable”<br/>* “There would be no incident management”<br/>* “Developers would spend all their time firefighting”<br/>* “It’s not possible to have a DBA for every team”</p> <p>This talk demystifies these fears about You Build It You Run It, drawing on experiences from multiple enterprise organisations who’ve successfully implemented on-call product teams.</p> <p>It explains how to simultaneously achieve frequent deployments, high availability, and a high rate of learning across many teams and digital services.</p> <p>**SPEAKER:**<br/>**Steve Smith**<br/>Head of Scale Service, Equal Experts</p> <p>Steve advises clients worldwide on leadership in delivery, operations, and culture at scale.</p> <p>Steve has played key roles in multiple digital transformation programmes. He was a leader on a 60 team/600 microservices programme for a UK government department with £500Bpa revenue.</p> <p>He also implemented a Continuous Delivery and operability strategy for 30 teams/100 microservices in a high street retailer with £2Bpa online revenue. He’s also written multiple books, such as [Measuring Continuous Delivery](<a href=\"https://www.amazon.co.uk/Measuring-Continuous-Delivery-Steve-Smith-ebook/dp/B08LYZDPMK\" class=\"linkified\">https://www.amazon.co.uk/Measuring-Continuous-Delivery-Steve-Smith-ebook/dp/B08LYZDPMK</a>) and [Build Quality In](<a href=\"https://www.leanpub.com/buildqualityin\" class=\"linkified\">https://www.leanpub.com/buildqualityin</a>).</p> <p>\\*\\*<br/>This talk will be recorded and the link to the recording added in the Comments shortly after the event.</p> <p>\\*\\*</p> ",
    "end_time": 1657040400,
    "link": "https://www.meetup.com/experttalks-bristol/events/286627480/",
    "location": null,
    "org": "experttalks",
    "start_time": 1657036800,
    "title": "You Build It You Run It sounds great… but it won’t work here!"
}