{
    "cancelled": false,
    "description": "<p>Find out how this successful travel retailer went on a transformational journey to become one of the most innovative **travel technology** users in the industry.</p> <p>Business leaders will discover how embracing technology can deliver incisive customer insight, transform mindsets and culture, scale teams, and grow revenue through building the right products to become market leaders.</p> <p>In this talk Adam Schwab - ‘founder, investor, contrarian’ - will give insights into the journey he has taken with Luxury Escapes, a much-loved travel retailer turned travel technology leader. The business Adam founded is quickly becoming one of the fastest-growing travel companies in the world, thanks to a transformation that has seen product and technology combine to shift mindsets to focus on what might be possible, rather than what’s always been done.</p> <p>Find out how a last minute deals retailer transformed into a fully curated travel experience company that turns over almost a billion dollars annually and has 400 team members across four continents.</p> <p>Transformation leaders and engineers will gain insight into how to embark on a transformative process in business, the pitfalls to look out for along the way, and the potential springboards to success. Find out how to achieve tangible transformation at a speed you didn’t think was possible, as Adam describes how his team has created a new normal for the travel industry.</p> <p>**Speaker:**<br/>**Adam Schwab**<br/>CEO and Co-Founder, **Luxury Escapes**</p> <p>Adam is the CEO and Co-Founder of Luxury Escapes. With 4.2 million global members and major offices in Australia, India, New Zealand, the US and the UK, Luxury Escapes is one of Australia’s most successful and best-loved travel brands, and is quickly becoming one of the fastest-growing travel companies worldwide.</p> <p>Adam started life as a corporate lawyer specialising in mergers and acquisitions at one of Australia’s largest legal firms before becoming a founding director of privately-owned corporate accommodation and services group, Living Corporate Apartments. In 2010, Adam founded what would become Luxury Escapes with school friend, Jeremy Same.</p> <p>In addition to being CEO of Luxury Escapes, Adam is a prolific angel investor, and a director of [Bluethumb.com.au](<a href=\"http://bluethumb.com.au/\" class=\"linkified\">http://bluethumb.com.au/</a>), Australia’s largest online art seller. Adam has also mentored hundreds of entrepreneurs in the Startmate and Antler incubator programmes.</p> <p>Since 2004, Adam has been a financial journalist and business commentator specialising in corporate governance, economics and start-ups for SmartCompany, BRW and Crikey, and is the host and creator of the popular From Zero podcast.</p> <p>Adam has been a director of the Myeloma Foundation of Australia since 2010, and is on the investment committee at the Save the Children Investment Fund. He has run two Melbourne Marathons completely barefoot to raise funds for the Myeloma foundation.</p> <p>**\\*\\***<br/>**This talk will be recorded and the link to the recording added to the Comments shortly after the event takes place.**<br/>**\\*\\***</p> ",
    "end_time": 1660646700,
    "link": "https://www.meetup.com/experttalks-bristol/events/287269041/",
    "location": null,
    "org": "experttalks",
    "start_time": 1660643100,
    "title": "Travel to Technology - how Luxury Escapes is changing the way we travel"
}