{
    "cancelled": false,
    "description": "<p>If you haven’t come across **cyber-physical systems** yet, the chances are you soon will. Come and find out why these software-controlled physical systems are so complex to work with, and how Delivery Leads can apply Lean methodologies to maximise their effectiveness.</p> <p>[Cyber-physical systems](<a href=\"https://en.wikipedia.org/wiki/Cyber-physical_system\" class=\"linkified\">https://en.wikipedia.org/wiki/Cyber-physical_system</a>) in software delivery are increasing in prevalence and impact. For those who haven’t worked with them previously, they have physical mechanisms deeply intertwined with controlling software. Human interaction raises complexity and unpredictability even further, making them challenging to work with.</p> <p>In this talk you will learn what happened when Wayfair, a major European online retailer, installed a cyber-physical system at their UK fulfilment centre to process orders for delivery. Find out what challenges were presented when the system reached peaks of +10K orders/day, and which chaos control measures were taken to reduce the process failure rate from 17% to 1% in just 8 months.</p> <p>Lean methods you will discover:</p> <p>* When, why and how to form cross-functional teams with minimum IT engineering support<br/>* How to transform a mass of chaotic, cross-discipline problems into an iterative, incremental, improvement plan<br/>* How to use data-based prioritisation to apply software observability principles to cyber-physical systems<br/>* How to improve incident response in a large scale, business-critical, cyber-physical system</p> <p>Join this talk to discover the secret to more efficient processes and improved business performance using cyber-physical systems.</p> <p>**SPEAKERS:**<br/>**Lyndsay Prewer**<br/>Technical Program Manager, Equal Experts<br/>*Lyndsay is an engineer at heart, with over twenty years experience of helping individuals, teams and organisations improve their software delivery. For the past 7 years he’s been a consultant with Equal Experts, leading a range of engineering teams in the delivery of large-scale IT services. Problem domains have ranged from public sector organisations (UK’s tax and passport offices) to global, online retailers.*<br/>*He loves helping bridge the gaps between user and business needs, engineering disciplines and service operation.*</p> <p>**Nick Sutliffe**<br/>Senior Operations Manager, Wayfair<br/>*Nick is an operations manager with a varied background across manufacturing, distribution and project management roles. Before joining Wayfair he led the manufacturing operation for a major British food manufacturer driving world class performance through application of Lean methodology and employee engagement.*<br/>*He loves to break complex challenges and requirements into simple “real world” solutions which can be easily communicated and understood by all.*<br/>\\*\\*<br/>**This talk will be recorded and a link to the recording added to the Comments shortly after the event.**<br/>\\*\\*</p> ",
    "end_time": 1663092000,
    "link": "https://www.meetup.com/experttalks-bristol/events/288134156/",
    "location": null,
    "org": "experttalks",
    "start_time": 1663088400,
    "title": "Make it Lean - How to get chaos under control in cyber-physical systems"
}