{
    "cancelled": false,
    "description": "<p>Come and find out how machine learning - done right - can help create more business value for your clients. Gain insights into the best ways to use machine learning, and where to put your focus as a DevOps engineer.</p> <p>If you’ve ever had frustrations when working with machine learning AI, this is the talk for you. Travelopia offers personalised travel experiences from high-end travel brands. Find out why using machine learning to make greater use of data and better understand their guests didn’t work out on the first attempt, and how they addressed it for future iterations.</p> <p>DevOps engineers will learn how creating a steel thread from prototype to end-user, and focusing on one use case at a time, dramatically improves the quantity and quality of data insights in order to maximise business value. It’s not about platforms, technology, or scale. Instead, the focus is on determining the best data definitions, what a team should look like, and how to use data insights across an organisation.</p> <p>You will come away with a different mindset to machine learning: </p> <p>* Focus on user outcomes, not machine learning technology<br/>* Don’t worry about data platforms, worry about how your teams will self-organise<br/>* A data inception allows you to intentionally design teams and workloads<br/>* Making better use of your data insights will set up your organisation for success.</p> <p>**SPEAKERS:**</p> <p>**Sreekandh Balakrishnan**<br/>Technology Director for Innovation and Products, Travelopia</p> <p>**Simon Case**<br/>Head of Data, Equal Experts</p> <p>\\*\\*<br/>This talk will be recorded and the link to the recording added in the Comments shortly after the event.<br/>\\*\\*</p> ",
    "end_time": 1664267400,
    "link": "https://www.meetup.com/experttalks-bristol/events/288225176/",
    "location": null,
    "org": "experttalks",
    "start_time": 1664263800,
    "title": "How to get machine learning right and make data work harder"
}