{
    "cancelled": false,
    "description": "<p>How to shift mindsets in your Electronic Data Interchange Operations team, cross-skilling engineers to take ownership of developer roles. Find out how **You Build It You Run It** improves **Electronic Data Interchange** Systems (EDI) by upgrading the quality and reliability of document exchanges between you and your partner(s).</p> <p>In this talk you will learn what EDI is, and how best to structure and equip an EDI team with cross-functional skills so that operations engineers can take on developer mindsets practicing You Build It You Run It Principles. Wayfair now recognise their operations engineers as functional and technical SMEs - find out how putting empathy at the heart of engineering has made that happen, and what they’ve learned along the way.</p> <p>Wayfair has had an EDI operations team in place for years, their role being to customize an EDI commercial off-the-shelf (COTS) platform. Learn how this is being replaced with a microservices-based document translation system in the cloud, and how that can improve the efficiency of document exchange within the organization and externally.</p> <p>DevOps engineers and technical product managers will see how Wayfair has tackled cultural challenges and misconceptions to give ownership to engineers, empowering them to build, operate and fix their own products. This focus on making decisions in the interests of the team and the individual enables them to solve problems at scale, with consistency.</p> <p>You will discover the path to success for transitioning a team from ops to dev, and how adopting this method simplifies auditability, allowing teams to scale independently with a faster implementation and turnaround. Find out how to build the tools required whilst still running your current system, and why it takes less time than you’d think.</p> <p>**Speakers:**</p> <p>**Michaela Madden**<br/>Michaela is EDI Product Manager at Wayfair. She has been working in the EDI space for over 7 years. When Michaela first joined Wayfair, she started on the Supply Chain Integration team working directly with suppliers to integrate via EDI until moving over to the EDI engineering team to get more hands-on experience on the tech side. She has since moved to the role of EDI Engineering Product Manager, where she has been managing the roadmap, helping to balance the team’s workload for the new system buildout with existing operational responsibilities.</p> <p>**Tommy Hinrichs**<br/>Tommy is a Technical Principal and Account Anchor at Equal Experts, with over 21 years of experience in all areas of the software development life cycle (SDLC). He is an expert in software management, engineering and architecture in event-driven distributed systems. He specializes in web and desktop applications applying agile and lean processes (e.g. XP, Scrum, Kanban). Tommy excels at guiding architecture according to business value, evolving the systems (and teams!) one thin vertical slice at a time.</p> <p>\\*\\*<br/>This talk will be recorded and the link to the recording added to the Comments shortly after the event takes place.<br/>\\*\\*</p> ",
    "end_time": 1665511200,
    "link": "https://www.meetup.com/experttalks-bristol/events/288668006/",
    "location": null,
    "org": "experttalks",
    "start_time": 1665507600,
    "title": "The power of You Build It You Run It in EDI: from Ops to Dev at Wayfair "
}