{
    "cancelled": false,
    "description": "<p>In her interactive keynote, Lison Mage debunks the three biggest myths of overthinking to help you make better decisions faster and silence your negative mental chatter. Learn how your thinking might be holding you back, and find the confidence to *just do it*.  </p> <p>Too clever for your own good? Unable to decide even after over analysing data in enormous spreadsheets? Feeling stuck and anxious imagining countless what-if scenarios? ​​</p> <p>If this strikes a chord, join this keynote to discover how to liberate your mind, think remarkably and act more decisively. Through engaging games leveraging psychology and behavioural sciences, engineers will discover how to:</p> <p>* Leverage your thinking to problem-solve and be more creative<br/>* Develop your self-awareness and improve your mental well-being<br/>* Build confidence and decisiveness when facing complex choices.</p> <p>You might be surprised to learn that what you thought was an essential part of the decision making process could actually be getting in your way and holding back your progress. Lison will explain why we fall into that trap, and how to avoid it.</p> <p>Delivery managers will gain insight into empowering your teams to perform at their full potential, and developers will learn how to harness your creative and analytical thinking to deliver solutions at scale for your customers. </p> <p>Join the talk live to be in with a chance of winning one of three copies of Lison’s book **Act Before You overThink.**</p> <p>**Speaker:**</p> <p>**Lison Mage** is an author, corporate facilitator, and high-performance coach.<br/> <br/>She works primarily with technology companies to elevate engagement, improve wellbeing and increase performance by providing their leaders and teams with practical and science-based strategies and tools, to foster cognitive diversity and enhance their decision-making processes.<br/> <br/>Ex-engineer, she went through a massive career change after working on three different continents in some of the major software companies such as Salesforce and Oracle, to embrace her vocation: empowering people and teams to perform at their full potential.<br/> <br/>She is the author of Act Before You overThink: Make Decisions Easier and Liberate Your Mind.<br/> <br/>For her research, she interviewed more than 365 overthinkers, backed up her findings with psychological studies and behavioural sciences and transformed them into invaluable insights, offering actionable solutions to free your mind, skyrocket your productivity and improve your wellbeing.<br/> </p> ",
    "end_time": 1669798800,
    "link": "https://www.meetup.com/experttalks-bristol/events/289335180/",
    "location": null,
    "org": "experttalks",
    "start_time": 1669795200,
    "title": "Act Before You overThink - how to make better engineering decisions fast"
}