{
    "cancelled": false,
    "description": "<p>**How do you do maintenance mode in a DevSecOps world, and why is that even a question?**</p> <p>Maintenance mode. Keeping the lights on. BAU support. Evergreening. To-may-to, to-mah-to. It happens when there’s no more funding for feature development in live digital services and data pipelines. There’s a need to resize teams to cut costs, to reassign people to start on new propositions…</p> <p>… but those live services aren’t dead, they’re just resting! Who does the library upgrades, security patches and defect fixes? Who preserves availability targets when there’s no more money to look after the live services that are making money?</p> <p>I’ve spent time with tens of different scaleups and enterprise organisations. Too many have used their operations team as a maintenance mode solution, and wondered afterwards why technical quality, reliability, and employee retention all took a hit. And if you think transitioning a live service into an operations team is hard, you should see the reverse when it’s back to the developers for more features.</p> <p>I’ll cover pros, cons, and examples from three different maintenance mode solutions - the operations team, regional developer support teams, and multi-product teams. And I’ll explain why multi-product teams as an extension of the You Build It You Run It operating model can give you a truly magnificent maintenance mode.<br/>\\*\\*\\*<br/>**Speaker**</p> <p>**Steve Smith, Head of Scale, Equal Experts**</p> <p>Steve is a principal consultant who advises clients worldwide on leadership in delivery, operations, and culture at scale.</p> <p>Steve has played key roles in multiple digital transformation programmes. He was a leader on a 60 team/600 microservices programme for a UK government department with £500Bpa revenue. He also implemented a Continuous Delivery and operability strategy for 30 teams/100 microservices in a high street retailer with £2Bpa online revenue. He’s written multiple books, such as [Measuring Continuous Delivery](<a href=\"https://www.amazon.co.uk/Measuring-Continuous-Delivery-Steve-Smith-ebook/dp/B08LYZDPMK\" class=\"linkified\">https://www.amazon.co.uk/Measuring-Continuous-Delivery-Steve-Smith-ebook/dp/B08LYZDPMK</a>) and [Build Quality In](<a href=\"https://www.leanpub.com/buildqualityin\" class=\"linkified\">https://www.leanpub.com/buildqualityin</a>).</p> <p>\\*\\*\\*<br/>This talk will be recorded and a link to the recording added in the Comments shortly after the event.</p> ",
    "end_time": 1682528400,
    "link": "https://www.meetup.com/experttalks-bristol/events/292970332/",
    "location": null,
    "org": "experttalks",
    "start_time": 1682524800,
    "title": "Not dead, just resting! Multi-product teams and a magnificent maintenance mode"
}