{
    "description": "<p>We’ve had two AWESOME events in Bristol, and we’ve come to the point where we need more help, hands on deck, and (wo)man-power! Not sure what we are about or know exactly what we are about? Either way, if you’re curious to meet friendly healthtech community organisers and might consider throwing your HAT in the ring, join us for a social! And… you must bring a HAT. Any hat will do!</p> <p>Let's get together, have a drink and make plans for world healthtech domination. Pardon, we mean Bristol domination. Find out how can you can get involved in the local hub, what's in it for your and why it'd be awesome for you to get involved.</p> <p>The whole hat thing? Just an ice-breaker. So bring one and start a conversation with another hat!</p> <p>BONUS: coolest hat wins a prize. *wink*</p> <p>Agenda (shortest agenda known to a hub event)</p> <p>7.00 pm -- Arrivals and networking</p> <p>7.30 pm -- A word from Fiona Dawson, Bristol Hub co-lead and your host for the evening</p> <p>7.40 pm -- Short acknowledgement of 'best hat' contenders</p> <p>7.50 pm -- Top 5 reasons you should join the Bristol Hub &amp; get involved</p> <p>8.00 pm -- More networking</p> <p>9.00 -- Event closes</p> <p>Please head over to our Eventbrite page and register, so we can get a feel for the numbers! <a href=\"https://www.eventbrite.co.uk/e/summer-social-the-hats-event-bring-a-hat-have-a-chat-tickets-46437529902\" class=\"linkified\">https://www.eventbrite.co.uk/e/summer-social-the-hats-event-bring-a-hat-have-a-chat-tickets-46437529902</a></p> ",
    "end_time": 1528401600,
    "link": "https://www.meetup.com/BristolOHThub/events/251235415/",
    "location": {
        "address": "168 Whiteladies Road",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.47019958496094,
        "longitude": -2.6149489879608154,
        "name": "Kings Arms"
    },
    "org": "BristolOHThub",
    "start_time": 1528394400,
    "title": "Summer Social: The HATS Event. Bring a hat, have a chat!"
}