{
    "cancelled": false,
    "description": "<p>Join One HealthTech in Bristol for an evening of fresh, thought-provoking discussion focused on the transformation of health and social care in the West of England.</p> <p>PLEASE RESERVE YOUR PLACE VIA EVENTBRITE: <a href=\"https://www.eventbrite.co.uk/e/whats-working-in-the-west-for-health-social-care-tech-tickets-50956783110\" class=\"linkified\">https://www.eventbrite.co.uk/e/whats-working-in-the-west-for-health-social-care-tech-tickets-50956783110</a></p> <p>We’ll be looking at some of the success stories from our region, celebrating key digital and tech projects, and learning from the highs and lows. We’ll also consider how we put people at the centre of health &amp; social care to ensure that all our transformational energy is heading in the right direction.</p> <p>Join us for drinks &amp; nibbles to share your stories of excellence, and tell us what you think other regions can learn from the West of England.</p> <p>AGENDA</p> <p>6:30 pm - Refreshments &amp; Networking</p> <p>7:00 pm – Welcome from Bevan Brittan, Event Sponsor</p> <p>7:05 pm – Welcome from One HealthTech</p> <p>7:15 pm – AHSNs role in supporting innovation and improvement in the NHS - Natasha Swinscoe, Managing Director, WEAHSN</p> <p>7:30 pm – Solving priorities as a system - Gemma Self, Head of Transformation and Programme Management at Healthier Together</p> <p>7:45 pm – Digital transformation - Deborah El-Sayed, Director of Transformation, BNSSG CCG</p> <p>8:00 pm – Digital redbook project and CSU landscape - Natasha Neads, Project Manager, Commissioning Support Unit</p> <p>8:15 pm – Q&amp;A / Community Shout Out</p> <p>8:35 pm – Drinks &amp; networking</p> <p>9:00 pm – Close</p> <p>ONE HEALTHTECH is a network that supports and promotes women and other underrepresented groups in health innovation, in order to build a health system that works for everyone.</p> <p>BEVAN BRITTAN is a UK Top 100 commercial law firm with a market – leading Health and Social Care practice. Our Digital Health and Med Tech teams are experts in the delivery of new technology within health and social care settings and provide a one-stop, integrated service drawing upon expertise across the firm’s Corporate, Commercial, Regulatory, Employment and Clinical Risk teams.</p> ",
    "end_time": 1541538000,
    "link": "https://www.meetup.com/BristolOHThub/events/255641147/",
    "location": null,
    "org": "BristolOHThub",
    "start_time": 1541529000,
    "title": "What’s Working in the West for Health & Social Care Tech?"
}