{
    "cancelled": false,
    "description": "<p>Join One HealthTech in Bristol for an evening of thought-provoking discussion focused on neuromodulation and the transformative impact it could have in healthcare.</p> <p>** As well as joining on Meetup, please get your ticket via Eventbrite<br/><a href=\"https://www.eventbrite.co.uk/e/neuromodulation-in-healthtech-tickets-56415933576\" class=\"linkified\">https://www.eventbrite.co.uk/e/neuromodulation-in-healthtech-tickets-56415933576</a><br/>If you only see a small number of attendees on Meetup it's because it's not our main platform **</p> <p>The nervous system is still one of the human body's part that the scientific society has the most to learn about. We now have described most of the nervous system structure, along with the whole body, but have yet to discover most of how it works and regulates our motor and cognitive functions, how it impacts our decision-making, sensibility, memory, reactions,...</p> <p>Neuromodulation is a technology that acts directly on the nervous system, whether in the brain or in the spinal cord. It is the alteration (modulation) of the nerve activity by delivering electrical signals to a target area. Neuromodulation is currently used to treat and enhance the quality of life in individuals who suffer severe chronic illness due to persistent pain, spasticity, movement disorders, epilepsy, ischaemia, cardiac, bowel and bladder dysfunction, spinal injury, visual, auditory and specific psychiatric disorders...</p> <p>What if we could replace drugs and their countless side effects with bioelectronic implants? The research in this area is accelerating quickly and Bristol is among the handful of pioneering centres all over the world driving it.</p> <p>Agenda<br/>6:30 pm -- Refreshments &amp; Networking</p> <p>7:00 pm – Welcome from Bevan Brittan, Event Sponsor</p> <p>7:05 pm – Welcome from One HealthTech</p> <p>7:15 pm – Non-invasive, transcranial stimulation during sleep -- Matt Jones, Professor of Neuroscience</p> <p>7:30 pm – Pain management with spinal cord stimulation -- Sarah Love-Jones, Consultant in Pain Medicine &amp; Anaesthesia, North Bristol NHS Trust</p> <p>7:45 pm – Latest innovations in deep brain stimulation, Helene Viatge, CEO, Biondinduction</p> <p>8:00 pm – Q&amp;A / Community Shout Out</p> <p>8:30 pm – Drinks &amp; networking</p> <p>9:30 pm – Close</p> ",
    "end_time": 1554323400,
    "link": "https://www.meetup.com/bristolohthub/events/260144260/",
    "location": {
        "address": "1 Canon's Road",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451393127441406,
        "longitude": -2.5982589721679688,
        "name": "Watershed"
    },
    "org": "BristolOHThub",
    "start_time": 1554312600,
    "title": "NEUROMODULATION IN HEALTHTECH"
}