{
    "cancelled": false,
    "description": "<p>Startups Magazine, in collaboration with One HealthTech Bristol, invites you to an evening of talks and workshops designed to raise awareness and create a network of support for founder wellbeing, while shining a light on healthtech startups setting out to heal and help others.</p> <p>*** GET YOUR TICKET AT ***<br/><a href=\"http://bit.ly/OHTStartups\" class=\"linkified\">http://bit.ly/OHTStartups</a></p> <p>Working for a startup can be all-consuming, often you are essential to the daily running of the business and without you everything comes to a standstill. This can mean that mental health ends up taking a backseat and is not considered a priority.</p> <p>As part of our mission to help startups on their entrepreneurial journeys, this event will be launching our May/June issue which is dedicated to both healthtech startups, and features examining startup wellbeing and offering practical tips and advice.</p> <p>We invite you to an evening of talks and a workshop to learn more about the latest healthtech innovations and to raise awareness about the importance of looking after your mental, emotional and physical health as a startup.</p> <p>JOIN US FOR AN EVENING OF:<br/>Inspiring talks<br/>Panel discussions<br/>Q&amp;A<br/>Business plan mentoring<br/>Resilience workshop<br/>Fizz, nibbles &amp; relaxed networking<br/>Free copy of Startups Magazine<br/>Workshop with OpenMind Wellbeing</p> <p>DOORS OPEN AT 6PM FOR RELAXED NETWORKING WITH FIZZ AND NIBBLES, WITH A PROMPT START AT 6.30PM<br/>With special thanks to our sponsors SETsquared Bristol!</p> <p>Agenda<br/>Warm welcome from Startups Magazine<br/>An introduction to Setsquared Bristol: Monika Radclyffe, Centre Director, Setsquared Bristol</p> <p>Monika is the Director of the SETsquared Bristol Business Incubation Centre, where she manages the Centre’s strategy and delivery of incubation activity to 80+ technology ventures.</p> <p>Opening talk 'The silent struggle: What impact is founder wellbeing having on startup performance?': Christina Richardson, Co-Founder &amp; Chief Firestarter, weare3Sixty<br/>Christina Richardson, Weare3Sixty</p> <p>OpenMind Wellbeing workshop with Debbie Thomas: Making Space<br/>'Making Space' a 15 minute guided meditation to put your day behind you, settle into the present and prepare for a great night of sharing and learning.</p> <p>Healthtech panel talk: moderated by Sally Powell, OneHealth Tech Bristol</p> <p>Sally Powell is Hub Lead for One HealthTech Bristol; and a Freelance Marketing and Communications Consultant and Content Creator for all things Tech and Healthtech. Her background is in engineering and journalism, and she has multi-sector experience, most recently in electronics design software. She’s passionate about healthtech, how Bristol and the South West are going places, and wild swimming.</p> <p>Panelists include:<br/>James Flint, Co-Founder &amp; CEO, Hospify<br/>Nicky Hemmings, Lead Psychologist, Biobeats<br/>Xavier Louis, CEO, Peak<br/>Ally Fekaiki, Founder, Juno</p> <p>Fireside chat with Dannielle Haig, Business Psychologist &amp; Director, DH Coaching &amp; Consulting<br/>Dannielle Haig</p> <p>OpenMind Wellbeing workshop with Debbie Thomas:</p> <p>Relaxed Networking &amp; Business Plan Clinic<br/>Business plan workshop with Kevin Smith, AWS Consultancy</p> <p>Big thanks to our Wellness Partner:<br/>Workshop: OpenMind Wellbeing</p> ",
    "end_time": 1558641600,
    "link": "https://www.meetup.com/BristolOHThub/events/260572169/",
    "location": null,
    "org": "BristolOHThub",
    "start_time": 1558630800,
    "title": "Startup Wellness // Health Tech Startups"
}