{
    "cancelled": false,
    "description": "<p>Please book your ticket directly with One HealthTech Bristol at <a href=\"https://www.onehealthtech.com/bristol/#MU\" class=\"linkified\">https://www.onehealthtech.com/bristol/#MU</a></p> <p>We're pleased to host this event as part of the first ever Bristol Technology Festival #BrisTechFest</p> <p>Thank you to our sponsors Bevan Brittan &amp; Engine Shed, and event collaborator Mundy &amp; Anson, for all your support.<br/>-----</p> <p>EVENT OUTLINE</p> <p>AI offers life-changing and cost-saving outcomes for health and care. But separating the opportunities from the hype, and balancing the risks against the rewards, is hard. We know there’s so much we could do – but how do we decide whether we should do it?</p> <p>We’ll be looking at practical AI applications as well as debating complex issues, and discussing the value social scientists can bring to AI project teams. Aimed at both subject newcomers and experts from diverse professional and personal backgrounds, this event will be in our usual interactive style, wrapped up with friendly networking.</p> <p>This event is brought to you by the Bristol team at One HealthTech, a global, grassroots community that supports and promotes better openness, inclusion, kindness and diversity in health innovation; and Mundy &amp; Anson, organisers of the Anthropology &amp; Technology Conference which took place in Bristol on 3 October 2019.</p> <p>We’ll distill some of the discussions and themes from the Anthropology &amp; Technology Conference, where the role of social scientists in helping develop socially-responsible AI will be explored. Hear from speakers ranging from companies, policy influencers and technology experts working in this area, followed by a panel Q&amp;A and open discussion.</p> <p>IS THIS FOR ME?</p> <p>This will be a wide-ranging and practical event aimed at a range of attendees. We’re aiming to navigate some of the grey areas in this complex field and help further everyone’s understanding. The event may therefore appeal to people from a range of professional backgrounds including (but not limited to): clinical and non-clinical healthcare professionals, social scientists, academics, creatives with an interest in ethical AI, start-ups, technologists, product managers and developers.</p> <p>AGENDA</p> <p>2.30pm - Registration</p> <p>2.45pm - Prompt start &amp; welcome by Sally Powell, Hub Lead, One HealthTech Bristol</p> <p>Introductory talk: Dawn Walter, Mundy &amp; Anson – Why you need social scientists in your technology team</p> <p>Lightning talks:</p> <p>Laura Sobola, Elucidata – AI in medicine: Informed consent and unintended consequences<br/>Ellie Foreman, Automation Fellow for the South West Creative Technology Network – Designing conversational AI for emotional support.</p> <p>3.25pm - Networking, tea and cake</p> <p>4.00pm - Panel discussion and Q&amp;A</p> <p>Anne Marie Cunningham, GP and Associate Medical Director for Primary Care, NHS Wales Informatics Service. Plus panel members from University of Bristol, NHS and commercial consultancy.</p> <p>Networking &amp; close</p> <p>TICKETS</p> <p>Tickets are FREE, however as One HealthTech is a volunteer-led community we rely on our amazing sponsors and donations from attendees to help us host our well-regarded events. Please consider choosing a donation ticket, especially you're attending on behalf of your company and can expense it.</p> <p>ACCESSIBILITY</p> <p>We’ve been awarded a Fairer Tech grant from doteveryone to make our events more accessible (woop woop!)</p> <p>If for any reason there are barriers to engaging in the community we invite anyone to apply for up to £30 (but ask for more if you need, worth a try) per person per event to cover personal costs to improve this. The money can cover just about anything, including but not limited to child/other care, taxis if you’re not able-bodied, trains if you live out in the countryside, a live captioner, recording of the event or loss of earnings if you have a side job along your studies. If you feel it’s a barrier, we agree too. Find out more at <a href=\"https://www.onehealthtech.com/accessibiltity-fund\" class=\"linkified\">https://www.onehealthtech.com/accessibiltity-fund</a></p> ",
    "end_time": 1573059600,
    "link": "https://www.meetup.com/bristolohthub/events/265716014/",
    "location": null,
    "org": "BristolOHThub",
    "start_time": 1573050600,
    "title": "AI in Health and Care – How do we innovate responsibly? (Tickets via link only)"
}