{
    "cancelled": false,
    "description": "<p>Please book your ticket directly with One HealthTech Bristol at <a href=\"https://www.onehealthtech.com/bristol/#MU\" class=\"linkified\">https://www.onehealthtech.com/bristol/#MU</a></p> <p>We are excited to start the decade with our first ever “Conversations on .. “ discussion event and very much within the spirit of One HealthTech we are discussing Caroline Criado Perez’s book “Invisible Women: Exposing Data Bias in a World Designed for Men”.</p> <p>Thank you to our sponsors Bevan Brittan for all your support.<br/>-----</p> <p>EVENT OUTLINE</p> <p>Caroline’s book focuses on the existence of gender data gap and the consequences borne by women all over the world. The use of “Reference Man” in medicine has led to misdiagnosing women with heart attacks and dispensing incorrect drug dosages, while the lack of gender-segregated data in pharma is reducing our opportunity to find drugs that work better (or at all!) for women. The book has received wide critical acclaim and has fostered discussions surrounding the gender data gap and more inclusive design and research.</p> <p>The “Conversations on .. “ events are a place to foster discussions about something that we all care about.. Therefore, it would be great if you are able to read “Invisible Women” before coming to the event - check out your local bookshop or library or ask a friend for a copy! However, do not worry if you are unable to read it before the event, as there are a number of online articles that cover some aspects of the content. There will also be a short talk giving the introduction to the book at the beginning of the event.</p> <p>This event is the first in a series that will touch on topics relating to healthtech careers and personal development. As always, all are welcome.</p> <p>TL:DR - Read “Invisible Women” if you can and join us for a great evening of discussion of the gender data gap!</p> <p>AGENDA</p> <p>7:00pm - Welcome and registration</p> <p>7:30pm - Introduction to One HealthTech and community shout-out</p> <p>7:35pm - Starting the conversation<br/>A short introduction of the book “Invisible Women” from our OHT Bristol volunteer, Laura Sobola, followed by book club style discussions in groups</p> <p>9:00pm - Close the event and move to the Boardroom’s bar for further discussions</p> <p>TICKETS</p> <p>Tickets are FREE, however as One HealthTech is a volunteer-led community we rely on our amazing sponsors and donations from attendees to help us host our well-regarded events. Please consider choosing a donation ticket, especially you're attending on behalf of your company and can expense it.</p> <p>ACCESSIBILITY</p> <p>We’ve been awarded a Fairer Tech grant from doteveryone to make our events more accessible (woop woop!)</p> <p>If for any reason there are barriers to engaging in the community we invite anyone to apply for up to £30 (but ask for more if you need, worth a try) per person per event to cover personal costs to improve this. The money can cover just about anything, including but not limited to child/other care, taxis if you’re not able-bodied, trains if you live out in the countryside, a live captioner, recording of the event or loss of earnings if you have a side job along your studies. If you feel it’s a barrier, we agree too. Find out more at <a href=\"https://www.onehealthtech.com/accessibiltity-fund\" class=\"linkified\">https://www.onehealthtech.com/accessibiltity-fund</a></p> ",
    "end_time": 1581541200,
    "link": "https://www.meetup.com/bristolohthub/events/268137477/",
    "location": null,
    "org": "BristolOHThub",
    "start_time": 1581534000,
    "title": "Conversations on Invisible Women (Tickets via link only)"
}