{
    "cancelled": true,
    "description": "<p>Please book your ticket directly with One HealthTech Bristol at <a href=\"https://www.onehealthtech.com/bristol/\" class=\"linkified\">https://www.onehealthtech.com/bristol/</a></p> <p>-----</p> <p>EVENT OUTLINE</p> <p>Do you need some impartial support in your health tech career, or maybe just a small boost? Well we at One HealthTech Bristol are all about supporting women and people from diverse backgrounds in their health tech careers, so we’d love you to join us for our event: Navigating your Health Tech Career, timed to celebrate International Women’s Day.</p> <p>This event is for anyone looking to make a shift within their career; be it from a clinical to non-clinical role, from outside of health tech into health tech, or from a more junior to more senior post and everything in-between.</p> <p>We’ll be offering practical guidance on how to navigate these changes. Firstly by hearing the experiences and tips which have helped facilitate career shifts within health tech, then through a hands-on workshop, which will hone in on how you can steer your career by understanding yourself and others using c-me colour profiling.</p> <p>Join us for engaging talks, chats and food, and be ready to get the information and umph you need to take the next step.</p> <p>Already have questions? Please post them on our Sli.do ready for an engaging Q&amp;A on the day.</p> <p>Can’t make it on the day? Don’t panic! Just join our community and get informal support at any of our events or our #hub-bristol Slack channel at oht-community.slack.com.</p> <p>Thank you to our wonderful sponsor Modular (thisismodular.co.uk), a Bristol-based UX design and build agency, for providing a great space for us to meet and Friska goodies to keep our energy up during the talks and workshop.</p> <p>AGENDA</p> <p>6:00pm - Arrival and registration</p> <p>6.20pm - Welcome from One HealthTech</p> <p>Personal perspectives on healthtech careers</p> <p>* Raf Sorribas - Chief Information Officer at Devon Partnership NHS Trust</p> <p>* Wendy Dearing - Head of Workforce and Organisational Development at NHS Wales Informatics Service</p> <p>Community shout-out and introduction to pre-workshop activity</p> <p>Food and networking</p> <p>Workshop: Understanding yourself and others using CMe behavioural profiling - Sarah Williams, CEO at TEAMango</p> <p>8:45pm - Event close</p> <p>----------------</p> <p>SPEAKER BIOS</p> <p>RAF SORRIBAS<br/>@DPT_CIO</p> <p>Raf Sorribas is a Bristol based Health Informatics professional currently working as the Chief Information Officer at Devon Partnership NHS Trust.</p> <p>WENDY DEARING<br/>@WBtinter</p> <p>With a nursing background, Wendy holds an MSc in Change &amp; Innovation and was been awarded an Honorary Professorship from the University of Wales Trinity St David.</p> <p>SARAH WILLIAMS<br/>@TEAMangoUK @mangomad4tech</p> <p>Sarah Williams is the CEO of TEAMango who support scaling tech firms looking for help with and direction on their complete people agenda. Sarah founded TEAMango back in 2015 with a passion to work with companies that truly put their people first.</p> <p>----------------------------</p> <p>TICKETS</p> <p>Tickets are FREE, however as One HealthTech is a volunteer-led community we rely on our amazing sponsors and donations from attendees to help us host our well-regarded events. Please consider choosing a donation ticket, especially you're attending on behalf of your company and can expense it.</p> <p>ACCESSIBILITY</p> <p>We’ve been awarded a Fairer Tech grant from doteveryone to make our events more accessible (woop woop!)</p> <p>If for any reason there are barriers to engaging in the community we invite anyone to apply for up to £30 per person per event to cover personal costs to improve this. The money can cover just about anything, including but not limited to child/other care, taxis if you’re not able-bodied, trains if you live out in the countryside, a live captioner, recording of the event or loss of earnings if you have a side job along your studies. Find out more at <a href=\"https://www.onehealthtech.com/accessibiltity-fund\" class=\"linkified\">https://www.onehealthtech.com/accessibiltity-fund</a></p> ",
    "end_time": 1584046800,
    "link": "https://www.meetup.com/BristolOHThub/events/269032267/",
    "location": {
        "address": "1 Temple Way, Bristol, BS2 0BY",
        "city": "London",
        "country": "gb",
        "latitude": 51.454830169677734,
        "longitude": -2.5828421115875244,
        "name": "Oak Tree, Desklodge Bristol"
    },
    "org": "BristolOHThub",
    "start_time": 1584036000,
    "title": "Navigating your Healthcare Career (Tickets via link only)"
}