{
    "cancelled": false,
    "description": "<p>Please book your ticket directly with One HealthTech Bristol at <a href=\"https://www.onehealthtech.com/bristol/\" class=\"linkified\">https://www.onehealthtech.com/bristol/</a></p> <p>One HealthTech Bristol is delving into the topic of Social Prescribing and discovering together whether it has the answers for supporting our return to the \"old normal\". Join us and Signum Health (<a href=\"https://www.signum-health.com/products/inavigator-new/\" class=\"linkified\">https://www.signum-health.com/products/inavigator-new/</a>) CEO Victoria Newman for our next Virtual Article Cahoot!</p> <p>The pandemic has brought about incredible challenges to everyone's health and wellbeing. The social isolation, anxiety and disruption has been totally unprecedented.</p> <p>As we start to look towards our recovery with health services at maximum capacity, what support is available? Could Social prescribing, a means of enabling health professionals to refer people to a range of local services which support their health and wellbeing, be the answer?<br/>_____________________________________________________________________________________</p> <p>Before the event</p> <p>You can swot up by looking at the following resources (but don’t worry if you don’t have time as we’ll bring everyone up to speed on the day)</p> <p>* If you have 2 minutes, watch this short video - <a href=\"https://www.youtube.com/watch?v=WE54-5R1sDk\" class=\"embedded\">https://www.youtube.com/watch?v=WE54-5R1sDk</a></p> <p>* If you have 10 minutes, read the King's Fund article on social prescribing - <a href=\"https://www.kingsfund.org.uk/publications/social-prescribing\" class=\"linkified\">https://www.kingsfund.org.uk/publications/social-prescribing</a></p> <p>* If you have 45minutes, read the above and listen to Primary Care Knowledge Boost on Social Prescribing - <a href=\"https://open.spotify.com/episode/2Oc6AvXTXtARWk8obxCQL0?si=VzW8B5QpTlmYjAo9w-1rtQ&amp;utm_source=copy-link&amp;nd=1\" class=\"linkified\">https://open.spotify.com/episode/2Oc6AvXTXtARWk8obxCQL0?si=VzW8B5QpTlmYjAo9w-1rtQ&amp;utm_source=copy-link&amp;nd=1</a><br/>_____________________________________________________________________________________</p> <p>On the Day</p> <p>The One HealthTech Bristol Hub is looking forward to discussing this topic with you and pondering on…</p> <p>* Could Social Prescribing play a key role in the global recovery from the pandemic?</p> <p>* What will be the challenges of adapting back to the old normal?</p> <p>* How might we ensure services are accessible and inclusive?</p> <p>* What role does technology have to play?</p> <p>We’ll all be ‘in cahoots’ together and we’re looking forward to learning something new with you all!</p> <p>Schedule</p> <p>6:00pm - Welcome</p> <p>6:05pm - Introduction to OHT</p> <p>6:10pm - Starting the Conversation</p> <p>Introduction to Social Prescribing by Victoria Newman followed by book-club style discussion</p> <p>7:10pm - Community Shout Out &amp; Close</p> <p>One HealthTech Bristol would love to delve into this topic as a group of interested non-experts and chat about our thoughts and experiences at our second Virtual Article Cahoot!</p> <p>Tickets</p> <p>Tickets are FREE, however as One HealthTech is a volunteer-led community we rely on our amazing sponsors and donations from attendees to help us host our well-regarded events. Please consider choosing a donation ticket, especially if you're attending on behalf of your company and can expense it.</p> <p>Accessibility</p> <p>We’ve been awarded a Fairer Tech grant from doteveryone to make our events more accessible and cover personal costs. Find out more at <a href=\"https://www.onehealthtech.com/accessibiltity-fund\" class=\"linkified\">https://www.onehealthtech.com/accessibiltity-fund</a></p> ",
    "end_time": 1619028000,
    "link": "https://www.meetup.com/BristolOHThub/events/277660206/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "BristolOHThub",
    "start_time": 1619024400,
    "title": "Social Prescribing - the answer to our Covid Recovery? A Virtual Article Cahoot!"
}