{
    "cancelled": false,
    "description": "<p>Please book your ticket directly with One HealthTech Bristol at <a href=\"https://www.onehealthtech.com/bristol/\" class=\"linkified\">https://www.onehealthtech.com/bristol/</a></p> <p>Our first Social Prescribing event was so jam-packed full of insight that we ran out of time to get into deep cahoots! So join us for round 2 where we will share, discuss and discover together whether Social Prescribing is the answer to our Covid recovery.</p> <p>OneHealthTech Bristol and a bunch of Social Prescribing enthusiasts and novices got together on the 21st April to delve into the topic of Social Prescribing and whether it could be the answer to our Covid Recovery. At the event, Victoria Norman from Signum Health (<a href=\"https://www.signum-health.com/products/inavigator-new/\" class=\"linkified\">https://www.signum-health.com/products/inavigator-new/</a>) and Jordan Rimmington from The Chalk Effect Climbing Project (<a href=\"https://jordanchalkpz.wixsite.com/chalkclimbing\" class=\"linkified\">https://jordanchalkpz.wixsite.com/chalkclimbing</a>) gave us an inspiring and insightful introduction into the area. You can catch up on everything that was discussed in our blog.</p> <p>Now it's our chance to delve into discussions as a group of interested non-experts and chat about our thoughts and experiences at our Social Prescribing Virtual Article Cahoot - round 2!<br/>_____________________________________________________________________________________</p> <p>Before the event</p> <p>You can swot up by looking at the following resources (but don’t worry if you didn't attend the previous event or don’t have time to prep beforehand as we’ll bring everyone up to speed on the day)</p> <p>* If you have 2 minutes, watch this short video - <a href=\"https://www.youtube.com/watch?v=WE54-5R1sDk\" class=\"embedded\">https://www.youtube.com/watch?v=WE54-5R1sDk</a></p> <p>* If you have 10 minutes, read the King's Fund article on social prescribing - <a href=\"https://www.kingsfund.org.uk/publications/social-prescribing\" class=\"linkified\">https://www.kingsfund.org.uk/publications/social-prescribing</a></p> <p>* If you have 45minutes, read the above and listen to Primary Care Knowledge Boost on Social Prescribing - <a href=\"https://open.spotify.com/episode/2Oc6AvXTXtARWk8obxCQL0?si=VzW8B5QpTlmYjAo9w-1rtQ&amp;utm_source=copy-link&amp;nd=1\" class=\"linkified\">https://open.spotify.com/episode/2Oc6AvXTXtARWk8obxCQL0?si=VzW8B5QpTlmYjAo9w-1rtQ&amp;utm_source=copy-link&amp;nd=1</a><br/>_____________________________________________________________________________________</p> <p>On the day</p> <p>The One HealthTech Bristol Hub is looking forward to discussing this topic with you and pondering on…</p> <p>* Could social prescribing play a key role in the global recovery from the pandemic?<br/>* What will be the challenges of adapting back to the old normal?<br/>* How might we ensure services are accessible and inclusive?</p> <p>Schedule</p> <p>6:00pm - Welcome</p> <p>6:05pm - Introduction to One HealthTech and Community shout-out</p> <p>6:10pm - Starting the conversation</p> <p>A short catch-up from the last event, followed by a book club style discussion</p> <p>7:00pm - Event close</p> <p>We’ll all be ‘in cahoots’ together to talk it all over and we’re looking forward to learning something new with you all!</p> <p>Tickets</p> <p>Tickets are FREE, however as One HealthTech is a volunteer-led community we rely on our amazing sponsors and donations from attendees to help us host our well-regarded events. Please consider choosing a donation ticket, especially if you're attending on behalf of your company and can expense it.</p> <p>Accessibility</p> <p>We’ve been awarded a Fairer Tech grant from doteveryone to make our events more accessible and cover personal costs. Find out more at <a href=\"https://www.onehealthtech.com/accessibiltity-fund\" class=\"linkified\">https://www.onehealthtech.com/accessibiltity-fund</a></p> ",
    "end_time": 1620842400,
    "link": "https://www.meetup.com/bristolohthub/events/277957892/",
    "location": null,
    "org": "BristolOHThub",
    "start_time": 1620838800,
    "title": "Social Prescribing - the answer to our Covid Recovery? The Discussion"
}