{
    "cancelled": false,
    "description": "<p>Please book your ticket directly with One HealthTech Bristol at [<a href=\"https://www.onehealthtech.com/events-1/one-healthtech-bristol-community-relaunch](https://www.onehealthtech.com/events-1/one-healthtech-bristol-community-relaunch\" class=\"linkified\">https://www.onehealthtech.com/events-1/one-healthtech-bristol-community-relaunch](https://www.onehealthtech.com/events-1/one-healthtech-bristol-community-relaunch</a>)</p> <p>Get set for an epic evening of networking!</p> <p>Join us on Wednesday, June 19th, for the OHT Bristol Relaunch Networking Extravaganza! It's not just your ordinary after-work event - we're bringing together structured networking, chill vibes, and plenty of pizza to mark this special occasion. All welcome!</p> <p>Join us for a friendly and accessible event to bring together voices from across Bristol's health tech and innovation community who might not otherwise meet. This is your chance to shape the future of One HealthTech Bristol while kicking back with like-minded people.</p> <p>Who is the event for? Our events are for everyone! Whether you're already immersed in the health tech world or aspiring to join, we welcome individuals from all backgrounds. If you're involved or interested in digital health, medical technology, health tech, biotech, fit tech, femtech, or health innovation across industry, academia, policy, or healthcare provision, you'll find a home in our community.</p> <p>Stay tuned for more details - and don't forget to spread the word! Let's turn this into the launch event of the year!</p> ",
    "end_time": 1718823600,
    "link": "https://www.meetup.com/bristolohthub/events/301151588/",
    "location": {
        "address": "Temple Gate",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.44817352294922,
        "longitude": -2.5817110538482666,
        "name": "Temple Studios"
    },
    "org": "BristolOHThub",
    "start_time": 1718816400,
    "title": "Bristol Hub Relaunch (Tickets via link only)"
}