{
    "cancelled": false,
    "description": "<p><b>Agenda:</b></p> <p>• 7:00pm - 7:25 pm Social</p> <p>• 7:25pm - 7:30 pm OWASP updates / Speakers intro  </p> <p>• 7:30pm - 8:15 pm <b>Presentation 1</b>: \"Devops &amp; Continuous Delivery Security\" </p> <p>• 8:15pm - 9:00 pm <b>Presentation 2</b>: \"Dip Your Toes in the Sea of Security\"</p> <p>• 9:00 pm Networking - heading for a beer at  <a href=\"https://www.jdwetherspoon.com/pubs/all-pubs/england/bristol/the-knights-templar-bristol\">The Knights Templar</a> !</p> <p><b><br/></b></p> <p><b><br/></b></p> <p><b>Speakers: </b></p> <p><b>Presentation 1 :</b> Devops &amp; Continuous Delivery  Security </p> <p>In this talk Jason will show how security and its normal practices needs to evolve or become even less irrelevant in a world where 300 fundamental changes to an application takes place every day.  Jason will then explain how the devops/CD approach can actually be leveraged to improve security of applications.</p> <p><b>Bio</b>:  Jason  has worked in the IT &amp; Cyber Security industry for 18 years. Currently a Security Architect within <a href=\"https://www.kpmg.co.uk/\">KPMG</a>’s Cyber consultancy he has worked with numerous clients looking to move to  a more agile development methodology and enabling secure deployments to the cloud. A proud OWASP member for the last 7 years and serial OWASP chapter starter, he is an active member of the security community. </p> <p>A recent winner of a <a href=\"https://www.owasp.org/index.php/WASPY_Awards_2015\">WASPY award</a>,  can be found tweeting useful security “stuff”  at <a href=\"http://www.twitter.com/0wasp\">@0wasp</a> – be warned account is used to moan about many things not security related!</p> <p><b>Presentation 2 : </b>Dip Your Toes in the Sea of Security</p> <p>Security is an enormous topic, and it’s really, really complicated. If you’re not careful, you’ll find yourself vulnerable to any number of attacks which you definitely don’t want to be on the receiving end of. This talk will give you just a taster of the vast array of things there is to know about security in modern web applications, such as writing secure PHP web applications and securing a Linux server. Whether you are writing anything beyond a basic brochure website, or even developing a complicated business web application, this talk will give you insights to some of the things you need to be aware of.</p> <p><b>Bio:</b>  James Titcumb is the founder of the UK based PHP Hampshire user group and the PHP South Coast Conference. He’s also a Zend Certified Engineer and consultant at Roave. During his downtime, he continues to run the PHP Hampshire user group and the conference, and keeps up with active contributions to various open source projects.</p> <p>_____________________________________________________</p> <p><b>Sponsors</b></p> <p>Special thanks to our venue host <a href=\"http://www.kpmg.co.uk/\">KPMG</a> , who  has kindly offered to host the evening at their office, and provide drinks and pizza.</p> <p>Afterwards we'll head for a beer at <a href=\"https://www.jdwetherspoon.com/pubs/all-pubs/england/bristol/the-knights-templar-bristol\">The Knights Templar</a> !</p> ",
    "end_time": 1447966800,
    "link": "https://www.meetup.com/owasp-bristol/events/226348152/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1447959600,
    "title": "OWASP Meetup"
}