{
    "cancelled": false,
    "description": "<p>Our next meeting is on Thursday, 21st of January 2016. </p> <p>This will be kindly hosted by Just-eat.com, who will also provide the food and drinks.</p> <p>We’ve got two talks and the agenda is:</p> <p>• 7:00pm - Social</p> <p>• 7:25pm - OWASP updates / Speakers intro  </p> <p>• 7:30pm - Presentation 1: Chris Dare - \"Don't Panic - Maintain Security in Continuous Deployments\"  </p> <p>• 8:15pm - Presentation 2:  Dan Billing - \"New Adventures in Security Testing\"</p> <p>• After talks head to <a href=\"http://www.smallbar.co.uk/\">\"Small Bar\"</a> pub</p> <p><b>Presentation 1:  </b>Don't Panic - Maintain Security in Continuous Deployments</p> <p><b>Abstract</b>: Continuous deployment may seem intimidating to the information security professional - there's no way most security teams have the scale to approve each release. I'll show how you continuous deployment can be a benefit to security, and how changes to process as well as tooling can ensure risk is kept at an acceptable level.</p> <p><b>Bio</b>: Chris Dare is an developer turned application security specialist at JUST EAT, based in Bristol. </p> <p><b>Presentation 2: </b>New Adventures in Security Testing</p> <p><b>Abstract:</b> For me, being a tester is as much about learning new skills and ways of working as it is creating great products and services for customers as part of a great development team. After more than ten years as a tester, and a period where I really didn’t know where my career was going, I’d like to talk about how security testing has reinvigorated my love for testing by introducing me to new ideas, techniques and possibilities. I’d also like to demonstrate how I approach security testing in my day to day work, making what appears to be a dark art much more accessible for testers who aren’t penetration testing experts.</p> <p><b>Bio </b>: Dan Billing  has been a tester for 14 years, working within a diverse range of development organisations, mostly in the south west of England. He currently works as a test engineer at New Voice Media, where most of his time is spent working on the security testing needs of the business. This includes mentoring, supporting and training members of the team to use these skills also.</p> <p>Dan’s love of testing drives me to become an active member of the testing community, helping to organise local meet-ups and talks in the Bristol and Bath area.</p> <p>He has recently spoken at MEWT, (Midlands Exploratory Workshop in Testing) as well as the Bristol, Brighton and Nottingham tester gatherings. This summer, Dan worked with BIll Matthews to deliver a security testing tutorial at Let’s Test and at Nordic Testing Days, where he also gave his talk “The Testing of Fear”.</p> <p>He is a facilitator with Weekend Testing Europe, alongside Neil Studd and Amy Studd. He is also the organiser of the South West Exploratory Workshop in Testing.</p> <p>Dan lives in Frome, Somerset  with his wife Rae, and cat, Misty.</p> <p><b>Sponsors</b></p> <p>Thanks to JustEat who are hosting and sponsoring us food and drinks for the evening :)</p> <p><b>After meeting</b></p> <p>For those that want to discuss further, head to <a href=\"http://www.smallbar.co.uk/\">\"Small Bar\"</a> pub. </p> ",
    "end_time": 1453411800,
    "link": "https://www.meetup.com/OWASP-Bristol/events/227419895/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1453402800,
    "title": "OWASP Bristol January meetup"
}