{
    "description": "<p>In the last meeting we've seen how to secure the applications using Threat Modelling. In this session you will learn how to break them. Come and see how to hack a Mitsubishi Outlander!</p> <p><b>Agenda</b>:</p> <p>• 6:30pm - Social</p> <p>• 6:45pm - OWASP updates / Speakers intro  </p> <p>•  Presentation 1: Vitor Jesus  -  \"<i>OT is not IT</i>\"</p> <p>•  Presentation 2: Ken Munro  - Car Hacking </p> <p>• After - we go to  <a href=\"http://www.smallbar.co.uk/locations-1/\">Small Bar</a> on King street. </p> <p><b>Presentation 1:  </b>OT is not IT<br/>Operational Technologies (OT) is an acronym coined to make the distinction to IT. You see OT in action whenever you call for an elevator or wait for a green light. Less visible, they are the heart of automation (Steel, Power, Water, Automotive, Pharma, etc.). They are also in IoT or Medical devices,for example, where, amongst other factors, they share the criticality and real time elements.<br/>A 80/20 rule can be applied when comparing to IT. Whereas IT and OT share 80% of technologies and practices, the remaining 20% renders them unique to the point that a CCNE or a CISSP are not adequate. Everything changes: vendors, development processes, regulations &amp; standards, protocols, goals, etc. This talk will go over the differences.</p> <p>• <b>Bio: </b><a href=\"https://uk.linkedin.com/in/vitorjesus\">Vitor Jesus</a> works on Networks and Cyber Security with a focus on OT: SCADA/ICS, Embedded Systems, Internet-of-Things, Secure Software Development, etc. Having started with a degree in Physics, soon moved to Electronics and then Networks at well-knonw names such as Philips, Nokia-Siemens, Alcatel-Lucent and General Electric. A big part of his career was spent on Universities (University of Aveiro, Portugal, and Carnegie Mellon, US) lecturing and researhcing Network Architectures. He holds a PhD and a GIAC GICSP, an Industrial Cyber Security Certification. He also has Bitcoins and never ceases to be amazed with its Security tragedies.</p> <p><b>Presentation 2: Car hacking</b></p> <p>The final Eureka moment might seem surprisingly easy, but what does the A to Z of hacking the Mitsubishi Outlander look like?</p> <p>This talk will demonstrate how to locate a target vehicle, the initial MITM attack, PSK cracking, Android app reversing, and then reversing a binary protocol. It’ll have some <b>previously unreleased research</b> and an open floor for Q&amp;A too.</p> <p><b>Bio</b>: <a href=\"https://uk.linkedin.com/in/ken-munro-17899b1\">Ken Munro </a>(Partner &amp; Founder Pen Testers) is a highly acclaimed and respected security professional who is well known on the speaking circuit for his engaging and insightful presentations. He has been working in IT security for over 15 years and writes for various newspapers and industry magazines in an effort to get beyond the unhelpful scaremongering put about by many security vendors.<br/>Twitter: <a href=\"https://twitter.com/TheKenMunroShow\"> @TheKenMunroShow</a> </p> ",
    "end_time": 1469133000,
    "link": "https://www.meetup.com/OWASP-Bristol/events/231317587/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45161437988281,
        "longitude": -2.5968339443206787,
        "name": "Just-eat.com"
    },
    "org": "OWASP-Bristol",
    "start_time": 1469122200,
    "title": "OWASP Bristol - OT & Car hacking"
}