{
    "cancelled": false,
    "description": "<p>Learn about the security controls that can be incorporate in Software Development Life Cycle and help building more secure applications.</p> <p><b>Agenda</b>:</p> <p>• 7:00 pm - Social</p> <p>• 7:30 pm - OWASP Top 10 Proactive Controls </p> <p>• After - we go to  <a href=\"http://www.smallbar.co.uk/locations-1/\">Small Bar</a> on King street. </p> <p>Presentation: OWASP Top 10 Proactive Controls</p> <p>Cyber attacks are a real and growing threat to businesses and an increasing number of attacks take place at application layer. The best defence is to develop applications where security controls are incorporated as part of the software development cycle and used by developers while writing their code.</p> <p>OWASP Top 10 Proactive Controls considers security as part of development.</p> <p>This talk will present the proactive security controls that can be incorporated in development cycle and used while writing the software.  By the end of this presentation you will have a better understanding of  the recommended security controls that you can incorporate into your software projects. For each control, you will learn which OWASP Top 10 Risks can prevent.</p> <p><b>Bio</b>: Katy Anton  - OWASP Bristol chapter lead - comes from development background .</p> <p>In her current role as Application Security Consultant at Veracode, Katy works with developers and architects around the world and help them secure their software.</p> ",
    "end_time": 1489096800,
    "link": "https://www.meetup.com/OWASP-Bristol/events/235736769/",
    "location": {
        "address": "66 Queen Square Bristol BS1 4BE ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45133590698242,
        "longitude": -2.5952088832855225,
        "name": "KPMG"
    },
    "org": "OWASP-Bristol",
    "start_time": 1489086000,
    "title": "OWASP Top 10 Proactive Controls"
}