{
    "cancelled": false,
    "description": "<p>Explore IoT about Authentication, Privacy, Communications and Attacks.</p> <p>Learn about securing financial APIs and how the standards are being adapted to support Open Banking.</p> <p><b>Agenda</b>:</p> <p>• 6:30 pm -  Social</p> <p>• 6:55 pm  - OWASP update</p> <p>• 7:00 pm - Presentation 1: IoT - Ramesh Krishnasagar, Cisco</p> <p>• 8:00 pm - Presentation 2: Securing Financial APIs -&gt; moving beyond vanilla OAuth with Dave Tonge, Moneyhub Enterprise </p> <p>• After -  Knights Templar (Wetherspoon's pub) </p> <p><b>Presentation 1:</b> IoT  - discuss :</p> <p>1. <b>Authentication</b>.<br/>What types of device require a specific identity, or are identity attributes sufficient in some cases (e.g. a member of a set or an approximate location)? How are device identities established and attributed or distributed? How can device identities or attributes be authenticated? What are the current approaches, derived from fixed network infrastructure, and their strengths and weaknesses in IoT?<br/>2. <b>Privacy</b>. What is the potential for IoT devices to make more information available about individuals’ movements, behaviour and preferences? How can such information be controlled or restricted? Is there opportunity for ‘adware’ with IoT devices – specific tracking features placed by third parties?Will sensor diversity inevitably allow the linkage of distributed information?</p> <p>3. <b>Communications</b> . What limitations on communication protocols result from the types of device? some contrasting approaches to communication (including ad-hoc networks) and review of their capability, their suitability for different types of device and the feasibility of providing integrity, availability, and confidentiality. Contrast the security solutions with those available for fixed internet network infrastructure.</p> <p>4 <b>Attacks</b>. What is already known about real attacks on, or using, IoT devices?Do these attacks suggest general trends or threats against a wider range of IoT devices? Do these attacks suggest that existing solutions can be applied to IoT, or are there new problems that require new solutions?<br/><b><br/></b></p> <p><b>Bio</b>: Ramesh Krishnasagar is a Cyber Security Consultant at Cisco  with experience in design, development, integration and testing of embedded system software for major clients.</p> <p><b>Presentation 2</b>: \"Securing Financial APIs -&gt; moving beyond vanilla OAuth\".</p> <p><b>Abstract</b>: OAuth 2.0 the least bad option for banking APIs. There is a lot of FUD spread around OAuth 2 and OpenID Connect, in this talk I'll dispel some of the myths, show how the standards are being adapted to support Open Banking and paint a picture of the future that doesn't involve creating a new password for every new service!</p> <p><b>Bio</b>: Dave is the CTO of Moneyhub Enterprise, a member of the Open ID Foundation working on open standards for financial APIs and is the technical representative for the Financial Data and Technology Association. </p> ",
    "end_time": 1498163400,
    "link": "https://www.meetup.com/owasp-bristol/events/235736793/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1498152600,
    "title": "IoT and Securing financial APIs"
}