{
    "cancelled": false,
    "description": "<p>This is a joint event between OWASP Bristol and OWASP London, kindly sponsored and hosted by Just Eat. </p> <p>The meeting will be streamed live from the JustEat London office into the Bristol office. </p> <p>Participants to this meeting will have the opportunity to ask the speakers questions and talk to one of the OWASP co-founders - Jeff W. </p> <p>Doors Open at 6pm for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time).</p> <p><b>Agenda</b>:</p> <p>• Presentation 1: Can DevSecOps Prevent the Impending Software Apocalypse? - Jeff Williams</p> <p>• Presentation 2: Cookie Security - Myths and Misconceptions - David Johansson</p> <p><b>Details</b>: </p> <p><b>Presentation 1</b>: Can DevSecOps Prevent the Impending Software Apocalypse? </p> <p><b>Abstract</b>:  When Marc Andreessen said, “software is eating the world,” he saw business literally reinvented as software. But as software is built faster, becomes more complex and interconnected, and handles more critical functions and data, it’s clear modern software has outstripped our ability to secure it. DevOps has produced stunning results for software speed and quality, but do they translate for security? In this talk, Jeff will present the “Three Ways of Security” – an interpretation of the DevOps classic, “The Phoenix Project” for security. You’ll learn how to get your security work flowing, how to create continuous security feedback, and how to create a culture of security experimentation and learning. Bring your hard questions – Jeff likes a “town hall” style meeting!</p> <p><b>Bio</b>:  Jeff Williams is the co-founder and major contributor to OWASP, where he served as the Chair of the OWASP Board for 8 years and created the OWASP Top 10, OWASP Enterprise Security API (ESAPI), OWASP Application Security Verification Standard(ASVS), XSS Prevention Cheat Sheet, WebGoat and many other widely adopted free and open projects. Jeff is the co-founder and the CTO of Contrast Security. Jeff has a BA from Virginia, an MA from George Mason, and a JD from Georgetown.</p> <p><b>Presentation 2: </b>Cookie Security - Myths and Misconceptions - David Johansson</p> <p><b>Abstract</b>:  Cookies are an integral part of any web application and secure management of cookies is essential to web security. However, during my years as a security consultant I've often encountered various myths and misconceptions regarding cookie security from both developers as well as other security professionals. This talk will dive into the details of cookie security and highlight some of the lesser known facts about well-known cookie attributes.This talk will give you a solid understanding of the pitfalls affecting cookie security, the risks associated with these, and how you can leverage modern security specifications to enhance the protection of cookies in your web application.</p> <p><b>Bio: </b> David Johansson has worked as a security consultant for several leading IT-security companies and has over 10 years of experience in software security. Among other things, he has worked with software development and architecture, web security testing and training developers and testers in security. He has been speaking at conferences such as AppSec USA, InfoSecurity Europe and ISC2 Security Congress EMEA. David lives in London where he works as an Associate Principal Consultant for Synopsys.</p> ",
    "end_time": 1512075600,
    "link": "https://www.meetup.com/OWASP-Bristol/events/244761832/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45161437988281,
        "longitude": -2.5968339443206787,
        "name": "Just-eat.com"
    },
    "org": "OWASP-Bristol",
    "start_time": 1512064800,
    "title": "\"Three Ways of Security” and Cookie Security - Myths and Misconceptions"
}