{
    "cancelled": false,
    "description": "<p>Come to next meetup to learn about password cracking and the security of blockchain.<br/>Discover the common schemes together with the common mistakes made, and learn how to crack passwords of several popular formats. Learn about some of the fundamentals of blockchain security.<br/>Doors Open at 6pm for registration, pizza, drinks and networking. The talks start at 6:30pm.<br/>Agenda:<br/>• 6:00 pm - Social<br/>• 6:30 pm - OWASP update<br/>• 6:35 pm - Presentation 1: Passwords cracking and countermeasure - Jamie Riden, NCCGroup<br/>• 8:00 pm - Presentation 2: The security of Blockchain - Ramesh Krishnasagar, Cisco<br/>• After - Small Bar Pub</p> <p>Presentation 1: Passwords cracking and countermeasure Abstract: \"Although password hashing mechanisms are not directly exposed to the end user, they can still have a great impact on security in the event of a security breach. This talk describes the more common schemes together with the more common mistakes made, and shows how to crack passwords of several popular formats if the hash should be obtained. In particular, we cover hashcat, plus John the Ripper as well as hardware acceleration.\"</p> <p>Bio: \"Jamie Riden has been a developer, a sysadmin, security engineer and is now a penetration tester, doing a mix of infrastructure and web applications. He has interests in phishing and password cracking, and has an Erdős number of 4.\"</p> <p>Presentation 2: The Security of Blockchain Abstract: This presentation will cover the fundamental of<br/>a. Distributed System<br/>b. Ethereum Blockchain<br/>c. Smart contracts<br/>d. DAO/DAC</p> <p>Bio: Ramesh Krishnasagar is a Cyber Security Consultant at Cisco with experience in design, development, integration and testing of embedded system software for major clients.</p> ",
    "end_time": 1518730200,
    "link": "https://www.meetup.com/owasp-bristol/events/245738659/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1518717600,
    "title": "Passwords Cracking and Blockchain Security"
}