{
    "cancelled": false,
    "description": "<p>OWASP Bristol Chapter, In collaboration with OWASP London is pleased to announce a CTF Tournament for Application Developers!</p> <p>CTF (Capture The Flag) is a type of computer security competition. Contestants are presented with a set of challenges and puzzles which test their creativity, technical coding skills, and problem-solving ability. The challenges usually cover a number of categories and when solved, each yields a “flag” which is submitted to a real-time scoring service. The difficulty levels are from beginner to advanced.</p> <p>IMPORTANT: Please bring your own LAPTOP and a charger for it to this event</p> <p>This event is kindly hosted and sponsored by: Just Eat</p> <p>The CTF Platform is kindly provided by Secure Code Warrior (<a href=\"https://securecodewarrior.com/\" class=\"linkified\">https://securecodewarrior.com/</a>)</p> <p>Join Secure Code Warrior's live tournament to prove your web application security knowledge of the OWASP Top 10 or if you simply want to learn more about secure coding.</p> <p>Players will be presented with a series of vulnerable code challenges that will ask them to identify the problem, locate the insecure code, and fix the vulnerability. Select from various software languages to compete the tournament, including: Java EE, Java Spring, C# MVC, C# WebForms, Ruby on Rails, Python Django, Scala Play &amp; Node.JS.</p> <p>Watch as you climb to the top of the leaderboard and be crowned the Secure Code Warrior. Prizes will be provided to the top 3 winners. The prize for the 1st place will be a drone !</p> <p>To pre-register, visit Secure Code Warrior registration page (<a href=\"https://portal.securecodewarrior.com/#/register\" class=\"linkified\">https://portal.securecodewarrior.com/#/register</a>)<br/>Enter the Invitation token:[masked] and fill in your details.<br/>The join code to enter the tournament will be provided on the day.</p> <p>Doors Open: 6pm - registration and networking<br/>CTF kick-off: 6:30pm</p> <p>Refreshments and drinks will be provided by Just Eat.</p> <p>Participation is FREE, but the number of seats is strictly limited and reservation is required to attend.</p> <p>Spread the word within your organisations and get your developers to join!</p> <p>Remember to bring your own laptop!</p> ",
    "end_time": 1547067600,
    "link": "https://www.meetup.com/OWASP-Bristol/events/257594082/",
    "location": {
        "address": "Broad Quay",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4517936706543,
        "longitude": -2.596950054168701,
        "name": "Just Eat"
    },
    "org": "OWASP-Bristol",
    "start_time": 1547056800,
    "title": "Capture The Flag (CTF) Evening"
}