{
    "description": "<p>Agenda:<br/>• 6:00 pm - Social<br/>• 6:30 pm - OWASP update<br/>• 6:35 pm - Presentation 1: An overview of the available solutions for email signing and encryption, Ramona Tame @LMAX Group<br/>• 7:30 pm - Presentation 2: Deep dive into Kerberos authentication, Sadi Zane @BSI group.</p> <p>Presentation 1: An overview of the available solutions for email signing and encryption</p> <p>Abstract: Although emails are used quite often to talk confidential information inside and outside the company, most of the times email security is limited to phishing and spam filters. This talk will be a short overview of the available solutions to accomplish email signing and encryption.</p> <p>Bio: Ramona Tame is a security engineer interested in a whole range of security topics, but focused mostly on the defensive side. Currently working for one of the biggest cryptocurrency Exchange companies on building security defense mechanisms and monitoring against threats and security risks.</p> <p>Presentation 2: Deep dive into Kerberos authentication</p> <p>Abstract: Deep dive into Kerberos authentication, delegations, combining windows NTLM relay, capture encrypted machine account credentials relay to domain controller and remote code execution on domain joined servers. The attack demonstrate stealth post exploitation techniques, issue and reuse the machine accounts TGT tickets and impersonate a higher privilege user e.g. administrator Abusing the S4U2SELF and S4U2Proxy Kerberos delegation concept.</p> <p>Bio: Sadi Zane - Senior Security Consultant @BSI group. OSCP/Infrastructure Check Team Leader - Red Teamer, Penetration Tester. I am passionate about ethical hacking, conduct red team engagements, insider threat simulations attacks helping clients securing their systems from advanced threat actors.</p> ",
    "end_time": 1582839000,
    "link": "https://www.meetup.com/OWASP-Bristol/events/268319030/",
    "location": {
        "address": "Floor 4, Broad Quay House, Broad Quay Bristol  BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45170974731445,
        "longitude": -2.596795082092285,
        "name": "Forgerock"
    },
    "org": "OWASP-Bristol",
    "start_time": 1582826400,
    "title": "Email encryption and Kerberos authentication"
}