{
    "cancelled": false,
    "description": "<p>Joint event with OWASP Dorset (<a href=\"https://www.meetup.com/OWASP-Dorset-Chapter/\" class=\"linkified\">https://www.meetup.com/OWASP-Dorset-Chapter/</a>) , OWASP Suffolk (<a href=\"https://www.meetup.com/OWASP-Suffolk-Chapter/\" class=\"linkified\">https://www.meetup.com/OWASP-Suffolk-Chapter/</a>) , and OWASPReading (<a href=\"https://www.meetup.com/OWASP-Reading-Chapter/\" class=\"linkified\">https://www.meetup.com/OWASP-Reading-Chapter/</a>)</p> <p>Agenda:<br/>* OWASP Updates<br/>* Talk: Enforcing Code &amp; Security Standards with Semgrep, with Clint Gibler Head of Security Research for r2c<br/>* Open discussion</p> <p>Talk: Enforcing Code &amp; Security Standards with Semgrep</p> <p>Abstract: In this talk, we’ll present Semgrep (<a href=\"https://semgrep.dev\" class=\"linkified\">https://semgrep.dev</a>), an open source, lightweight static analysis tool. It's like a code-aware grep, enabling you to easily search for complicated code patterns without writing painful abstract syntax tree (AST) visitors or using heavyweight, expensive, proprietary traditional SAST tools.</p> <p>Key Semgrep features:<br/>- Fast - scans code in minutes, not hours or days.<br/>- Does not require the source code you’re scanning to be buildable.<br/>- Comes out of the box with over 1,000 open source rules covering the OWASP Top 10 and more.<br/>- Supports languages including Python, Java, Golang, JavaScript, TypeScript, Ruby, and more on the way.<br/>- Autofix - Don't just point out bugs, help developers fix them!<br/>- Most importantly, Semgrep makes it easy to write custom rules, no fancy DSL required. This empowers AppSec engineers and developers to detect and block company-specific security bugs and anti-patterns as well as enforce best practices.</p> <p>We’ll demo how to easily write custom Semgrep rules tailored to your specific code base, and how to get continuous security coverage in CI in a just a few minutes.</p> <p>Bio: Clint Gibler (@clintgibler) is the Head of Security Research for r2c, a startup working on giving security tools directly to developers. Previously, Clint was a Research Director at NCC Group, a global security consulting firm, where he helped companies implement security automation and DevSecOps best practices as well as performed penetration tests for companies ranging from large enterprises to new startups. Clint has previously spoken at conferences including BlackHat USA, AppSec USA/EU/Cali, BSidesSF, and many DevSecCons. Clint holds a Ph.D. in Computer Science from the University of California, Davis. Want to keep up with security research? Check out *tl;dr sec*, Clint’s newsletter that contains summaries of artisanally curated, top talks and useful security links and resources from around the web. <a href=\"https://tldrsec.com/\" class=\"linkified\">https://tldrsec.com/</a></p> <p>Zoom Details:<br/><a href=\"https://zoom.us/j/99991967393?pwd=Wm9rcmhCTVQzT0dDZGcvQXZhV3RTdz09\" class=\"linkified\">https://zoom.us/j/99991967393?pwd=Wm9rcmhCTVQzT0dDZGcvQXZhV3RTdz09</a><br/>Meeting ID:[masked]<br/>Passcode:[masked]<br/>Find your local number: <a href=\"https://zoom.us/u/aQJMDth3P\" class=\"linkified\">https://zoom.us/u/aQJMDth3P</a></p> ",
    "end_time": 1624561200,
    "link": "https://www.meetup.com/OWASP-Bristol/events/277163169/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1624554000,
    "title": "Enforcing Code & Security Standards with Semgrep"
}