{
    "cancelled": false,
    "description": "<p>\\-\\-\\-\\- see YouTube details at the bottom \\-\\-\\-\\-\\-\\-</p> <p>Agenda:</p> <p>* OWASP Updates<br/>* Talk: What is eBPF and why should you care? with Kev Sheldrake<br/>* Open discussion</p> <p>Title: What is eBPF and why should you care?<br/>Abstract: eBPF is relatively new and “a revolutionary technology with origins in the Linux kernel that can run sandboxed programs in an operating system kernel.” You can achieve similar results to writing a kernel module, but in a (supposedly – we’ll come to that) safe manner. eBPF code runs in a virtual machine and, depending on the program type, can access all sorts of kernel internals, with programs being launched when specified code points get hit.</p> <p>I will talk about the basics and how to get up and running, the challenges and pitfalls to overcome, a library I wrote when working at Sysinternals to take away some of the pain, the Sysmon For Linux tool I wrote for Sysinternals that logs events to Syslog, and Cilium/Tetragon (and Cilium/ebpf library) that makes accessing eBPF for system observability easier. I will discuss technical details and explain the different use cases that might benefit you, from blue team using Sysmon and Cilium/Tetragon to achieve super powerful abilities, to researchers building custom program tracers, to red team exploiting kernel vulns, to sysadmins seeking performance issues.</p> <p>It is a truly exciting thing that everyone is talking about.</p> <p>Bio: Kev Sheldrake is a security software engineer and researcher who started working in the technical security field in 1997. Over the years, Kev has been a developer and systems administrator of ‘secure’ systems, an infosec policy consultant, a penetration tester, a reverse engineer and an entrepreneur who founded and ran his own security consulting company. He currently works at Isovalent on the open source and enterprise versions of the system observability tool Tetragon, and in the past he specialised in IoT, crypto, and tool development for a number of years.<br/>Twitter: [@kevsecurity](<a href=\"https://twitter.com/kevsecurity\" class=\"linkified\">https://twitter.com/kevsecurity</a>)</p> <p>The meeting will be streamed viaYouTube at:</p> <p>[<a href=\"https://youtu.be/zlfXLdfe47I](https://youtu.be/zlfXLdfe47I\" class=\"embedded\">https://youtu.be/zlfXLdfe47I](https://youtu.be/zlfXLdfe47I</a>)</p> ",
    "end_time": 1666292400,
    "link": "https://www.meetup.com/owasp-bristol/events/285365525/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1666285200,
    "title": " What is eBPF and why should you care?"
}