{
    "cancelled": false,
    "description": "<p>The Talk:<br/>The log4j incident shocked the world back in December - but by implementing the proper protocols and tools early-on organizations can be better prepared moving forward. Logs, metrics and security, can be your secret weapon when it comes to the observability of your applications and software. But are you using all of your data sources to their full potential?<br/>We’ll go over what organizations should keep in mind before, during, and post-security vulnerabilities (based on the log4j incident) when it comes to their monitoring tools and how powerful insights can be pulled to avoid delayed crisis management.<br/>Goals:<br/>1\\. Dive into logs\\, metrics\\, and security<br/>a. What they can be used for, aka what information can be pulled &amp; what insights can be gathered<br/>i. Regarding security specifically - tailor-made security alerting rules for organizations<br/>c. What are the benefits<br/>2\\. Discuss the log4j incident<br/>a. What it was, why it happened, timeline, etc<br/>b. What were the implications/What was the impact<br/>c. How it was resolved<br/>d. What went well<br/>e. What didn’t go well<br/>3\\. Post log4j<br/>a. How can organizations better protect themselves<br/>4\\. Introduce Every log is a security log<br/>5\\. Conclusion: There’s a growing list of companies suffering from security breaches \\- don’t be one of them\\. Get ahead of the game and protect yourself now and in the future\\.<br/>About the speakers:<br/>Ariel Assaraf - Co-founder and CEO at Coralogix<br/>Ariel is a veteran of the Israeli intelligence elite unit 8200. He has over 10 years of Product and team management experience and was the former product manager at the IDF and QA &amp; Integration GL at Verint.<br/>Yuval Khalifa - Chief Security Architect at Coralogix<br/>A former enterprise security expert at Sygnia, Cyber solutions architect at the IAI, and a CTO at the largest insurance agency in Israel. Yuval has vast experience in Cybersecurity secure coding, network architecture, and AI/ML.<br/>Agenda:</p> <p>* Welcome and OWASP updates<br/>* Talk: Log4J - Past, Present, and Future<br/>* Q&amp;A</p> ",
    "end_time": 1652817600,
    "link": "https://www.meetup.com/OWASP-Bristol/events/285694688/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "OWASP-Bristol",
    "start_time": 1652810400,
    "title": "Log4J - Past, Present, and Future"
}