{
    "cancelled": false,
    "description": "<p>**Registration is closing September 9th at 12:00pm EST.**</p> <p>You must register through EventBrite [here](<a href=\"https://www.eventbrite.com/e/owasp-2022-end-of-summer-virtual-training-tickets-376362348917?utm_source=owasp-web&amp;amp;amp;utm_medium=event-page&amp;amp;amp;utm_campaign=none\" class=\"linkified\">https://www.eventbrite.com/e/owasp-2022-end-of-summer-virtual-training-tickets-376362348917?utm_source=owasp-web&amp;amp;amp;utm_medium=event-page&amp;amp;amp;utm_campaign=none</a>) to participate in this training course. Zoom links will be sent to individuals after they register for the course</p> <p>2-day (September 13 and 14) training course / 9:00am - 5:00pm BST<br/>Trainer: Sebastien (Seba) Deleersnyder</p> <p>In this edition we enhanced the section on privacy by design, compliance, and added a section on threat modeling medical devices. All participants get our Threat Modeling Playbook plus one-year access to our online threat modeling learning platform. As part of this training, you will be asked to create your own threat model, on which you will get individual feedback. One month after the training we organize an online review session with all the participants.</p> <p>As highly skilled professionals with years of experience under our belts, we’re intimately familiar with the gap between academic knowledge of threat modeling and real-world practice. To minimize that gap, we have developed practical use cases, based on real-life projects. Each use case includes a description of the environment, together with questions and templates to build a threat model.</p> <p>Using this methodology for the hands-on workshops we provide our students with a challenging training experience and the templates to incorporate threat modeling best practices in their daily work. Students will be challenged in groups of 3 to 4 people to perform the different stages of threat modeling on the following:</p> <p>• Diagramming web and mobile applications, sharing the same REST backend<br/>• Threat modeling an IoT gateway with a cloud-based update service<br/>• Get into the defender's head - modeling points of attack against a nuclear facility<br/>• Threat mitigations of OAuth scenarios for an HR application<br/>• Privacy analysis of a new face recognition system in an airport<br/>After each hands-on workshop, the results are discussed, and students receive a documented solution. Based on our successful trainings in the last years and the great and positive feedback, we release this updated advanced threat modeling training at AppSecEU Virtual 2022.</p> <p>Audience Level: Beginner<br/>**REGISTER NOW: <a href=\"https://www.eventbrite.com/e/owasp-2022-end-of-summer-virtual-training-tickets-376362348917?utm_source=owasp-web&amp;utm_medium=event-page&amp;utm_campaign=none\" class=\"linkified\">https://www.eventbrite.com/e/owasp-2022-end-of-summer-virtual-training-tickets-376362348917?utm_source=owasp-web&amp;utm_medium=event-page&amp;utm_campaign=none</a>**</p> ",
    "end_time": 1663171200,
    "link": "https://www.meetup.com/owasp-bristol/events/288355227/",
    "location": null,
    "org": "OWASP-Bristol",
    "start_time": 1663056000,
    "title": "OWASP Advanced Whiteboard Hacking - AKA Hands on Threat Modeling"
}