{
    "cancelled": false,
    "description": "<p>In-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.</p> <p>**Agenda:**</p> <p>* OWASP Updates<br/>* Talk 1: Browser extension security, with Billy Sheppard from Immersive Labs<br/>* Break<br/>* Talk 2: Intro to Scripting for Web Application Testers with Alex Archondakis<br/>* Networking</p> <p>**Venue:**<br/>Photo shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard).</p> <p>Address: 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ</p> <p>\\-\\-\\-</p> <p>Talk 1: **A look into browser extension security**, the risks involved with allowing users to install browser extensions and browser security/attack vectors, presented by **Billy Sheppard**.</p> <p>**Abstract**: As web technologies are becoming more and more popular, you need to be more careful about what you put in your browsers. While extensions can be very useful, they come with hidden dangers – users often prioritise functionality over safety. In this talk, you'll uncover the real risks of using extensions, explore common attacks, and learn about pitfalls. You'll also take a look at some real-life security incidents and what went wrong. You'll leave with a deeper understanding of the need for browser extension security and how to safeguard your browser.</p> <p>**Bio:** Billy Sheppard is a Bristol-based Senior Application Security Engineer working at Immersive Labs where he creates Secure Code content and challenges for their product.</p> <p>In his career thus far, he has earned several achievements including VDP submissions for Fortune 500 companies, Bug bounties, and created and released his own niche CTF/Hacking challenge specifically aimed at increasing security awareness for ServiceNow developers. He has also created a Web Security YouTube Channel to demonstrate security concepts and educate developers and reported multiple real security issues to VDPs/Bug Bounty Programs for large companies such as BBC, RedHat and Accenture. He is a keen learner and spends a lot of his personal time continuously learning and is passionate about education around secure code.</p> <p>\\-\\-\\-</p> <p>Talk 2: **An Introduction to scripting for Application Testers,** presented by **Alex Archondakis**.</p> <p>**Abstract**: Scripting, or the ability to write code that allows you to perform actions or automate repetitive tasks is a crucial tool in any application security testers belt, however, it doesn’t seem to be a common one.</p> <p>The purpose of this talk is to introduce scripting to application security testers, this will be achieved by looking at case studies to determine where scripting may be appropriate and how to solve the problem. We will discuss multiple languages and their advantages whilst focussing on interacting with the HTTP protocol.</p> <p>The key learning points from this talk are as follows:</p> <p>* To gain an understanding of the importance of scripting for application security testers<br/>* What programming languages are used, and their advantages/disadvantages.<br/>* Typical scenarios where scripting is required because tooling is not comprehensive enough</p> <p>**Bio**: Alex is head of professional services &amp; a senior consultant at Pentest People. He has a wealth of experience in penetration testing, people management and training hackers. He believes that all application security professionals should be able to write basic scripts to solve common problems.</p> ",
    "end_time": 1686861000,
    "link": "https://www.meetup.com/owasp-bristol/events/290892060/",
    "location": {
        "address": "All Saints' Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.456138610839844,
        "longitude": -2.5929958820343018,
        "name": "Immersive Labs"
    },
    "org": "OWASP-Bristol",
    "start_time": 1686850200,
    "title": "Browser Extension Security, and Scripting for Web Application Testers"
}