{
    "cancelled": false,
    "description": "<p>In-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.</p> <p>To find the entrance, it might be easier to search for \"Programme, Bristol, BS1 2NB\", or use this link to [Google Maps](<a href=\"https://www.google.com/maps/?q=51.455666,-2.592341\" class=\"linkified\">https://www.google.com/maps/?q=51.455666,-2.592341</a>).</p> <p>**Agenda:**</p> <p>* OWASP Updates.<br/>* Talk 1: LLM and Application Security, with Chris Wood from Immersive Labs.<br/>* Break.<br/>* Talk 2: Intro to Scripting for Web Application Testers with Alex Archondakis.<br/>* Networking.</p> <p>**Venue:**<br/>Photo shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard).</p> <p>Address: 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.</p> <p>\\-\\-\\-</p> <p>Talk 1: **LLM and Application Security**, presented by **Chris Wood**.</p> <p>**Abstract**: A look at LLMs and how they affect the security of code and how humans are still needed in the loop.</p> <p>**Bio:** Chris is Principal AppSec Engineer at Immersive Labs leading on the development of our Secure Coding product. He is also a founder of BSides Cheltenham.</p> <p>\\-\\-\\-</p> <p>Talk 2: **An Introduction to scripting for Application Testers,** presented by **Alex Archondakis**.</p> <p>**Abstract**: Scripting, or the ability to write code that allows you to perform actions or automate repetitive tasks is a crucial tool in any application security testers belt, however, it doesn’t seem to be a common one.</p> <p>The purpose of this talk is to introduce scripting to application security testers, this will be achieved by looking at case studies to determine where scripting may be appropriate and how to solve the problem. We will discuss multiple languages and their advantages whilst focussing on interacting with the HTTP protocol.</p> <p>The key learning points from this talk are as follows:</p> <p>* To gain an understanding of the importance of scripting for application security testers.<br/>* What programming languages are used, and their advantages/disadvantages.<br/>* Typical scenarios where scripting is required because tooling is not comprehensive enough.</p> <p>**Bio**: Alex is head of professional services &amp; a senior consultant at Pentest People. He has a wealth of experience in penetration testing, people management and training hackers. He believes that all application security professionals should be able to write basic scripts to solve common problems.</p> ",
    "end_time": 1686861000,
    "link": "https://www.meetup.com/owasp-bristol/events/290892060/",
    "location": {
        "address": "All Saints' Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.455665588378906,
        "longitude": -2.5923409461975098,
        "name": "Immersive Labs"
    },
    "org": "OWASP-Bristol",
    "start_time": 1686850200,
    "title": "Scripting for Web Application Testers, and LLM/Application Security"
}