{
    "cancelled": false,
    "description": "<p>Wow! It's going to be a fun-packed evening of Elastic as we now have THREE great speakers confirmed!</p> <p>- Improving search at the Wellcome Collection - Jonathan Tweed (Wellcome Collection)<br/>- Creating, indexing and hosting 250 billion genetic associations with Elastic - Benjamin Elsworth (University of Bristol)<br/>- Entity oriented search - better tagging of people, places and organisations found in your documents - Mark Harwood (Elastic)</p> <p>As usual, the venue and drinks will be provided by Cookpad and great food will be sponsored by Elastic. Thanks to our sponsors!</p> <p>Doors, drinks and food are from 6:30pm and talks will start promptly at 7pm. You'll also have a (brief) chance to make community announcements if you have anything Elastic related to share (including hiring).</p> <p>So here are the details of our amazing lineup!</p> <p>* Jonathan Tweed - Improving search at the Wellcome Collection</p> <p>As an encore to his appearance at November's Elastic{On} Tour London, Jonathan will share how the Wellcome Collection (a free museum and library that aims to challenge how we all think and feel about health) are improving access to their collections using the Elasticsearch Service. Find out how the SaaS service forms part of a new discovery platform to aggregate descriptive data and provide unified search, ultimately empowering researchers to make new discoveries that add meaning to our understanding of life, death, and everything in between.</p> <p>As their Technical Product Lead, Jonathan is responsible for Data and Digital Preservation at the Wellcome Collection; no mean feat given the size and diversity of the Collection! His work includes leading on improved approaches to digitisation workflow, digital preservation &amp; access, data transformation, machine learning, user identity and search, of course!</p> <p>* Benjamin Elsworth - Creating, indexing and hosting 250 billion genetic associations with Elastic</p> <p>In contrast to Jonathan's work with historical health, Ben works as a Research Fellow at the University of Bristol, focusing on deriving mechanistic insight from multivariate biomedical data sets. He has developed the infrastructure for one of the world’s largest collections of genetic association data - the IEU GWAS Database (<a href=\"https://gwas.mrcieu.ac.uk/\" class=\"linkified\">https://gwas.mrcieu.ac.uk/</a>). This platform is used globally to tackle various key health problems, from predicting causal relationships between risk factors and disease to identifying potential drug repurposing events. Learn first hand about some of the challenges and approaches to working with ElasticSearch data at this kind of scale.</p> <p>* Mark Harwood - Entity oriented search</p> <p>Mark is a core developer at Elastic and has been involved with Lucene for many years. He will demonstrate various approaches to modelling real-world entities more effectively, including using the new annotated_text field type. Topics include adaptive technologies that use \"id chaining\" and NER (Named Entity Recognition) tools like OpenNLP and Spacy which can be used to tag people, places and organisations mentioned in text.</p> <p>Finally, if you've something to share, we're always looking for speakers. Remember, not all talks require you to be the world's leading expert on your topic. Learning curve stories are also REALLY helpful to our community. We're very supportive of first time speakers too. Go on! You know you want to! Just get in touch with one of the organisers via Meetup or speak to us at the event.</p> ",
    "end_time": 1579208400,
    "link": "https://www.meetup.com/south-west-elastic-fantastics/events/265525501/",
    "location": null,
    "org": "elastic",
    "start_time": 1579199400,
    "title": "Elastic January - It's a Triple-Bill!!!"
}