{
    "cancelled": false,
    "description": "<p>THIS IS A FREE EVENT - PLEASE FINISH YOUR RSVP IN THE LINK BELOW</p> <p><a href=\"https://community.elastic.co/events/details/elastic-london-presents-virtual-uk-wide-meetup-monitoring-live-debugging-with-the-elastic-stack/\" class=\"linkified\">https://community.elastic.co/events/details/elastic-london-presents-virtual-uk-wide-meetup-monitoring-live-debugging-with-the-elastic-stack/</a></p> <p>Join Emanuil Tolev (Elastic) and other Elasticians from across the UK for tea to talk about web application monitoring!</p> <p>Your app is down. Your users start ranting on Twitter. Your boss is standing right behind you. How do you keep calm and carry on?</p> <p>This talk walks you through a live debugging session without panicking:</p> <p>* Where does your monitoring point you?</p> <p>* Can you get more details from your application's traces?</p> <p>* Is there anything helpful in the logs?</p> <p>* What the heck is even deployed?</p> <p>We are using the Elastic Stack in this demo, going through its ability to hold logs, metrics and traces / App Perf Monitoring data. There will be a special focus on its Kubernetes integration with metadata enrichment and autodiscovery, but the methods are applicable to any app, no matter how it's deployed.</p> <p>Join for this talk and an informal chat about web application monitoring afterwards at <a href=\"https://elastic.zoom.us/j/9876543999\" class=\"linkified\">https://elastic.zoom.us/j/9876543999</a> .</p> <p>Emanuil Tolev - Elastic (Community Advocate)</p> <p>Emanuil is a Community Engineer with Elastic. He used to be a freelance web developer and ran a small open science web dev consultancy with partners for several years. Interested in mentorship, inclusion, small businesses, archery and always curious about how the world works in detail.</p> ",
    "end_time": 1593021600,
    "link": "https://www.meetup.com/South-West-Elastic-Fantastics/events/271471940/",
    "location": null,
    "org": "elastic",
    "start_time": 1593018000,
    "title": "Monitoring: Live debugging with the Elastic Stack [Virtual UK-wide meetup]"
}