{
    "cancelled": false,
    "description": "<p>IT'S TIME FOR DEVPARTY 2020 - UK &amp; IRELAND!</p> <p>(GDG Bristol isn't hosting this event but we're pleased to promote it on behalf of GDG UK &amp; Ireland. You must register at <a href=\"https://dev-party.io\" class=\"linkified\">https://dev-party.io</a> if you wish to attend, but please also RSVP here so we know how many Bristolian GDGers we're sending!)</p> <p>GDG (Google Developer Group) UK and Ireland are very excited to invite you to DevParty, an online event which offers interactive talks and workshops from experts in a range of fields, and provides a great chance to connect with other developers from all across the UK and Ireland!</p> <p>There will be 3 talk sessions per track. The 4 tracks are - mobile, cloud technologies, interactive webinars on machine learning, as well as fascinating discussions on ethics and diversity in the world of software development all running alongside each other to ensure you have plenty of content to get involved with.</p> <p>IT'S NOT ALL ABOUT THE TECH, OF COURSE!</p> <p>But, of course, it’s not all about the tech! Following the interactive sessions we will get together for an online party, where you can chat, network and maybe have a drink or two; this is a rare opportunity to get to know fellow developers from all over, whether local or on the other side of the country.</p> <p>So (virtually) come on down and get involved on Saturday 16th May - we look forward to seeing you!</p> <p>Register for this online event and let’s get the DevParty started! Go to <a href=\"https://dev-party.io\" class=\"linkified\">https://dev-party.io</a> for more details and to register!</p> <p>DON'T FORGET TO CONNECT WITH US ON SOCIAL MEDIA, SO YOU DON'T MISS ANY UPDATES!</p> <p>Find us on &gt;&gt;<br/>Twitter - <a href=\"https://twitter.com/devparty_\" class=\"linkified\">https://twitter.com/devparty_</a><br/>Instagram - <a href=\"https://instagram.com/devparty_\" class=\"linkified\">https://instagram.com/devparty_</a><br/>Facebook - <a href=\"https://facebook.com/devpartyukireland\" class=\"linkified\">https://facebook.com/devpartyukireland</a><br/>YouTube - <a href=\"https://www.youtube.com/channel/UCuAj2rWo6S8Vbovya0eX6oA\" class=\"embedded\">https://www.youtube.com/channel/UCuAj2rWo6S8Vbovya0eX6oA</a></p> ",
    "end_time": 1589652900,
    "link": "https://www.meetup.com/GDG-Bristol/events/270568185/",
    "location": null,
    "org": "gdg-bristol",
    "start_time": 1589643000,
    "title": "DevParty - UK & Ireland"
}