{
    "cancelled": false,
    "description": "<p>For December, we thought we would get together as a group to talk about Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy by Cathy O’Neil. It's a really important book and well written. If you don't already have the book, it should be easy to get hold of (you can find second-hand copies on abebooks.co.uk for about £3.00, or for free from the library).</p> <p>About the book: \"We live in the age of the algorithm. Increasingly, the decisions that affect our lives—where we go to school, whether we get a car loan, how much we pay for health insurance—are being made not by humans, but by mathematical models. In theory, this should lead to greater fairness: Everyone is judged according to the same rules, and bias is eliminated. But in fact the models being used today are opaque, unregulated, and uncontestable, even when they’re wrong. And they reinforce discrimination. Models are propping up the lucky and punishing the downtrodden, creating a “toxic cocktail for democracy.” Welcome to the dark side of Big Data. Former Wall Street quant O’Neil exposes the black box models that shape our future, both as individuals and as a society, and calls on modelers to take more responsibility for their algorithms and on policy makers to regulate their use. \"</p> <p>Cathy O'Neil TED Talk: <a href=\"https://www.youtube.com/watch?v=_2u_eHHzRto\" class=\"embedded\">https://www.youtube.com/watch?v=_2u_eHHzRto</a></p> <p>The Guardian interview with Cathy O'Neil: <a href=\"https://www.theguardian.com/books/2016/oct/27/cathy-oneil-weapons-of-math-destruction-algorithms-big-data\" class=\"linkified\">https://www.theguardian.com/books/2016/oct/27/cathy-oneil-weapons-of-math-destruction-algorithms-big-data</a></p> <p>Scientific American review: <a href=\"https://blogs.scientificamerican.com/roots-of-unity/review-weapons-of-math-destruction/\" class=\"linkified\">https://blogs.scientificamerican.com/roots-of-unity/review-weapons-of-math-destruction/</a></p> <p>Don't worry if you don't get the chance to read the whole book but if you can do read the Introduction (7 pages).</p> <p>We'll be meeting in the Snug area of The Boardroom where we can have drinks and talk about the book, and anything else we feel like!</p> ",
    "end_time": 1576096200,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/266488412/",
    "location": {
        "address": "20 Saint Nicholas Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4538688659668,
        "longitude": -2.593648910522461,
        "name": "The Boardroom"
    },
    "org": "anthropology-technology",
    "start_time": 1576087200,
    "title": "Book discussion: Weapons of Math Destruction"
}