{
    "cancelled": true,
    "description": "<p>Why is there so much snake oil in Conversational AI? How do we create digital assistants that don't encode gender biases and reinforce stereotypes? Does a chatbot’s gender have an effect on the users overall satisfaction?</p> <p>This month we have three amazing speakers - Phil D. Hall, Coral Manton, and Kerry Harrison - to explore, unpack, and discuss these important questions.</p> <p>*** Please note there is a small charge of £3 to cover the room hire costs.</p> <p>***COVID19: We are monitoring the situation closely. Please do not attend if you are ill, have a temperature, or have been in contact with anyone who been overseas recently. If we cancel this event, it will be rescheduled and your payment will be transferred across. Thank you for your understanding.</p> <p>TALK DESCRIPTIONS</p> <p>*Why is there so much snake oil in Conversational AI?*<br/>Phil will unpack a problem that we have in our digital world right now, which can be summed up as: Why is so much snake oil in Conversational A.I.? Phil will take a run at what the relevant snakes are from an AnthTech perspective.</p> <p>*Women Reclaiming AI*<br/>Coral Manton will be presenting Women Reclaiming AI (WRAI). WRAI is a collaborative AI voice assistant and activist artwork made by a growing community of 100+ women (cis &amp; trans). Co-founded by artist technologists Coral Manton and Birgitte Aga, the project creates a platform for collective writing and editing, developing an AI that challenges gender roles.</p> <p>*Writing for machines*<br/>Today, an increasing number of organisations are using voice assistants, chatbots and automated services to help grow their business. In fact, this kind of technology is now informing, educating, supporting – and even advising us. As a result, addressing bias in these systems is vital.<br/>In her presentation, Kerry Harrison, co-founder of creative tech company Tiny Giant, will discuss gender bias in chatbots. Does the chatbot’s gender have an effect on the users overall satisfaction? Would a mechanic chatbot called Mark be rated differently than one called Marie? And if so, what should we do about it?</p> <p>AGENDA</p> <p>18:00 Arrive, grab a drink and a seat<br/>18:30 Talks<br/>19:15 Q&amp;A with Coral, Kerry, and Phil<br/>20:00 Networking<br/>20:30 Finish</p> <p>SPEAKER BIOS</p> <p>// Phil D Hall //</p> <p>Phil D Hall has been building conversational A.I. since 1982 and with the conceptual, practical and pragmatic training received from an Anthropology degree at UCL in the late 1990’s he has, let’s say, an unusual view of Artificial Intelligence and the impact that it has on us socially, economically and culturally.</p> <p>// Coral Manton //</p> <p>The work of artist-technologist duo Birgitte Aga and Coral Manton manifests as collaborative workshops, events and installations aimed at (re)claiming conversational artificial intelligence (AI) systems as a medium for protest. It critiques the commercial pursuit of humanising AI technologies and challenges the bias, stereotyping and pervasive influence embedded within. By activating the public, Aga and Manton re-write and re-imagine the cultural myths of AI and robotics, creating futures mediated by alternative technology.</p> <p>// Kerry Harrison, Co-Founder of Tiny Giant //</p> <p>Kerry is an award-winning advertising creative who specialises in using artificial intelligence to augment the creative process and inspire new ways to tackle marketing problems.</p> <p>In 2018, after 18 years as an advertising copywriter and creative head, she co-founded Tiny Giant to help pioneering businesses harness the power of creative AI. She’s the host of martech podcast Tiny Giant Jams, a university guest lecturer, and the co-organiser of I’ll Be Back South West – the monthly meet-up exploring the intersection between A.I, creativity and advertising.</p> <p>Over the last year, Kerry and the Tiny Giant team have worked with brands including BMW, Deloitte, Nestle, Ralph Lauren and Bacardi. In 2019, they also won a prestigious DMA Gold award in the Best use of AI category for their work with the Cheltenham Science Festival.</p> ",
    "end_time": 1584390600,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/268234545/",
    "location": {
        "address": "17-18 King Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451751708984375,
        "longitude": -2.5945849418640137,
        "name": "The Famous Royal Navy Volunteer"
    },
    "org": "anthropology-technology",
    "start_time": 1584381600,
    "title": "Snake oil and sexism: how do we fix conversational AI?"
}