{
    "description": "<p>The Anthropology + Technology Meetup group is delighted to be hosting the Women Reclaiming AI (WRAI) collective for a special, free event.</p> <p>** Please note this event is for self-identifying women (trans, cis and nonbinary) only.</p> <p>The Women Reclaiming AI collective invite you to take part in designing an alternative AI Voice Assistant created by a growing community of women.</p> <p>// About WRAI //</p> <p>Woman Reclaiming AI (WRAI) is an expanding activist art-work, presented as a feminist AI voice assistant, programmed through participatory workshops by a growing community of self-identifying women (trans, cis and nonbinary). Through creating a platform for collective writing and editing the project co-creates an AI that challenges gender roles. The project is a response to the pervasive depiction of AI voice assistants gendered as women, subordinate and serving, designed by development teams which lack diversity.</p> <p>WRAI aims to reclaim female voices in the development of future AI systems by empowering women to harness conversational AI as a medium for protest. This project is created by artists-technologists Coral Manton and Birgitte Aga in collaboration with an ever evolving community of self-identifying women.</p> <p><a href=\"https://womenreclaimingai.com\" class=\"linkified\">https://womenreclaimingai.com</a></p> <p>// About the workshop //</p> <p>This workshop aims to create an AI personality that better reflects female identity, using a corpus of inspirational speeches from people taking part and other women admired by the WRAI collective. It will provide participants with basic skills to create an AI voice assistant or chatbot in a development platform for conversational systems and a space to facilitate talking, sharing and listening.</p> <p>No previous experience of coding is required but participants are asked to bring a laptop if they have access to one. The workshop is free but places are limited.</p> <p>The room hire for this workshop is kindly sponsored by Mundy &amp; Anson (<a href=\"https://www.mundyandanson.co.uk/\" class=\"linkified\">https://www.mundyandanson.co.uk/</a>), who are the founders and organisers of the Anthropology + Technology conference (<a href=\"https://www.anthtechconf.co.uk/\" class=\"linkified\">https://www.anthtechconf.co.uk/</a>).</p> <p>// Agenda //</p> <p>18:00 - 18:30 - Arrive, grab a drink and a seat<br/>18:30 - 20:30 - Women Reclaiming AI Workshop</p> <p>// What to bring //</p> <p>No previous experience of coding is required but participants are asked to bring a laptop if they have access to one. The workshop is free but places are limited.</p> ",
    "end_time": 1585596600,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/268948502/",
    "location": {
        "address": "17-18 King Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451751708984375,
        "longitude": -2.5945849418640137,
        "name": "The Famous Royal Navy Volunteer"
    },
    "org": "anthropology-technology",
    "start_time": 1585589400,
    "title": "Women Reclaiming AI: Workshop "
}