{
    "cancelled": false,
    "description": "<p>This month we are looking at autonomous vehicles from an anthropological and a technological perspective. Xinyi is an anthropologist who is doing her PhD on automonous vehicles. Gabi and Zassa are two technologists who work at Five AI. FiveAI is a UK startup, developing the software to power shared, self-driving vehicle services in Europe. They are developing driverless car technology with a strategy to build a fleet of shared vehicles.</p> <p>** Please note there is a small charge to cover both the Zoom costs and the Meetup charges. Despite the pandemic, Meetup hasn't reduced its annual fee. We may consider using a different platform. Thanks for your understanding.</p> <p>AGENDA</p> <p>18:00 - Welcome and introductions<br/>18:05 - 18:15 - Xinyi Wu - An anthropological perspective of autonomous vehicles<br/>18:15 - 18: 30 - Gabi Bernotaite and Zassa Kavuma, Five AI<br/>18:30 - 19:00 - Q&amp;A</p> <p>// TALK DESCRIPTIONS //</p> <p>THE ANTHROPOLOGIST<br/>As an anthropologist, Xinyi believes the key to the success of connected autonomous vehicles' (CAV) large-scale deployment in society is not just about the technology itself, but about the interdependency of technological feasibility, economic viability, political support, ideological opportunisms, and multi-cooperation and revealed the socio-political complexity behind a technological invention. However, in-depth qualitative research in this field is rare.</p> <p>During her fieldwork, Xinyi worked with different social groups, including policymakers from the governments, industry stakeholders such as FiveAI, technicians and researchers from the universities, and members of the public. Apart from the common concern about CAV’s feasibility, different concerns and expectations associated with accessibility, regulation, trust, ethics, cybersecurity, and human-machine interaction emerged from the dialogues. In this talk, Xinyi will briefly introduce her research questions and methods, present some of the findings that reveal people’s hope and fear, and point out the gaps existing in this field.</p> <p>THE TECHNOLOGISTS</p> <p>[to come]</p> <p>// SPEAKER BIOS //</p> <p>// Gabija Bernotaite //<br/>Gabi is a placement student at Five AI. She is passionate about Machine Learning, robotics and Maths. Gabi is an active community member, hackathons organizer, diversity in Computer Science supporter.<br/>She thinks that giving back to the community is crucial, therefore she also ran a fundraiser and went to Malawi, Africa to set up and teach Computer Science classes. Currently she is studying at the University of Manchester.</p> <p>// Zassa Kavuma //<br/>Zassa is a roboticist with a passion for data analysis. He is also a music enthusiast and a wannabe social scientist.<br/>He has worked in R&amp;D for 6 years, firstly at Dyson testing robotics vacuum cleaners and more recently at Five developing cloud based tools to analyse car fleet data.</p> <p>// Xinyi Wu //<br/>Xinyi is a PhD candidate in Social Anthropology at the University of Edinburgh. Her PhD project focuses on the social impacts and integration of connected autonomous vehicles (CAV) into society. As one of the very few anthropologists in this field, she tries to build a critical view of the socio-political discourses among various social groups by investigating people’s perceptions and negotiations wherein in-depth insights shape the ongoing planning and practice.</p> ",
    "end_time": 1588010400,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/269161299/",
    "location": null,
    "org": "anthropology-technology",
    "start_time": 1588006800,
    "title": "ONLINE: Autonomous vehicles - with FiveAI and Xinyi Wu "
}