{
    "cancelled": false,
    "description": "<p>We're in conversation with Ivana Bartoletti, Technical Director, Privacy, Deloitte and Women Leading in AI Network, Co Founder, about her book, An Artificial Revolution: On Power, Politics and AI. Ivana is also speaking at the 2020 Anthropology + Technology conference on Friday 9 October: <a href=\"https://www.anthtechconf.co.uk/2020speakers\" class=\"linkified\">https://www.anthtechconf.co.uk/2020speakers</a>.</p> <p>AI is not simply a technology. As Ivana shows, it is power, it is political, and it is gendered. While AI has unrivalled potential to transform both our present and our future, it is also related to oppression. But there is a way out and that involves asking searching questions about how we govern the use, research, an deployment of AI. Ivana's book is a short, passionate call to arms to avoid sleepwalking into a future written by algorithms which encode racist, sexist and classist biases into our daily lives. She urges us to get involved in the debates which will shape our collective future.</p> <p>Our interview with Ivana will continue the conversation we had on the Anthropology + Technology Conference blog: <a href=\"https://www.anthtechconf.co.uk/news/an-artificial-revolution\" class=\"linkified\">https://www.anthtechconf.co.uk/news/an-artificial-revolution</a></p> <p>AGENDA<br/>18:30 - Welcome and introduction<br/>18:35 - 19:05 - In conversation with Ivana Bartoletti<br/>19:05 - 19:30 - Q&amp;A</p> <p>ABOUT IVANA BARTOLETTI<br/>Ivana is the Technical Director at Deloitte, and helps businesses harness the data they hold. She works across all sectors, and is passionate about privacy and ethics by design in AI, the IoT and blockchain technology. Ivana was awarded ‘Woman of the Year’ (2019) in the CyberSecurity Awards.</p> <p>Ivana co-founded the Women Leading in AI Network, a lobby group of women from different backgrounds aimed to mobilise the tech industry and politics to set clear governance around AI so that it works for everyone and is constrained by our human values.</p> <p>Ivana is a commentator for the BBC, Sky, the Guardian, and other outlets on headlines stories where the tech economy intersects with privacy and data law and politics. She is the co-editor of Wiley’s AI book on AI in financial services.</p> <p>BUY THE BOOK<br/>You can buy the e-book from Amazon (<a href=\"https://www.amazon.co.uk/Artificial-Revolution-Power-Politics-Indigo-ebook/dp/B0874WLS4L/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=1589458803&amp;sr=8-1\" class=\"linkified\">https://www.amazon.co.uk/Artificial-Revolution-Power-Politics-Indigo-ebook/dp/B0874WLS4L/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=1589458803&amp;sr=8-1</a>) or pre-order the paperback from all good booksellers everywhere.</p> ",
    "end_time": 1592418600,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/270899329/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "anthropology-technology",
    "start_time": 1592415000,
    "title": "Power, Politics and AI: In conversation with Ivana Bartoletti"
}