{
    "cancelled": false,
    "description": "<p>In the age of artificial intelligence comes an important book about the body, The Power of Not Thinking: How Our Bodies Learn and Why We Should Trust Them, by business anthropologist and A+T 2019 keynote Simon Roberts.</p> <p>\"At a time when business is dazzled by the idea of Big Data—and popular culture is rushing to embrace the disembodied world of cyberspace—Roberts offers a brilliantly powerful case for looking at the physical world we inhabit. Lively, provocative and informative, The Power of Not Thinking explains the root meaning of \"embodied\" knowledge in a way that has implications for business executives and policy makers working in any sphere. If you are handling Big Data, or hoping technology can solve your problems, you should read this—and learn the power of anthropology to show how our entire ecosystem works, including our bodies\" — Gillian Tett, anthropologist and Chair Editorial Board, Editor-at-large, US, The Financial Times.</p> <p>Check out Simon's 2019 keynote: <a href=\"https://www.youtube.com/watch?v=Kv4URKq9kbQ\" class=\"embedded\">https://www.youtube.com/watch?v=Kv4URKq9kbQ</a></p> <p>ABOUT SIMON ROBERTS<br/>An anthropologist, Simon considers himself to have the best job in the world: researching the emerging frontiers of people and technology and trying to land that understanding with impact in complex environments. His career began with a PhD on the satellite TV revolution in mid 1990s India. He started the UK’s first dedicated ethnographic research company, Ideas Bazaar, before leading an R&amp;D team at Intel’s Digital Health Group.</p> <p>In 2013, Simon co-founded Stripe Partners, a strategy and innovation consultancy that supports teams working on near-term product launches and longer-range strategy engagements. We help our clients decide what to do now and what to do next.</p> <p>Simon has long been connected with the world of business anthropology. He writes and speaks widely on anthropology, ethnography, and technology, and his work has been covered by Bloomberg, The Financial Times, Wall Street Journal, BBC Radio 4, Quartz and The Daily Telegraph. His book on embodied knowledge, The Power of Not Thinking: How Our Bodies Learn and Why We Should Trust Them, will be published by Bonnier in 2020.</p> <p>AGENDA<br/>18:30 - Welcome and introduction<br/>18:35 - 19:05 - Dawn Walter in conversation with Simon Roberts<br/>19:05 - 19:30 - Q&amp;A and close</p> <p>BUY THE BOOK<br/>Buy the e-book from Amazon (<a href=\"https://www.amazon.co.uk/Power-Not-Thinking-Bodies-Should-ebook/dp/B085DGWZDW/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=1590566935&amp;sr=8-1\" class=\"linkified\">https://www.amazon.co.uk/Power-Not-Thinking-Bodies-Should-ebook/dp/B085DGWZDW/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=1590566935&amp;sr=8-1</a>) or pre-order it through your favourite bookseller.</p> ",
    "end_time": 1594924200,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/270900176/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "anthropology-technology",
    "start_time": 1594920600,
    "title": "AI and the Body: In Conversation with Simon Roberts"
}