{
    "cancelled": false,
    "description": "<p>We're in conversation with Dr Danielle Belgrave, who is a machine learning researcher in the Healthcare Intelligence group at Microsoft Research, about human-centred ML for healthcare.</p> <p>We’ll be talking to Danielle about how she got into this space, what advice she has for womxn wanting to follow in her footsteps, what her work involves, and why she thinks human-centred ML is so important.</p> <p>AGENDA<br/>18:30 - Welcome and introduction<br/>18:35 - 19:05 - In conversation with Danielle Belgrave<br/>19:05 - 19:30 - Q&amp;A</p> <p>ABOUT DANIELLE BELGRAVE<br/>Dr Danielle Belgrave is a machine learning researcher in the Healthcare Intelligence group at Microsoft Research, in Cambridge (UK) where she leads Project Talia which explores how a human-centric approach to machine learning can meaningfully assist in the detection, diagnosis, monitoring, and treatment of mental health conditions.</p> <p>Her research focuses on integrating medical domain knowledge, probabilistic graphical modelling and causal modelling frameworks to help develop personalized treatment and intervention strategies for healthcare.</p> <p>She obtained a BSc in Mathematics and Statistics from London School of Economics, an MSc in Statistics from University College London and a PhD in the area of machine learning in health applications from the University of Manchester.</p> <p>Prior to joining Microsoft, she was a tenured Research Fellow at Imperial College London.</p> <p>Danielle's Microsoft Research profile: <a href=\"https://www.microsoft.com/en-us/research/people/dabelgra/\" class=\"linkified\">https://www.microsoft.com/en-us/research/people/dabelgra/</a></p> <p>The Healthcare Intelligence group at Microsoft Research: <a href=\"https://www.microsoft.com/en-us/research/theme/healthcare-intelligence/\" class=\"linkified\">https://www.microsoft.com/en-us/research/theme/healthcare-intelligence/</a></p> <p>Project Talia - AI for Improved Mental Health: <a href=\"https://www.microsoft.com/en-us/research/project/project-talia/\" class=\"linkified\">https://www.microsoft.com/en-us/research/project/project-talia/</a></p> <p>Follow Danielle on Twitter: <a href=\"https://twitter.com/danicmbelg\" class=\"linkified\">https://twitter.com/danicmbelg</a></p> ",
    "end_time": 1599676200,
    "link": "https://www.meetup.com/Anthropology-Technology-Meetup-Group/events/271901047/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "anthropology-technology",
    "start_time": 1599672600,
    "title": "Human-centred ML for healthcare with Danielle Belgrave, Microsoft Research"
}