{
    "cancelled": false,
    "description": "<p>We'll kick off the year with a focus on how to make money form mobile apps. The Engine shed has kindly agreed to let us use the space there so a great chance to check out Bristol's newest tech workspace. </p> <p>Speakers: </p> <p>• Welcome and intro - Scott Alexander-Bown</p> <p>• Nick Sturge - Welcome to the EngineShed</p> <p>• Rick Chapman - Intro to app monitisation</p> <p>• Paul Freeman - sharing some of his personal experiences as an app developer. </p> <p>• Kieran Gutteridge - sharing insights from building mobile apps with intohand.com</p> <p>• Panel discussion - Chaired by Tim Wicksteed  </p> <p>As always keen on hear from experiences of what worked? what didn't? we have slots for a speaker and panel slots. </p> <p>Special thanks to the EngineShed as venue sponsor and StartApp our Event Sponsor who will provider beer and maybe even some nibbles after the talks at the Knights Templar (2 min walk from engine shed).</p> <p>Event Sponsor: StartApp</p> <p><a href=\"http://www.startapp.com/\">StartApp</a> is a mobile advertising platform. Founded in late 2010, StartApp deals with the two main parts of the mobile industry today: the monetization challenge that application developers face when trying to generate substantial revenue from their free applications, and application distribution – earning a substantial number of downloads worldwide.</p> <p>We currently partner with 60,000 applications, generating 1 billion SDK downloads. This partnership allows us to offer advertisers over 6 billion monthly ad impressions worldwide.</p> <p>StartApp’s headquarters are in New York, with offices in Israel, China and India.</p> <p>Venue Sponsor: EngineShed</p> <p><a href=\"http://www.engine-shed.co.uk/about/\">EngineShed</a> A gateway to enterprise for Bristol &amp; Bath</p> ",
    "end_time": 1392237000,
    "link": "https://www.meetup.com/swmobile/events/153974942/",
    "location": null,
    "org": "swmobile",
    "start_time": 1392231600,
    "title": "How in the heck do I make money from apps?"
}