{
    "cancelled": false,
    "description": "<p>For our next talk, we'll focus on user testing. We have some great talks lined up and then we'll open up the floor for general discussion.</p> <p>If anyone else would specifically like to speak before the general discussion then please let me know and I'll happily add you to the line-up.</p> <p>After the talk we can head over to the nearby Colston Yard to continue the discussions over beer.</p> <p>Speakers: </p> <p>• Ben Bywater and Craig Pugsley</p> <p>The Whites Of Their Eyes: What Has Agile User Testing Ever Done For Us?</p> <p>“Ben Bywater and Craig Pugsley, UX leads at Nokia MixRadio in Bristol, will present a whistle-stop tour of the lean user insight gathering techniques they use. They'll show us their guerrilla test lab, how they recruit users, the software they use to live broadcast, how much it costs, the benefits and drawbacks and discuss some of the finer points of highlighting other people's mistakes. They'll also discuss some alternative techniques to capture user insight in rapid and concise ways.</p> <p>The talk will be short, with the remainder of the time given over to the audience to actively participate and recount their tales of success or woe getting user insight into  product development processes. Please come prepared!”</p> <p>• Frank West</p> <p>The when and who of user testing</p> <p>Frank West will give his thoughts on the `when and who` of user testing, how do we go about finding the right people and when do we actually need them? Getting the right user feedback can be the difference between a successful project and a failure but with a limited budget can we afford to be picky? The answer is yes!</p> <p>• Jon Payne and Josh Baldwin</p> <p>Will give an introduction to <a href=\"http://odlbristol.co.uk\">Open Device Lab Bristol</a> which offers developers the ability to test their wares on real tablets and phones for FREE. Hopefully, we'll also be able to get them to share some of their experiences of user testing from their day jobs at Noisy Little Monkey.</p> ",
    "end_time": 1396467000,
    "link": "https://www.meetup.com/swmobile/events/162001822/",
    "location": {
        "address": "Merchant Venturers Building Woodland Road Bristol BS8 1UB",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4561653137207,
        "longitude": -2.60315203666687,
        "name": "University of Bristol, Merchant Venturers Building"
    },
    "org": "swmobile",
    "start_time": 1396461600,
    "title": "User Testing"
}