{
    "cancelled": false,
    "description": "<p>So, it's time to get your hack on in 2015.....and where better to start than with the first SWmobile 'Hack Day'?! </p> <p>Kindly hosted by the fantastic team at Noisy Little Monkey who as well as providing the space itself, will be providing the <b>beer</b> and <b>pizza</b>! I'm also reliably informed there will also be a out-pouring of creative project ideas from them that will (perhaps quite literally) set the world on fire. </p> <p><b>New Sponsor:</b> <a href=\"http://www.pusher.com\">Pusher</a> have kindly step in to offer developer advocates on the day, <b>prizes</b> for the best use of their SDK and for best other project and a <b>bar tab</b> after the event!!!!</p> <p>Pusher is a hosted API for quickly, easily and securely adding scalable realtime functionality to web and mobile apps. We believe that your developer time is best spent making awesome features, not creating infrastructure. Our customers use Pusher to build features such as notifications, activity streams, chat, data visualisations, Social TV experiences and multiplayer games.</p> <p>We now have two streams for a theme, \"Best use of the Pusher SDK\" and \"Best 'Bring Your Own' Project\".  We're really excited to see what happens on the day and we'll be using <a href=\"http://www.hackathon.io/\">hackathon.io</a> to provide more details and collect project ideas so feel free to sign up. We'll update the event and publish it in the next few days.</p> <p>Places are limited so why not sign up now and we'll keep you updated. </p> <p>Note about the £5 sign up fee, it is a deposit. <b>If you turn up</b> on Saturday or we cancel for any reason <b>you will be refunded</b>. </p> <p>The event venue has to compile with fire regulations so we wanted to ensure those who RVSP yes definitely plan to attend. With take a more relaxed approach on talk nights and often see drop outs near or on the day. We didn't want anyone to miss out. If you are totally oppose to the paying deposit then feel free to drop us an email. </p> <p>Whats not to like? Get cracking and start hacking....</p> <p>Entry to the hackathon is optional, if you not bothered about the prizes or it’s too early a start for you, then you’re still welcome to come along a hack a personal project and enjoy the free food/beer. Although if you’re definitely not entering just drop us an msg/email after sign up.</p> <p>Proposed time table for the Hack day:</p> <p>9.00 organisers and venue volunteers arrive to setup</p> <p>9.30 doors open to SW members <b>(please arrive before 10)</b></p> <p>10.00 kick off (prompt) with short intro and WiFi codes etc</p> <p>10.15 hacking start</p> <p>12:30 Food arrives</p> <p>13.00 make sure your project is submitted</p> <p>15.00 judges doing the rounds</p> <p>15.45 stop hacking and refresh yourself with quick tidy up and grab a beer</p> <p>16.15 presentations (no slides, 2-3 min max)</p> <p>16.45 winners announced and awards given</p> <p>16.55 leave for pub after tidy up</p> <p>17.00 cottage pub 5min walk for sponsored bar tab</p> <p>Other things to note/rules</p> <p>Recommend arrive with SDKs, IDE’s downloaded - past experience tells us Large downloads and shared WiFi doesn’t play nice!</p> <p>Two prize catergories</p> <p>• Best use of Pusher (sponsor) SDK</p> <p>• Anything else, but make it fun!</p> <p>All projects considered although preferably mobile related</p> <p>Start from zero - in the interests of fun and fair play we ask that you all start from a clean state. No reason why you can’t read up and play with pusher ahead of time <a href=\"https://pusher.com/docs\"><a href=\"https://pusher.com/docs\" class=\"linkified\">https://pusher.com/docs</a></a></p> <p>Concepts and interactive wireframes welcome*- we appreciate that it’s a limited time, so if you sketched your ideas in wireframing tool and can so us/judges that it will all help your cause.</p> <p>*We figured this would be ideal way for non developers to contribute and a chance to try out a new wireframing tool, we used proto.io,ninjamock.com or balsmiq in the past.  </p> ",
    "end_time": 1425139200,
    "link": "https://www.meetup.com/swmobile/events/219690425/",
    "location": {
        "address": "C/O Aardman,  Gasferry Road,  Bristol, BS1 6UN",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.44741439819336,
        "longitude": -2.6078109741210938,
        "name": "Noisy Little Monkey"
    },
    "org": "swmobile",
    "start_time": 1425117600,
    "title": "Hack Day"
}