{
    "cancelled": false,
    "description": "<p>In July we'll be focusing on some of the newer programming paradigms in mobile reactive programming.  </p> <p><b>Talk 1: Reactive apps with Realm on iOS -  Marin Todorov </b></p> <p>In this talk we're going to look into few of the aspects of building a reactive app. It's pretty easy to keep the UI responsive and the architecture decoupled by leaving Realm do the heavy lifting of getting data in and out and notifying all parts of the app that need to know about changes to your model. Marin will show a few techniques (by the power of live coding) about implementing a reactive architecture in your app with the help of Realm. </p> <p><b>Marin Todorov</b> is an iOS developer and author. He's part of Realm and the raywenderlich.com team. Besides crafting code, he also enjoys blogging, writing books, teaching, and speaking. He sometimes open sources his code. He walked the way to Santiago. More about Marin at: <a href=\"http://www.underplot.com\">www.underplot.com</a></p> <p><b>Talk 2 - RXJava  - James McGuire </b></p> <p>Technical talk focusing on a practical beginner side of Rx, and a dabble in a few of the useful but non obvious parts</p> <p>As usual expect tasty pizza and refreshments at the venue and further discussions at a nearby pub afterwards. </p> <p>Time table: </p> <p>• 18:00-18:15 - organisers/volunteers arrive</p> <p>• 18:30 doors open / pizza arrive</p> <p>• 19:00 Intro by SWmobile organiser (thank sponsors, venue admin i.e toilets, fire exits)</p> <p>• 19:05 talk one</p> <p>• 19:[masked]min comfort break</p> <p>• 19:50 Talk two </p> <p>• 20:30 finish up and head to the pub (TBA)</p> <p>• 20:45 Volunteers leave after helping tidy up  </p> ",
    "end_time": 1469561400,
    "link": "https://www.meetup.com/swmobile/events/231240727/",
    "location": null,
    "org": "swmobile",
    "start_time": 1469554200,
    "title": "SWMobile: RxJava and Reactive app with Realm on iOS"
}