{
    "cancelled": false,
    "description": "<p>With both Google I/O and WWDC taking place over the next month, June's meetup seems like the perfect time for us to review all the shiny new things. As usual, we'll have a selection of top notch talks, followed by socialising at a nearby watering hole.</p> <p>June's event will be held on <b>Tuesday, June 21st </b>at<b> 6:30pm </b>at the offices of <b>cxpartners</b>.</p> <p>Our lovely speakers for this month are:</p> <p>• David Taylor, Somo: What's new in Android</p> <p>• James Frost, Automattic: What's new in iOS</p> <p>• Sam Davies, Razeware: iMessage Extensions in iOS 10</p> <p>• Andy Barber, Careflow Connect: What's new in Android Studio</p> <p>🍏 What will iOS 10 (or perhaps iOS X?) have in store for us? How long will we have to spend fixing our apps to be Swift 3 compatible?</p> <p>🤖 Google could bring us some interesting new platforms: Android VR, Project Tango, and Google Chirp (a potential Alexa competitor)</p> <p>🍭 Will Android N get a sweet new name?</p> <p>⌚️ Only time will tell what improvements we'll see to Android Wear and Apple Watch</p> <p>✈️ If you're not hopping on a plane to California this month, then hop on a bus to SWMobile instead!</p> <p>🙋🏻 If you're interested in speaking at this event, please get in touch! You can email [masked], or send us a message through Meetup.com. We already have one speaker for \"What's new in iOS\", but we're definitely in need of somebody to cover Android. Or perhaps you'd like to do a short 5 or 10 minute talk on one specific feature? Let us know!</p> ",
    "end_time": 1466541000,
    "link": "https://www.meetup.com/swmobile/events/231212447/",
    "location": {
        "address": "2 College Square",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45281219482422,
        "longitude": -2.6004979610443115,
        "name": "cxpartners"
    },
    "org": "swmobile",
    "start_time": 1466530200,
    "title": "June Talk Night: What's New in Mobile"
}