{
    "cancelled": false,
    "description": "<p><b>Entrepreneurship</b></p> <p>We've all heard of it. Most of us have probably dreamt of starting up our own company and being the next Gates/Zuckerberg/Jobs/etc., but what is it really like?</p> <p>We'll hear from two companies that have started from scratch and are now making a success of it with an App. What inspired them? What has it been like? What advice do they have for others? We're also hoping to have a couple of introductions from local Bristol incubators and so that you can talk to them and learn more about what support is on offer for local start ups. This will be fun and interesting whether you are interested in stating a company or not. </p> <p><b><i>Speakers: </i></b></p> <p>1) Wriggle</p> <p><i>Wriggle are a Bristol-Born Mobile App, Website and Guide with a simple goal: to encourage people to discover more of their city through great independent food &amp; drink, and to help them save a few pounds in the process. Born in Bristol in 2014, Wriggle has now also established itself in Brighton and will soon be readying itself for another period of growth – through a Q4 platform launch across the Severn in Cardiff. </i></p> <p>2) Limber</p> <p><i>Limber is an on demand staffing platform for the hospitality and retail sectors.  Limber aims to change the way these sectors employ – allowing them to flex their part time staff on demand to match their busy periods.  Its founders, Rich and Chris (an ex tech strategist and lawyer respectively) say that they’re trying to eradicate the “revolving door” of staff that the hospitality and retail sectors suffer from.  Limber is a brand new product and is due to go live </i>&lt;a&gt;<i>on 1 October 2016</i>&lt;/a&gt;<i>.</i></p> <p><i>Rich and Chris are going to talk about their recent experiences developing their app, its core features and, from their (layman’s) perspective, what makes a good techy a great one!</i></p> <p><b><i>Venue:</i></b></p> <p><b>Entrepreneurial Spark</b></p> <p>5th Floor, Trinity Quay Phase 1, Avon St, Bristol, BS2 0PT, Bristol </p> <p>Directions: <a href=\"https://files.calvium.com/index.php/s/chPtodk4xPFVbxB\"><a href=\"https://files.calvium.com/index.php/s/chPtodk4xPFVbxB\" class=\"linkified\">https://files.calvium.com/index.php/s/chPtodk4xPFVbxB</a></a>   </p> <p><b><i>Time:</i></b></p> <p>Tuesday the 27th of September. </p> <p>Doors open at 6:30pm, first speaker will start at 7pm. </p> <p>At around 9pm we'll move on to a local pub for more conversations. </p> ",
    "end_time": 1475006400,
    "link": "https://www.meetup.com/swmobile/events/234063641/",
    "location": {
        "address": "5th Floor, Trinity Quay Phase 1, Avon St, Bristol, BS2 0PT",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45301818847656,
        "longitude": -2.583340883255005,
        "name": "Entrepreneurial Spark"
    },
    "org": "swmobile",
    "start_time": 1474997400,
    "title": "September talk night: Entrepreneurship"
}