{
    "cancelled": false,
    "description": "<p>Welcome to July's SWmobile meetup, this month we have a real treat instore! Paul Blundell is visiting us from Liverpool to give us an more in-depth look at Android Things. Our 2nd talk will be exploring Firebase from an iOS perpective by Daniele Pietrobelli. Firebase pretty much takes off where Parse.com left us so exciting to see how it can be used for both side and professional projects . </p> <p>We'll be at BaseKit for the first time! so big thanks to them. </p> <p><b>Talk 1:  Android Things : Solid Foundations by Paul Blundell (Android and IoT GDE) </b></p> <p>Android Things is Googles latest foray into the Internet of Things. Android Things lets you build professional, mass-market products on a trusted platform, without previous knowledge of embedded system design. IoT devices need testing too. This talk will give an introduction to the new Android Things APIs, also how to architect to keep your codebase clean and your IoT devices solid. The second half of the talk will be a deeper dive into controlling Android Things peripherals. We'll explain what are user drivers, how they work, how to use them, and most importantly: how you can create and test a new driver from scratch that can be used for Android Things to interact with new peripherals. </p> <p><b>Talk 2: Exploring Firebase for iOS by Daniele Pietrobelli </b></p> <p>The story of a simple app using CoreML and Firebase to observe reality in real time.</p> <p>Timetable: </p> <p>• 18:00-18:15 - organisers/volunteers arrive</p> <p>• 18:30 doors open / pizza arrive </p> <p>• 19:00 Intro by SWmobile organiser (thank sponsors, venue admin i.e toilets, fire exits)</p> <p>• 19:10 Talk one</p> <p>• 19:[masked]min comfort break</p> <p>• 19:50 Talk two</p> <p>• 20:20 finish up and head to the pub</p> <p>• 20:30 Volunteers leave after helping tidy up</p> ",
    "end_time": 1501014600,
    "link": "https://www.meetup.com/swmobile/events/236662449/",
    "location": {
        "address": " Tower Hill",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45497512817383,
        "longitude": -2.5851099491119385,
        "name": "BaseKit, 5th Floor, One Castlepark"
    },
    "org": "swmobile",
    "start_time": 1501003800,
    "title": "SWmobile July: Android Things and more"
}