{
    "description": "<p>Welcome to March’s SWmobile event, kindly hosted this month by the folks at Cookpad.</p> <p>Talks<br/>- The Lifecycle for Creating Killer Voice Apps (Craig Pugsley)<br/>- Why you need a good WorkManager in your life (Jan Szymanski)</p> <p>Timings<br/>18:30 Doors, Food &amp; Drink<br/>19:00 Talks<br/>19:50 Break<br/>20:00 Final talk<br/>20:30 Tidy up &amp; Head to a local pub to continue the conversation</p> <p>As always we welcome new speakers. Please message the lead organiser (Karl Nosworthy) or any of the other organisers if you have a talk idea, or fill out the form at <a href=\"http://cfp.swmobile.org\" class=\"linkified\">http://cfp.swmobile.org</a></p> <p>🗣️The Lifecycle for Creating Killer Voice Apps (Craig Pugsley)</p> <p>Craig Pugsley is founder and creative lead at StudioFlow, a design studio specialising in emerging platforms.</p> <p>Voice is unquestionably the next big addressable B2C market - voice commerce in the US and UK is predicted to be worth up to $40Bn by 2022, Google Assistant now available on 1.4 billion devices worldwide and Apple are finally getting serious with Siri. And you want a piece of the action?</p> <p>Well, building a voice app is easy. The dev tooling is great, the platforms are led by some of the world’s best engineering companies, documentation is comprehensive and robust, and - ultimately - it’s just spoken words, right? It’s never been easier to get a digital product to market. How hard can it be?</p> <p>Surprisingly hard, as it turns out. Get it right, and you leaf-frog your competition, securing a valuable beach-head in user’s minds and aligning your brand with this crucial new technology. Get it wrong, and you’re quickly relegated to the bargain bin of 1-star Alexa skills, tainting your brand's image, souring your organisation’s view of this exciting new tech and jeopardising your readiness for voice.</p> <p>We’ve found the key to creating a great skill is to start at the beginning, and deeply understand what your users really want from a voice app before you write a single line of code. By understanding what your users need, you can build something that serves them better than anyone else. You’ll keep them happy, keep them satisfied and keep them coming back time and time again. At the heart of this user research is a design process based around Lean Startup methodology: build, measure, learn. Do just enough research to understand the problem, then create a prototype of your solution(s) you can validate using real users.</p> <p>So, in this session, I'll be taking you through our Lifecycle for Creating Voice Apps - starting with lean user research techniques, then moving in to everything else that goes into a great voice app: tips to translate brand guidelines into a conversational personality, designing great responses with SSML, the power of sonic style guides, the importance of content and marketing strategy, dynamic vs. pre-recorded voices, which platforms to target and finishing up with a bit of good old-fashioned voice architecture geekery.</p> <p>If you think voice is the next big thing (hint: it kinda already is), I’ll see you there.</p> <p>🛠️Why you need a good WorkManager in your life (Jan Szymanski)</p> <p>WorkManager is a new job scheduling API introduced by Google as part of Android Jetpack. It lets you schedule deferrable tasks that are guaranteed to run even when your app is killed or if the device reboots. In my talk, I will describe how it improves on existing solutions, what makes it powerful and what the typical use cases are, followed by examples of how to integrate it into your app.</p> ",
    "end_time": 1553113800,
    "link": "https://www.meetup.com/swmobile/events/258883481/",
    "location": {
        "address": "1 Broad Plain",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45417404174805,
        "longitude": -2.582395076751709,
        "name": "Cookpad"
    },
    "org": "swmobile",
    "start_time": 1553106600,
    "title": "March Talk Night"
}