{
    "cancelled": false,
    "description": "<p>Welcome to the February meetup event! this wil be our first talk night of 2023 which we'll be hosted by our firends at Dyson. We have an exciting talk on end-to-end mobile tesing already booked and working on additional speakers which will be confirmed in due course.</p> <p>Due to venue requirements there will be no video recording and we'll have to adhere to the event RSVP list. Please ensure you have RSVP'd and your full name is correct in your meetup profile (plus actual photo if possible but not required) to avoid any entry issues. If you'd like to bring a guest please encourage them to sign up and join group.</p> <p>If you have a talk or want to share any updates with the group since the last meetup, i.e you've released a new app, or open-source project please let us know and we'll try to carve out some space for this.</p> <p>CFP form[ <a href=\"http://cfp.swmobile.org](http://cfp.swmobile.org\" class=\"linkified\">http://cfp.swmobile.org](http://cfp.swmobile.org</a>)</p> <p>**Talks**</p> <p>* Talk 1: We made a tool to create and run end-to-end tests by Tom Riglar and Charles Killer from [Moropo.com](<a href=\"http://moropo.com/\" class=\"linkified\">http://moropo.com/</a>)<br/>* Talk 2: Rethinking Mobile UIs in .NET by Matt Lacey</p> <p>**Timings:**<br/>18:30 Doors open, Food, typically pizza with veg and vegan options available &amp; drink<br/>19:00 Intro talk<br/>19:10 First talk<br/>19:45 Break<br/>20:00 2nd Talk<br/>20:45 Finish (tidy up)<br/>21:00 Continue the conversation at a near by pub (TBC)</p> <p>If you are a first-time member and/or don't know anyone and would rather pre-meet so you arrive with others please drop us a message via meetup.com (or @scottyab Twitter) and we'll arrange it.</p> <p>See you there!</p> ",
    "end_time": 1677616200,
    "link": "https://www.meetup.com/swmobile/events/290284198/",
    "location": {
        "address": "One Cathedral Square",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451454162597656,
        "longitude": -2.5996639728546143,
        "name": "Dyson Bristol Office"
    },
    "org": "swmobile",
    "start_time": 1677609000,
    "title": "February Tech Talk Night"
}