{
    "cancelled": false,
    "description": "<p>Welcome to the April event hosted at Natwest! this month we have two exciting talks, the first by Paul Freeman will be exploring how ChatGPT can help bridge knowledge gap with cross platform development, plus we'll be inviting you all to show and tell any of your own examples of using ChatGPT in a mobile development context.<br/>The 2nd talk by David Branton will focus on how we as engineers can negotiate and influence our teams to elevate their priorities within their team or company.</p> <p>Looking forward to see you there! Note: RSVPs will close Monday so we can supply a list of names to venue security. As always if you cannot attend please do update your RSVP</p> <p>**Talks**</p> <p>* Cross platform development with ChatGPT - Paul Freeman<br/>* Pretty Dashboards Win Over Prose - David Branton<br/>This talk is aimed at \\`The Frustrated Engineer\\` who would like their top priority to be elevated within their team or company.</p> <p>**Timings:**<br/>18:30 Doors open, Food (typically pizza with veg and vegan options) available &amp; drink<br/>19:00 Intro and talks<br/>19:45 Break<br/>20:00 talks<br/>20:45 Finish (tidy up)<br/>21:00 Continue the conversation at near by pub (TBC)</p> <p>If you are a first time member and/or don't know anyone and would rather pre-meet so you arrive with others please drop us an message via meetup.com (or @scottyab twitter) and we'll arrange it.</p> <p>If you are keen to speak at a future event please fill in the CFP form[ <a href=\"http://cfp.swmobile.org](http://cfp.swmobile.org\" class=\"linkified\">http://cfp.swmobile.org](http://cfp.swmobile.org</a>)</p> <p>See you there!</p> ",
    "end_time": 1682451000,
    "link": "https://www.meetup.com/swmobile/events/291311520/",
    "location": {
        "address": "2 Trinity Road, Avon Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.452850341796875,
        "longitude": -2.5830390453338623,
        "name": "NatWest Accelerator"
    },
    "org": "swmobile",
    "start_time": 1682443800,
    "title": "April Tech Talk Night "
}