{
    "cancelled": false,
    "description": "<p>Why agile teams need HISTORY in order to collaborate...</p> <p>\"In my experience as an agile coach collaborative teams are often a necessity and I believe all teams have the potential to collaborate well, yet not all teams do. How do you turn a group of individuals into a creative, collaborative team? Are there any patterns that we can follow to help us increase our teams' collaboration? This session will introduce you to some techniques and exercises I have observed in some of the most successful and collaborative agile teams I have come across.</p> <p>This session will explain the foundational characteristics required for collaboration to exist and grow and will let you experience short, practical and easy-to-implement techniques that you can use with your team(s) to increase their collaboration.\"</p> <p><b>Who is Geoff?</b></p> <p>Geoff has pretty much seen and heard it all from a Scrum perspective. As the first Certified Scrum Coach and the longest serving Certified Scrum Trainer, he is highly experienced in the application of Scrum as well as being qualified as a personal and business coach. Even his training courses are based as much around bringing out the knowledge already within the room as it is about being a teacher. His philosophy is based on belief in human potential and creating and supporting a sense of self-awareness and self-confidence in his clients, both individual and organisational.</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/6/e/5/c/600_205048252.jpeg\" /></p> <p>You can follow Geoff on <a href=\"http://twitter.com/geoffcwatts\">Twitter</a>, and you can find Geoff's book \"Scrum Mastery: From Good To Great Servant-Leadership\" on sale at Amazon <a href=\"http://www.amazon.co.uk/Scrum-Mastery-From-Great-Servant-Leadership/dp/0957587406/ref=sr_1_13?ie=UTF8&amp;qid=1370102670&amp;sr=8-13&amp;keywords=scrum\">here</a>.</p> ",
    "end_time": 1394485200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/156075682/",
    "location": null,
    "org": "agile",
    "start_time": 1394478000,
    "title": "\"Why agile teams need HISTORY in order to collaborate\" with Geoff Watts"
}