{
    "cancelled": false,
    "description": "<p>What is the difference between a project that goes ok and one that is an outstanding success?</p> <p>We believe the differences is in the human understanding element.</p> <p>Is there a secret sauce or key skill set that is missing from current Agile training?</p> <p>Our experience says yes, there is and it can be learnt.</p> <p>Over the last 10 years of training and coaching professionals including Project Managers and Agile teams the constant feedback we get is that the tools and models we train are key to their accelerated success within the profession.</p> <p>During this one &amp; a quarter hour workshop Tony Nutley will deliver a highly interactive session outlining key tools and models form the world of Coaching and NLP and how their application within the Agile process creates additional understanding in teams leading to greater success.</p> <p><b>About Tony</b></p> <p><img src=\"http://ukcpd.net/images/trainers-tony.png\" /></p> <p>Tony Nutley, Director of Training</p> <p>Tony has been involved with personal development for almost 12 years. He has a passion for all things in the human potential field and is constantly researching and developing new approaches that empower his clients. Tony truly believes that everybody has the resources to lead an enhanced life if they are given the opportunity, tools and information to make personal life changes, set outcomes and are congruent with themselves and those around them.</p> <p>Tony Nutley is a Master Practitioner in NLP, a Time Line Therapy™ Practitioner, a qualified Clinical Hypnotherapist and a successful SFM™ Life Coach. Recently Tony has studied Ericksonian Psychotherapy (Contemporary Psychotherapy). He is currently studying traditional Psychology.</p> <p>Tony works and lives in Swindon Wiltshire in the UK where he runs several work-shops on personal growth. He has developed the Kick Start™ personal development coaching program and has produced the NLP Foundation Skills manual. Tony publishes a regular personal development e-zine. He has published two books.</p> <p>Tony runs a busy therapy practice; he combines techniques from NLP, hypnotherapy and contemporary psychotherapy to help his clients move forward in their lives.</p> <p><a href=\"http://www.ukcpd.net\"><a href=\"http://www.ukcpd.net\" class=\"linkified\">http://www.ukcpd.net</a></a></p> <p>Venue, tea and biscuits kindly provided by Kainos.</p> <p>Kainos provides digital technology solutions that enable organisations and people to work smarter, faster, better.  With more than 650 staff in Bristol, London, Belfast and Gdansk, the company supports the technology needs for over 150 global customers, in government, healthcare and financial services. Kainos are agile and creative, and are currently seeking new talent to join their innovative teams. <a href=\"http://www.kainos.com/careers/\"><a href=\"http://www.kainos.com/careers/\" class=\"linkified\">http://www.kainos.com/careers/</a></a></p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/7/d/4/8/600_419312072.jpeg\" /></p> ",
    "end_time": 1413316800,
    "link": "https://www.meetup.com/agile-bath-bristol/events/156076682/",
    "location": {
        "address": "Redcliffe Way",
        "city": "Bristol, BS1 6NJ",
        "country": "gb",
        "latitude": 51.448238372802734,
        "longitude": -2.5877480506896973,
        "name": "Doubletree by Hilton"
    },
    "org": "agile",
    "start_time": 1413309600,
    "title": "From Good To Great, with Tony Nutley"
}