{
    "cancelled": false,
    "description": "<p>Andy will give a talk called \"The Sports Coach And The Entrepreneur\". Looking at the key traits, behaviours and people management skills equally common to both areas. </p> <p>Who is <a href=\"https://twitter.com/theandymccann\">Andy McCann</a>?</p> <p>Andy is in demand from high performing individuals from many walks of life as a performance coach and mentor. These include some of the UK’s highest profile individuals from business, entertainment, and international sports stars and coaches from across several sports. In addition, Andy sits on the Sport Wales Advisory Group and the Welsh Advisory Committee for the Stroke Association.</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/4/f/9/4/600_384560372.jpeg\" /></p> <p>Previously an award winning teacher of physical education, Andy provides specialist consultancy support to UK Sport, SportsCoach UK, and is a visiting / associate lecturer at a number of universities in England and Wales. He supports several international teams and coaches across different sports in their preparation to compete at the very highest level including the Olympics and Commonwealth Games. His work has been described as ‘cutting edge’ (Daily Telegraph) and he is regularly featured in the national press and on TV and radio. Andy has an interest in the development of mental toughness and performance. An elected Fellow of the Royal Society of Medicine and an internationally published non fiction author, he has been a commissioned writer for a diverse range of publications.</p> <p>A popular conference speaker, Andy has spoken at various national business events; at the Royal Society of Medicine; and in collaboration with major sports performance brands. He is a co-founder of the acclaimed ‘Walking the Tightrope High performance Symposium’, which brings together high performing practitioners and experts to knowledge share. His accessible style draws from an expertise including over 25 years combined experience of education, business, neuropsychology and elite sports performance.</p> <p>Though a keen swimmer, rugby player and skier, Andy devoted many years developing a very successful martial arts career and has been involved in international and World Championship events as a competitor, coach and referee.</p> <p>“Andy has extraordinary motivational gifts and insight into the minds of people in competitive situations or under stress where successful performance is essential. He knows how to develop confidence in high performers and others and to help them retain the knowledge he imparts. He is one of the most gifted people in his profession of anyone I have met.” Dame Tessa Jowell, Shadow Minister for the Olympics</p> <p>“\"Andy McCann has been a big part of the success of the teams he works with. But I know from my own experience that he is also terrific working with individuals dealing with high pressure situations. His skills and experience have proven to be transferable across many sectors.” Alastair Campbell, British journalist, broadcaster, political aide and author, Director of Communications and Strategy for Prime Minister Tony Blair</p> <p>“Andy embodies the qualities of a Michelin chef, but working in the world of sports psychology. He has taken the subject by the scruff of the neck and adapted his own recipes in a successful quest for excellence in his field. The 100% positive feedback from the athletes with whom he has worked, speaks for itself.” Andy Halliday, Team GB Men’s Hockey Team Manager</p> <p>“I truly believe Andy is one of the premier operators, in his field.” Shaun Edwards OBE, Wales and British Lions Coach</p> <p>”It was great to engage Andy's professional services with the Red Bull High Fliers Day at the University of Bath's High Performance Centre. Andy demonstrated how he successfully works with elite sports people to unlock their true potential and be the best that they can be. \" Jason Gardener MBE, Olympic Champion</p> <p>“Though highly recommended, Andy excelled our expectations. His pragmatic approach to high performance leadership was cleverly constructed and professionally delivered judging the needs of the audience exactly. At the end of the meeting you could feel the “motivate buzz.” as people were leaving.” Stuart Barnes, Business Advocate Forest Means Business</p> <p>“Andy is one of that rare breed of people who have the vision and intellect to inspire virtually any audience. To see him operate is an uplifting, refreshing and pleasurable experience. I sat in on one of his seminars, for 300 people, dealing in the main with financial issues First class, no other way to put it.” Paul Fielding, Cambria Financial</p> <p>“Andy and Steve Eaton MBE, gave an elite cohort of Welsh sport coaches a critical understanding of leadership qualities necessary to help improve their athletes performance. Not only was their talk really insightful and practical but it also identified core values necessary for success whether you are dealing in the world of business, sport or the military.” Brian Davies, Head of Performance, Sport Wales</p> <p>“If there is one thing that I will remember about the rather busy conference it is Andy’s talk.” Professor Lalit Kalra C, H Kings College London</p> <p>“The ReThink Group invited Andy to work with our sales team in July, 2013. The day was both inspirational and thought provoking and the results following were dramatic with two records sales months following Andy’s visit. I would happily recommend Andy’s work to any individual, team or business that was passionate about winning and finding the extra edge.” Gareth Jones, Regional Manager Manchester, ReThink Group</p> <p>”Andy provided quite possibly some of the best informative yet rewarding and practical mentoring I have received over many years, giving me a new found confidence leading into London 2012 and helping equip me to self analyse and clarify decision making processes under extreme pressure during the Paralympic Games.” Anthony Hughes MBE National Performance Manager, Disability Sport Wales Throws Coach, UK Athletics Paralympic Programme</p> <p>”I worked with Andy using his skills and knowledge in a mentoring capacity during my current tenure as coach to one of GB's top female tennis players. Anyone fortunate to be afforded the opportunity of working with Andy going forwards shouldn't hesitate to take advantage of his expertise.” Jeremy Bates, LTA Head of Women’s Tennis</p> <p>“Andy has been very valuable as a mentor. He is a very insightful person who is very attuned to the needs of the people he is working with.” Mark Earnshaw, GB Rowing Coach</p> <p>“Working with Andy has helped me both personally and professionally. His support is invaluable to me as a professional sportsman.” Leigh Halfpenny, Cardiff Blues, Wales, The British &amp; Irish Lions</p> <p>“I‘ve confidently worked with Andy for a period of 4 years. I found him nothing but professional and he has helped me both personally and professionally. I happily recommend his services to elite performers.” Ryan Jones, Ospreys, Wales (most caps as Captain) &amp; The British Lions</p> <p>“Andy helped me to prepare for my first international rugby cap. We have worked together very since.” George North, Scarlets &amp; Wales</p> <p>“I honestly believe it's no coincidence that my success has been under the guidance and help of Andy, because I trust him a lot and so much of the success I’ve had is down to him making me feeling good when I’m on the pitch.” Sam Warburton, Wales&amp; British Lions Rugby Captain</p> <p>“I have worked with 3 different psychologists across my career to date, but Andy’s understanding of sports performance, and the human mind is incredible. Having lost a world championship by 1 point a few weeks before meeting him in 2011, I wish I had spoken to Andy before the championships and so I immediately started working with him.” Sam Brearey,. Gold Medalist and Word Sailing Champion, 2012</p> <p>“Andy was able to use his personal experiences to deliver some key messages on performance and continuous improvement, and to illustrate how highly performing teams can stay at the top whilst striving to increase the quality of the outputs they deliver.” Brian Evans FIS Area Fraud Manager, Wales (FIS Ymchwilydd Twyll Ardal, Cymru) </p> ",
    "end_time": 1409688000,
    "link": "https://www.meetup.com/agile-bath-bristol/events/156076662/",
    "location": null,
    "org": "agile",
    "start_time": 1409680800,
    "title": "\"The Coach And The Entrepeneur\"- Guest Speaker Andy McCann"
}