{
    "cancelled": false,
    "description": "<p>Happy New Year Everyone!</p> <p>This month we will be treated to not one but TWO speakers in the same evening! As two experienced Agile practitioners, James and Andy will give us two presentations on their experiences....</p> <p><b>Andy Hiles:</b> Andy began his computing career building poorly assembled websites for friends and family, and to this day continues to under-perform in all personal attempts to create interesting web design. A firm believer that great teams build great products, Andy is an Agile Coach and Trainer at Agile Snap. </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/1/d/f/c/600_433087676.jpeg\" /></p> <p><b>Andy's Talk:</b> <b>We failed!... in a really good way.</b></p> <p><b>About Andy's Talk:</b> I didn't realise 'water-scrum-fall' was an actual recognised thing, Google it, there are diagrams and everything! So hopefully in my session (with with a bit of humour thrown in), I'll take you through my journey of Agile implementation, the pitfalls and realisation of what I won't be doing next time I get the chance.</p> <p><b>James Harvey:</b> With 10 years of Agile experience, James has at some point taken on every role within Scrum. Now an Agile Coach and Trainer at Agile Snap, James' main focus is around coaching project teams in becoming better Scrum teams and also providing formal Agile training in all areas of the framework.</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/1/e/0/1/600_433087681.jpeg\" /></p> <p><b>James's Talk: Just make a decision. It won't kill you.  </b></p> <p>About James's Talk : James explores why teams are often terrified of making project decisions; fearing that the consequences are worse than actually making a decision in the first place.</p> ",
    "end_time": 1421186400,
    "link": "https://www.meetup.com/agile-bath-bristol/events/219148302/",
    "location": {
        "address": "BA1 5LR",
        "city": "Bath",
        "country": "gb",
        "latitude": 51.383705139160156,
        "longitude": -2.357667922973633,
        "name": "IPL Offices"
    },
    "org": "agile",
    "start_time": 1421175600,
    "title": "Guest Speakers: Andy Hiles & James Harvey"
}