{
    "description": "<p>We are lucky to able to offer you two guest speakers again for this session - Seb Rose and Andrew Fulluck.</p> <p><b>Seb Rose:</b> Consultant, coach, designer, analyst and developer for over 30 years.</p> <p>Seb has been involved in the full development life-cycle with experience that ranges from Architecture to Support, from BASIC to Ruby. Recently he has been helping teams adopt and refine their agile practices, with a particular focus on automated testing.</p> <p>A regular speaker at conferences and occasional contributor to software journals. Contributing author to “97 Things Every Programmer Should Know” (O’Reilly) and lead author of The Cucumber for Java Book (Pragmatic Programmers).</p> <p><b>About Seb's Talk:</b> <b>BDD Fundamentals</b> </p> <p>Behaviour Driven Development is no longer the \"new kid on the block\", but it's still widely misunderstood. In this session we'll examine where it came from and what it's good for. We'll also dispel some myths that have grown up over the years.</p> <p>~~~~~~~~~~</p> <p><b>Andrew Fulluck :  </b>Andrew has been involved in delivering change for over 20 years initially as an analyst developer and more recently as a portfolio manager. </p> <p>He is passionate about delivery and seeing people embrace and grow through change.<br/>He is happy to operate with Waterfall, Agile, Wagile, SAFe and any random hybrid corporate methodologies because when it comes down to it delivery is about people and common sense.</p> <p>He has not written any books, articles or blogs and is very wary of Powerpoint.</p> <p><b>About Andrew's Talk: The best job in the world!</b></p> <p>Andrew has recently returned from Perth in Australia where he set up an Agile Portfolio for a bank and introduced a single backlog for all projects. In this presentation he will share the challenges he experienced and the achievements he made. </p> ",
    "end_time": 1426024800,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/220692484/",
    "location": {
        "address": "10 Temple Back",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.452919006347656,
        "longitude": -2.58605694770813,
        "name": "Momentum Financial Technology office"
    },
    "org": "agile",
    "start_time": 1426014000,
    "title": "Guest Speakers: Seb Rose & Andrew Fulluck"
}