{
    "cancelled": false,
    "description": "<p>Facilities allowing, we are going to try an virtual session with Roman Pichler, where he will present a session via Skype.</p> <p>If anyone has a suitable venue, with reliable WiFi available, please contact one of the organising team.</p> <p><b>About the session</b></p> <p>A product roadmap is a high-level plan that shows how a product is likely to grow over time. This creates a continuity of purpose, aligns stakeholders, and facilitates prioritisation. While roadmaps are a very useful tool, applying them in Scrum poses a number of challenges:</p> <p>How can we create a realistic roadmap when markets and technologies change frequently and unexpectedly? How can we build a longer-term plan when agile teams commit to no more than four weeks? How do the product roadmap and the product backlog relate? Do they compete with or complement each other?</p> <p>This talk shares Roman's insights on leveraging agile roadmaps successfully. It answers the questions above and introduces a goal-oriented, agile product roadmap, which combines shared goals and key features into a strategic plan, and provides an umbrella for the product backlog.</p> <p><b>Who is Roman Pichler?</b></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/7/5/e/6/600_129270182.jpeg\" /></p> <p>Roman is a leading agile and lean product management expert, a Certified Scrum Trainer, and the founder of Pichler Consulting. He helps his clients create great products by providing bespoke consulting, coaching and training services. Roman is the author of four books on Agile and Scrum including Agile Product Management with Scrum. </p> <p>Roman’s involvement with Agile started in 1999. He coached his first agile project in 2001 and began working with Scrum in 2004. Roman started his career as a programmer working for a web startup. He then worked as a developer, software architect, consultant, project manager, ScrumMaster, product owner, and development manager for large enterprises before starting his own business in 2006.</p> <p>Roman has more than ten years experience in helping companies transition to Agile. This includes rolling-out Scrum in several companies, and teaching and coaching executives, product managers, product owners, development managers, project mangers, and teams. He is the founder of the London Scrum User Group, an active contributor to the Scrum Alliance and the London product management community, and a regular speaker at international conferences. Roman was named one of the 20 most influential agile people in April 2012.</p> <p>When Roman is not busy working, he enjoys spending time with his wife and two children, rides his mountain bike in the local hills or goes rock climbing. He is based near London in Wendover, Buckinghamshire, United Kingdom. Roman speaks English and German fluently.</p> ",
    "end_time": 1446588000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/222658504/",
    "location": null,
    "org": "agile",
    "start_time": 1446577200,
    "title": "\"Product Roadmaps in Scrum\" with Roman Pichler (Virtual)"
}