{
    "cancelled": false,
    "description": "<p>We close the year with a great opportunity to learn about SAFe first hand from the experts, with a session focused on planning.</p> <p>The Scaled Agile Framework (SAFe) has a special event that is held for every Program Increment (5 sprints-ish). This is a large scale, collaborative event including everyone from the Agile Release Train (50 people plus). </p> <p>This workshop will be a highly interactive event where all participants will be involved in one of many teams collaborating together to plan a single Program Increment for a single product.</p> <p>The schedule will roughly contain:</p> <p>• Overview of SAFe Program Increment Planning<br/>• (Fictional) Business Context<br/>• Product / Solution Vision<br/>• Architecture Vision And Development Practices<br/>• Planning Session 1<br/>• Draft Plan Review<br/>• Planning Session 2<br/>• Final Plan Review<br/>• Risk ROAMing<br/>• Confidence Vote<br/>• Retrospective</p> <p> This will be a fast-paced, high octane session with a lot of fun!</p> <p><b>Aaron McKenna</b> is the Commercial Director of McKenna Consultants, along with being a Scaled Agile Framework® (SAFe®) Program Consultant, Certified ScrumMaster, Advanced ScrumMaster Certified Scrum Product Owner, Certified Scrum Professional and Agile Coach. In 2014, Aaron was nominated on the shortlist to receive an award for “Best Agile Coach or Mentor – Process” at the 2014 UK Agile Awards.</p> <p><b>Nick McKenna</b> is the founder and CEO of McKenna Consultants. Nick's passion for quality software is what drives his organisation forward, implementing Agile principles and practices throughout the entire business. Nick graduated from Hull University with a First Class Degree in Computer Sciences. Since then he has gained invaluable experience over 15 years in the software industry, from writing the worlds first electronic invoice system to controlling the computer drivers on racing computer games! Nick is a SAFe Program Consultant (SPC) and is one of only a few Certified Scrum Coaches in the UK. You can often hear Nick speaking at Agile Software Development conferences.</p> ",
    "end_time": 1450218600,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/227094655/",
    "location": {
        "address": "Prudential Buildings, 11-19 Wine St.",
        "city": "Bristol, BS1 2PH",
        "country": "gb",
        "latitude": 51.45545196533203,
        "longitude": -2.592360019683838,
        "name": "Mix Radio"
    },
    "org": "agile",
    "start_time": 1450207800,
    "title": "SAFe Planning In Action"
}