{
    "description": "<p>This month's meeting is hosted by the <a href=\"http://www.cvent.com/events/accu-2016-registration-open/event-summary-2b856aa829c143abb8a969632105ed44.aspx\">ACCU Conference</a>, the premier conference for developers, taking place in Bristol across four days and focusing on technical topics, professionalism in programming and the human side of development. </p> <p>The conference organisers have kindly offered a 10% discount on conference attendance to Bath Scrum User Group members. If you haven't received an email with the discount code, just ask Ewan (event host) for it.</p> <p><b>The ScrumPLoP® Project: Towards a rationalized body of Scrum literature</b></p> <p>If broad experience is any indicator, people seem to be getting their Scrum knowledge from noisy and error-prone sources. I rarely get the right answer when asking people why the Daily Scrum is in Scrum (not even close), about the Sprint failure rate of a best-of-class Scrum team (ditto), not to mention more subtle but nonetheless crucial aspects of the framework.</p> <p>To address this problem, Scrum community leaders have come together to develop several pattern languages around the Wholes of Scrum. Unlike the Scrum Guide, these patterns provide deep rationale, history, and context for the components of Scrum. Unlike the Scrum Almanac, they reflect the authority and engagement of Scrum’s inventor and of the early shapers of the Scrum framework.</p> <p>These patterns not only provide a reference body of literature for the community but can be used as practical tools by a team adopting Scrum or transitioning to Scrum. They provide a roadmap for an incremental, piecemeal path to Scrum adoption.</p> <p>Jim Coplien is the Product Owner of the effort and will say a few words about what pattern languages are, about the Value Stream and Organizational Structure pattern languages of Scrum, and will focus on a few patterns that may surprise even people who consider themselves Scrum experts.</p> ",
    "end_time": 1461096000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/228943766/",
    "location": {
        "address": "2 Lower Castle Street, Old Market, ",
        "city": "Bristol BS1 3AD",
        "country": "gb",
        "latitude": 51.45596694946289,
        "longitude": -2.5847840309143066,
        "name": "Bristol Marriott Hotel City Centre "
    },
    "org": "agile",
    "start_time": 1461088800,
    "title": "The ScrumPLoP® Project: Towards a rationalized body of Scrum literature"
}