{
    "cancelled": false,
    "description": "<p><b>10 Behaviours Of Effective Employees</b></p> <p>It's never been more important to remain relevant to the company you work for, the wider community and the job market.</p> <p>The software industry is changing rapidly and traditional approaches to work are increasingly becoming irrelevant to many companies. In this changing market being relevant means you’ll have more opportunities for work, discover more meaningful work and have the right mindset to help companies solve tricky problems.</p> <p>Leaders are demanding more relevant skills and experiences from their team - skills and experiences that can deal with the uncertainty and unknown challenges many companies now face.</p> <p>To stay relevant to these changes you need to adopt an approach and mentality of continuous improvement and adaption to your context.</p> <p>Employees of the future will need to know how to remain relevant by up-skilling, embracing change and being flexible to changing demands in the workplace.</p> <p>In this talk Rob shares 10 Behaviours that he’s seen effective employees demonstrate. The 10 behaviours that will help you to remain relevant are:</p> <p>01 - Being Visibly Passionate</p> <p>02 - Being Aggressively Open-Minded</p> <p>03 - Stepping Outside Their Job Role</p> <p>04 - Becoming Company Smart</p> <p>05 - Customer Focused</p> <p>06 - Improving The Process</p> <p>07 - Do What They Say They Will</p> <p>08 - Communicate Effectively</p> <p>09 - Self Learners</p> <p>10 - Bravery</p> <p>This is a fun and energetic talk and you’ll come away from it inspired to go forth and succeed.</p> <p><b>About Rob</b></p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/b/a/5/d/600_453347709.jpeg\" /></p> <p>Rob Lambert is VP of Employee Engagement and Enablement at a fast paced technology company called NewVoiceMedia. Rob is also the owner of Cultivated Management, an online resource for those new to the challenging world of management. Rob started his career as a Software Testing, then an Engineering Manager and has now moved sideways in to HR.</p> <p>Rob’s mission is to inspire people to achieve great things in their careers and to take control of their own learning and self development.</p> <p>Rob is the author of Remaining Relevant And Employable, a book about remaining relevant and employable in today’s changing employment world.</p> <p>Rob also runs a weekly newsletter called Parent Brain, where he thinks big about the future of parenting.</p> <p>He’s on Twitter at @rob_lambert and Instagram at @simplylambert</p> <p>Rob is an advocate for many important social causes, is obsessed with technology in society and has written a number of books about software delivery, customer excellence and community building. He likes photography and classic cars.</p> <p>He is married with three kids and lives in historic Winchester, UK.</p> <p><b>Sponsorship</b></p> <p>The venue for this meetup has kindly been provided by <b>Pay360 by Capita</b>.</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/8/5/0/b/600_453394059.jpeg\" /></p> ",
    "end_time": 1473800400,
    "link": "https://www.meetup.com/agile-bath-bristol/events/233518694/",
    "location": null,
    "org": "agile",
    "start_time": 1473789600,
    "title": "10 Behaviours Of Effective Employees with Rob Lambert"
}