{
    "description": "<p>Kim Morgan will explore some of the key principles which make coaching more transformational than transactional. These will include:</p> <p>• How transformation occurs and how coaching should be more than just a “cosy chat”</p> <p>• The importance of high emotion and creativity in coaching</p> <p>• Understanding the psychology of motivation – associating everyday behaviours with long-term outcomes</p> <p>• The coach as an “Empathetic Provocateur” and the coach as an instrument of change</p> <p>• Dynamic listening to ignite the mind</p> <p>• Starting with the end in mind and presupposing success</p> <p>There will be lots of opportunity for interaction, questions and to coach and be coached.</p> <p><b>Kim Morgan – Managing Director, Barefoot Coaching Ltd</b></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/b/d/4/f/600_453648463.jpeg\" /></p> <p>Kim Morgan is Managing Director of Barefoot Coaching Ltd, one of the UK’s leading providers of coaching and University Accredited Coach Training. Kim was one of the UK’s first executive business and personal coaches, who has pioneered and led externally certified University Masters Level Postgraduate Awards in Coach Training since 2001.</p> <p>Kim was awarded “Coach of the Year” in 2012 by Coaching at Work Magazine</p> <p>She is a sought after conference speaker on all aspects of coaching and coach education, leadership and leadership development, psychology and change management. With over 25 years’ experience of psychology and people development, across all sectors of public and private business, Kim draws extensively on her experiences of what universally works to make great leaders, successful individuals, successful teams and outstanding organisations.</p> <p>Kim specialises in all aspects of women’s development including: assertiveness, confidence, self-esteem and how to tackle the commonly occurring traits of impostor syndrome, perfectionism and people-pleasing.  Kim works with women throughout all their many life and career transitions.</p> <p>Over the past 25 years she has delivered one to one Executive Coaching to hundreds of senior leaders in national and multi-national organisations across different sectors and industries.</p> <p><b>Qualifications and key achievements</b></p> <p>•  MA in Coaching and Coaching Development</p> <p>•  Author of bestselling coaching book “The Coach’s Casebook – Mastering the Twelve Traits that Trap Us”</p> <p>•  Monthly column in Psychologies Magazine</p> <p>•  Honorary Research Fellow in Coaching at the University of Chester.</p> <p>•  Lifelong Fellowship of the National Council of Psychotherapists for outstanding contributions to the profession.</p> <p>•  Specialist in Grief Recovery Method</p> <p>•  Member of European Mentoring and Coaching Council Keynote Speaker at EMCC 16th Annual Conference Amsterdam</p> <p>•  Member of International Coach Federation, MCC</p> <p>•  Keynote Speaker at the International Coach Federation Conference London 2014</p> ",
    "end_time": 1478642400,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/233735655/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol BS1 6ED ",
        "country": "gb",
        "latitude": 51.45026397705078,
        "longitude": -2.583976984024048,
        "name": "Ovo Energy"
    },
    "org": "agile",
    "start_time": 1478631600,
    "title": "Psychology of Coaching"
}