{
    "cancelled": false,
    "description": "<p><i>We are very happy to welcome not one but two speakers this month, Helen Lisowski and Sal Freudenberg. Both talks feature on the programme for the <a href=\"http://agileinthecity.net/2016/bristol/\">Agile in the City: Bristol</a> conference, being held on the 3rd and 4th Nov.</i></p> <p><b>Helen Lisowski: Listen with your eyes</b></p> <p>Non-verbal communication is sometimes referred to as body language, although it does include more than that. This session is designed to give you a gentle introduction to this field, help you recognise some common behaviours, and show you how to start using this knowledge every day.</p> <p>This session will introduce you to some basic indicators that may:</p> <p>• mean the person you are talking to is feeling uncomfortable or shut down in the conversation</p> <p>• help you understand how confident the person speaking is about what they are saying</p> <p>• help you spot and diffuse an argument</p> <p>• It will not give you a tick list of behaviours that indicate lying or cheating!</p> <p>We will cover a little bit about self-influencing behaviours, and influencing others using your own non-verbal signals (helping an interview candidate feel a little more relaxed, for example).</p> <p>These skills are a starting point for a journey that could keep you engaged for the rest of your life, and enrich your interactions with people both at work and at home.</p> <p>If part of your role includes communication with human beings, you need to know this stuff. What's exciting is just how much you probably already know....this session is about doing it on purpose.</p> <p><b>About Helen</b></p> <p>Helen Lisowski is an agile coach at NewVoiceMedia, where she has helped to transform the agile process. She has been involved in agile for well over a decade, working with organisations ranging from international corporations to startups, and everything in between.</p> <p>Helen has been presenting, running workshops and writing for many years now. She blogs at FluidWorking.com and you can find her on Twitter at @helenlisowski.</p> <p>Helen says her life is filled with questions about why we humans do what we do. Especially, why do we do things that are detrimental to ourselves? When she applies this curiosity and subsequent discoveries to her work with agile teams, she is forever astounded at the positive difference it makes.</p> <p>She has an obsession with afternoon tea, so if you bump into her, say hi and join her for a brew.</p> <p><b>Sal Freudenberg: Neurodiversity and software development</b></p> <p>Even if you are unaware of it, it’s likely that there is (or has been in the past) someone on your team with a non-typical neurology. It even seems there is a higher propensity towards autism and Aspergers in STEM (science, technology, engineering and maths) careers. Turns out that is actually a good thing.</p> <p>We will begin by looking at the research on diversity and success.</p> <p>We will then consider what is known about the autistic/Aspergers mind with a particular view towards how that lends itself to developing software and how we might better support autists at work.</p> <p>What about other forms of neurodiversity? We will look at depression, bipolar disorder and ADHD and consider why you might want such diversity on your team and how you can best support it.</p> <p>This session will interweave facts and evidence with anecdotes from myself and others in the agile space about our lives, and particularly our careers with neurodiversity.</p> <p><b>About Sal</b></p> <p>With more than 25 years' experience in the world of software development, Sal uniquely blends over 10 years of doing, coaching and teaching agile with her research into the psychology of programming. Most recently she has been speaking out to the tech industry on neurodiversity and how to support the different kinds of brains our industry needs.</p> <p>Sal is also known for her well-received research on pair programming, sessions on cultural change, faciliation and building trust in agile teams (with Rachel Davies). She is co-creator (with Karl Scotland) of the Lego Flow Game. She is also a certified scrum trainer.</p> ",
    "end_time": 1476216000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/234573240/",
    "location": {
        "address": "10 Templeback, Bristol, ",
        "city": "BS1 6FL",
        "country": "gb",
        "latitude": 51.45328140258789,
        "longitude": -2.586289882659912,
        "name": "ADP"
    },
    "org": "agile",
    "start_time": 1476208800,
    "title": "Double bill: Helen Lisowski & Sal Freudenberg"
}