{
    "cancelled": false,
    "description": "<p><b>Superpowered Collaboration with Innovation Games</b></p> <p>How do you get a group of people to explore their fears and concerns about the project they are working on? How do you create a collaborative environment where we feel safe to share? How do we explore things that need to be said in a way that generates positive results?</p> <p>Collaboration and Innovation are tough. But when done right, when we are stretched, when we have fun, we can achieve some amazing results. We can turn that dreaded meeting into a something playful. </p> <p>Innovation Games help you get into the sweet spot of collaboration.</p> <p>In this session, JP and Jose will introduce you to one of the many Collaboration Frameworks that are part of Innovation Games and allow groups of people to share their negative experiences in project management in a fun, colourful, collaborative and constructive way.</p> <p>Innovation Games are a set of collaboration frameworks created by Luke Hohmann of Conteneo. They are excellent tools to have in your facilitation toolbox. You can use them for many project activities and to create project artefacts too. During this highly interactive session, we'll take a very high level overview of the games and then play one of them to give you a sense of what is possible. We'll discuss our experiences of using the games in an Agile environment, and cover some of the other common uses.</p> <p><b>Jean-Paul Bayley</b></p> <p>Jean-Paul Bayley is the Lead Consultant of Bay Spark Ltd., a firm specialising in business agility and organisational development. He led the Agile Transformation ​at Kaplan International and oversaw the significant growth of the development team. He​ i​s a committed people person and is passionate about the use of play and games at work. Colleagues say he is a \"competent, good-natured facilitator that efficiently enables cultural change in teams and organisations\". He is a​n organiser​ of the Playcamp​ London​ conference​, an Innovation Games Certified Collaboration Instructor (CCI) and a Certified Trainer for “Training from the BACK of the Room!”.</p> <p>Jean-Paul believes that play improves both our experience of work and the output of our work. He loves the sound of a room buzzing with playful collab​​oration.</p> <p><b>Jose Casal</b></p> <p>Jose Casal is a Business Agility consultant and trainer. He is intensely passionate about modern management methodologies focusing primarily on Lean Kanban, agile and collaboration frameworks. </p> <p>Jose has worked with large private and public sector. He is the Founder and Chair of the BCS Agile Methods Specialist Group and the lead creator of the BCS Agile Foundation Certificate. He is also the chair of the London Lean Kanban Days (LLKD) and ​organises ​Playcamp ​London conferences.</p> <p>As an experienced Coach and Trainer, Jose has a few certifications under his belt​ including Accredited Kanban Trainer (AKT)​ and Innovation Games Certified Collaboration Instructor (CCI).</p> ",
    "end_time": 1486504800,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/236876147/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol BS1 6ED ",
        "country": "gb",
        "latitude": 51.451011657714844,
        "longitude": -2.583268880844116,
        "name": "Ovo Energy"
    },
    "org": "agile",
    "start_time": 1486494000,
    "title": "Superpowered Collaboration with Innovation Games"
}