{
    "description": "<p><b>Evolving Project Management for the Digital Age</b></p> <p>It aint software development any more, its digital.</p> <p>And in the digital age change is fast, those who don't keep up are quickly left behind. Business innovation and technology innovation feed off one another. IT Projects are no longer something that happens on the side: the business is technology and the technology is the business. Traditional project management struggles to keep pace with an accelerating cycle.</p> <p>So project thinking needs to evolve too. And it's more than just Agile, it's digital business, it's cloud, it's DevOps and continuous delivery, dual track, minimally viable teams and much more.</p> <p>In this presentation Allan will set out some of the ways in which project management must evolve if it is to keep pace with the changing nature of business and the technology landscape.”</p> <p><a href=\"https://www.allankellyassociates.co.uk/\">Allan Kelly</a> inspires digital teams to effectively deliver better products through Agile technologies. These approaches shorten lead times, improve predictability, increase value, improve quality and reduce risk. Most of his work is with innovative teams, smaller companies - including scale-ups; he specialises in and product development and engineering. He uses a mix of experiential training and ongoing consulting.</p> <p>He is the originator of Retrospective Dialogue Sheets, Value Poker and Time-Value Profiles. Allan is the author of the perennial essay: \"Dear Customer, the truth about IT\" and several books including: \"Xanpan - team centric Agile Software Development\" and \"Business Patterns for Software Developers\". He is currently completing \"Continuous Digital\" the #NoProjects book. On twitter he is @allankellynet.”</p> <p>About our hosts:<br/><a href=\"https://www.mayden.co.uk/\">Mayden</a> have been kind enough to host us at their office in Bath, and to provide pizza and refreshments.  They specialise in software for the healthcare sector, and are celebrating a milestone 100 sprints!  The company is driven by a mission to provide systems that can support and improve the way services are delivered by staff and experienced by patients.</p> ",
    "end_time": 1505248200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/243010107/",
    "location": {
        "address": "1 Widcombe Crescent",
        "city": "Bath",
        "country": "gb",
        "latitude": 51.374759674072266,
        "longitude": -2.3491220474243164,
        "name": "Mayden"
    },
    "org": "agile",
    "start_time": 1505237400,
    "title": "Evolving Project Management for the Digital Age - with Allan Kelly"
}