{
    "cancelled": false,
    "description": "<p><b>Making Stone Soup (story-telling for collaboration &amp; team building)</b><br/>Productivity is about doing the right work as effectively as possible. The sooner you and your colleagues can all get on to the same page, the sooner you can start work together. The more aligned you are with each other's point of view and your shared objective, the faster you will be able to move towards it.</p> <p>So, is there really a way we can improve these aspects of our working interactions to have a material effect on our productivity? I think so. I think we should look to the roots of humanity.</p> <p>Human beings are hard-wired to appreciate stories. Not just about how our weekend was, but actually woven into the very fabric of what makes us human. These skills are the foundations of influence, of coaching, and of collaborating.</p> <p>Using a familiar childhood story I will illustrate how the same story can be used to teach multiple things, such as how collaboration and facilitation works. We will explore why some stories are better than others.</p> <p>I will also cover how we can use stories to build our teams and our tribes, and how we can use them to talk about ourselves.</p> <p>About Helen<br/><b>Helen Lisowski</b> trains and mentors talented people in the Software Development Industry to build great habits. Using psychology &amp; behavioural science she helps people work to their optimum, at the same time to deliver more value for their organisation. She has been involved in agile for well over a decade from International Corporations to startups, and everything in between. Currently working at NewVoiceMedia Helen has helped transform the agile process from yearly releases to weekly releases. She has been presenting, running workshops and writing for many years now. She blogs at <a href=\"https://fluidworking.com\">FluidWorking.com</a> and you can find her on Twitter at <a href=\"https://twitter.com/helenlisowski\">@helenlisowski</a>. Helen claims her life is filled with variations on the same question about why we humans do what we do. She has an obsession with afternoon tea, so if you ever bump into her, say hi and join her for a brew.</p> <p>About our hosts:<br/><b><a href=\"https://www.adp.co.uk/\">&lt;/a&gt;</b></p> <p>&lt;a href=\"https://www.adp.co.uk/\"&gt;ADP</a> are a comprehensive global provider of cloud-based Human Capital Management (HCM) solutions that unite <a href=\"https://www.adp.com/solutions/services/human-resources-management.aspx\">HR</a>, <a href=\"https://www.adp.com/solutions/services/payroll-services.aspx\">payroll</a>, <a href=\"https://www.adp.com/solutions/services/talent-management.aspx\">talent</a>, <a href=\"https://www.adp.com/solutions/services/time-and-attendance.aspx\">time</a>, <a href=\"https://www.adp.com/solutions/services/tax-and-compliance.aspx\">tax</a> and <a href=\"https://www.adp.com/solutions/services/benefits-administration.aspx\">benefits administration</a>, and a leader in business outsourcing services, analytics and compliance expertise. Our unmatched experience, deep insights, and cutting-edge technology have transformed human resources from a back-office administrative function to a strategic business advantage. Our mission is to provide insightful solutions that drive value and success for our clients. From payroll to global Human Capital Management, ADP cloud solutions assist with the whole employee life cycle, keeping things simple &amp; easy to manage.</p> <p>In their new vibrant modern central Bristol offices, they have software development and delivery teams who work with other teams across ADP to rebuild one of their core platform product to leverage new technology that will create a new customer experience using continuous delivery and DevOps. Find them on twitter <a href=\"https://twitter.com/ADP_UK\">@ADP_UK</a> and <a href=\"https://jobs.adp.com/en-UK/locations/uk/teams-and-roles/technology/\"><a href=\"https://jobs.adp.com/en-UK/locations/uk/teams-and-roles/technology/\" class=\"linkified\">https://jobs.adp.com/en-UK/locations/uk/teams-and-roles/technology/</a></a></p> <p>&lt;a href=\"https://twitter.com/ADP_UK\"&gt;&lt;/a&gt;</p> ",
    "end_time": 1513202400,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/245432936/",
    "location": null,
    "org": "agile",
    "start_time": 1513191600,
    "title": "Story-telling for collaboration & team building - with Helen Lisowski"
}