{
    "cancelled": false,
    "description": "<p>Today, I invite you “to be more coach”.</p> <p>Often when I tell people that I am a coach, they say “ah me too, agile coaching is such a big thing these days”. I then find myself explaining that I am not exactly an agile coach, and so the conversation begins. Hope you enjoy it. This talk is help understand some differences between the types of coach out there and for you to learn and practice some important and transferable coaching skills.</p> <p>Doors open from 18:30, we'll start a 19:00hrs...</p> <p>About <b>Mike Roberts</b> - I have been working in the technology industry for 20 years and have always had a real passion for people and their potential. I have managed large infrastructure teams and smaller development teams for a number of national and international companies. I have been involved with Agile for just over 10 years, implementing organisational changes supporting Scrum and DevOps. For the past 4 years I have been mentoring and coaching talented people and executives in the software development industry. I have my own consultancy called the <a href=\"http://www.theprojecttoolkit.com\">Project Toolkit</a>, and I currently work at <a href=\"http://www.adp.com\">ADP</a> where amongst other activities I create and design workshops to lead an EMEA organisation through complex change.</p> <p>Filling my spare time I have a little family, I write blogs and I play the guitar.</p> <p>About<b> IOP Publishing</b> - IOP Publishing are our kind hosts this evening. They provide a range of journals, ebooks, magazines, websites and services that enable researchers and research organisations to reach the widest possible audience for their research. Find them here <a href=\"http://ioppublishing.org/\" class=\"linkified\">http://ioppublishing.org/</a> and stay tuned on twitter <a href=\"https://twitter.com/ioppublishing?lang=en\">@IOPPublishing</a></p> <p>• Important to know<br/>Please keep your RVSP up to date - if you have a place and decide not to join us, do let someone else take the opportunity.</p> ",
    "end_time": 1520370000,
    "link": "https://www.meetup.com/agile-bath-bristol/events/247954705/",
    "location": null,
    "org": "agile",
    "start_time": 1520361000,
    "title": "\"Be more coach\" - With Mike Roberts"
}