{
    "description": "<p>This month we are excited to present a double bill of talks: as well as a brand new experience report from Alex Banbury, we are repeating the popular recent session from Mike Roberts: \"Be more coach\".</p> <p>This will hopefully allow Bath-based members of the community to enjoy this session, as we are not only back in Bath, but being kindly hosted again by Civica Digital.</p> <p>Alex Banbury:</p> <p>Zero to Sixty, Growing a team to create an application so you can buy a car from your sofa</p> <p>This talk is the story behind how ALD went from hiring our first developer to our initial customer financing a car online in sixty weeks. Starting with the excitement of a blank piece of paper, no fixed route but big dreams about what we were going to do together the trip quickly delivers a twist. The tale covers how our expanding ensemble face continuous challenges, a race against time and accept that if they are to make their destination a few minor repairs might be needed. It ends with the achievement of arrival, reflections on our journey and thoughts on where we might be going next.</p> <p>About Alex Banbury - Alex has been leading development organisations for nearly 20 years, in this time he's run support, test and development teams for startups and multinational corporations. Alex found agile development methodologies by accident through introducing time-boxed iterations to help a solve a customer problem. He's introduced agile working practices to three separate customers learning numerous lessons along the way. Alex joined ALD Automotive in 2016.</p> <p>Mike Roberts:</p> <p>Today, I invite you “to be more coach”.</p> <p>Often when I tell people that I am a coach, they say “ah me too, agile coaching is such a big thing these days”. I then find myself explaining that I am not exactly an agile coach, and so the conversation begins. Hope you enjoy it. This talk is help understand some differences between the types of coach out there and for you to learn and practice some important and transferable coaching skills.</p> <p>About Mike Roberts - Mike has been working in the technology industry for 20 years and has always had a real passion for people and their potential. He has managed large infrastructure teams and smaller development teams for a number of national and international companies. He has been involved with Agile for just over 10 years, implementing organisational changes supporting Scrum and DevOps. For the past 4 years he has been mentoring and coaching talented people and executives in the software development industry. He has his own consultancy called the Project Toolkit (<a href=\"http://www.theprojecttoolkit.com\" class=\"linkified\">http://www.theprojecttoolkit.com</a>), and currently works at ADP (<a href=\"http://www.adp.com\" class=\"linkified\">http://www.adp.com</a>) where amongst other activities he creates and designs workshops to lead an EMEA organisation through complex change.</p> <p>Filling his spare time he has a little family, writes blogs and plays the guitar.</p> <p>About Civica Digital - Civica Digital helps organisations that deliver essential everyday services to rapidly transform their customer experience, improve operational efficiency and enhance performance through deeper business insight and scalable cloud platforms. With capabilities across strategic consultancy, platforms, digital services, analytics and managed services, we are a trusted digital partner to organisations across the public and private sectors, including Nationwide Building Society, FirstGroup, Highways England, the Home Office and many more.</p> <p>Together, we’re transforming services and improving lives.</p> <p>• Important to know<br/>Please keep your RVSP up to date - if you have a place and decide not to join us, do let someone else take the opportunity.</p> ",
    "end_time": 1533067200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/253064481/",
    "location": {
        "address": "BA1 5LR",
        "city": "Bath",
        "country": "gb",
        "latitude": 51.383705139160156,
        "longitude": -2.357667922973633,
        "name": "Civica Digital"
    },
    "org": "agile",
    "start_time": 1533060000,
    "title": "Double bill: Zero to Sixty with Alex Banbury & Be More Coach with Mike Roberts"
}