{
    "cancelled": false,
    "description": "<p>Join us for Beer, Pizza and transformation wisdom with Vikram Jain, hosted by Hargreaves Lansdown in central Bristol.</p> <p>Many organisations embarking on an enterprise-wide transformation to agile working struggle to sustain or scale the benefits they initially achieve. The journey towards agility is a marathon, not a sprint, and it requires continued commitment, at all levels of the organisation, to ensure agile ways of working stick.</p> <p>In this talk, we set out the seven ‘levers’ that you can incorporate early in your agile transformation journey to deliver a steady pace of change and lasting success.</p> <p>Vikram is the founder of JCURV, a consultancy with the sole focus of increasing the agility of the UK. Vikram and the JCURV team work with FTSE 100 organisations, public bodies and charities, from the Board to frontline teams, to help them respond faster and more efficiently to the market. Previously, Vikram worked at Oliver Wyman, Lloyds Banking Group and Gemini consulting.<br/><a href=\"https://www.jcurv.com/\" class=\"linkified\">https://www.jcurv.com/</a></p> <p>Hargreaves Lansdown have over 1,500 people in their Bristol HQ and are continuously trying to evolve their ways of working in order to improve the experience for their 1 million + clients.<br/>They are 2 years into their Agile journey and with 15 Scrum/Kanban teams, they have made significant strides towards developing their Agile capability.<br/><a href=\"https://www.hl.co.uk/\" class=\"linkified\">https://www.hl.co.uk/</a></p> <p>Huge thanks to Richard Gange and Jim Wyllie for helping to make the event happen.</p> <p>Special Note: As you would expect our hosts take security seriously. For this event you must use the RSVP and name your guests by 16:00hrs on the day. After this the guest list cannot change. You also need to bring photo ID to gain entry.</p> ",
    "end_time": 1542142800,
    "link": "https://www.meetup.com/agile-bath-bristol/events/256201483/",
    "location": null,
    "org": "agile",
    "start_time": 1542135600,
    "title": "Enterprise Agile Transformations - Why they’re a marathon not a sprint"
}