{
    "description": "<p>We want to work to our best, and if we have teams, we want them to do the same. The words we use, internally and externally, change how we feel, how we see and interact with the world, and what we get back from it. We may not realise the effect we have with the way we speak to others and ourselves - but, communicating with negativity, even for a few minutes, can damage your brain!</p> <p>As this isn't usually the effect we intend to have, in this workshop we will take a closer look at some of the ways we use language. Skimming the surface of NLP, mindfulness and the latest neuroscientific research, we'll go through some simple exercises you can practice to change the words you use, to improve your outcomes and to propel you towards where you want to be.</p> <p>About our speaker:</p> <p>Delver of neuroscience, neuropsychology, and linguistics; proud possessor of PTSD, crushing social anxiety and extreme research as a distraction device; Diffuser of mumbo-jumbo, claptrap and pseudoscience, Ceri has been encouraging better application of inner and outer language since her days of training Samaritans and teaching university students, having seen the effects personally and professionally.</p> <p>Now working with teams in Bristol, Brighton and Cambridge, and especially after being described by one board director as the \"Mary Poppins of Agile\", Ceri focuses much of her efforts on showing how we can use conscious language to get the best from ourselves and other, create safe spaces to work in and attain outcome-focussed delivery for healthy interactions with happy clients.</p> ",
    "end_time": 1550005200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/258383461/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45039367675781,
        "longitude": -2.583983898162842,
        "name": "OVO Energy"
    },
    "org": "agile",
    "start_time": 1549998000,
    "title": "A spoonful of sugar: harnessing language to achieve your goals with Ceri Newton"
}