{
    "cancelled": false,
    "description": "<p>Join us for pizza and a thought provoking session with Lucy Power, hosted by IOP Publishing in central Bristol. The session is a guide to a coaching theory around relationships, and no prior knowledge is required. The theory is relevant regardless of your role and agile inclinations, especially if you interact with actual people.</p> <p>In this workshop you will learn what Transactional Analysis is and some small but effective key pieces of the theory. Mainly you will learn how to impact your life with this learning, taking your new understanding out into your work, life and relationships and improving them immediately!<br/>We will cover the key principles of the approach, ego states and games, life script and how to become free of all of this limiting, constraining and troublesome stuff which keeps us from showing up as we actually want to in our worlds.</p> <p>Takeaways: The impact will be that you’ll know how to get back in control of yourself when you are stressed, over emotional, overly shut down or dancing around like a headless chicken. You’ll have the understanding of what happens for you and others, and more importantly what happens BETWEEN you and others and how to impact this toward improvement and greater satisfaction.</p> <p>IOP Publishing are our kind hosts this evening. They provide a range of journals, ebooks, magazines, websites and services that enable researchers and research organisations to reach the widest possible audience for their research. Find them here <a href=\"http://ioppublishing.org/\" class=\"linkified\">http://ioppublishing.org/</a> and stay tuned on twitter @IOPPublishing (<a href=\"https://twitter.com/ioppublishing?lang=en\" class=\"linkified\">https://twitter.com/ioppublishing?lang=en</a>)</p> <p>Recognising the importance of brain food, IOP Publishing have been kind enough to provide refreshments for the session.</p> <p>Lucy Power is an ICF Credentialed and very experienced coach who is trained in Transactional Analysis for organisations and for psychotherapy. As an ex Head of Learning and Development for a national organisation, Lucy LOVES teaching people great stuff which could genuinely impact their lives, work and relationships.</p> <p>Lucy has worked with people in contracts for personal change all of her career, starting out as a Social Worker and then training as a Youth Worker, later working as a senior leader at Director and Head level and then more recently as a Coach and a Psychotherapist. Lucy’s skills lie in making complex concepts accessible and impactful and in supporting people toward their chosen life.</p> <p>Lucy offers a creative range of coaching and training to help people move toward happier, more effective and satisfactory lives. This includes an online ‘Transactional Analysis in Ten Weeks’ program and a vibrant online community supported by training and group coaching.</p> <p>Free Facebook page - <a href=\"https://www.facebook.com/LucyPowerCoach/\" class=\"linkified\">https://www.facebook.com/LucyPowerCoach/</a> for daily news and views and weekly live video teaching on TA</p> <p>More about Lucy<br/><a href=\"https://uk.linkedin.com/in/%E2%9C%A8lucy-power%E2%9C%A8-781a4a36\" class=\"linkified\">https://uk.linkedin.com/in/%E2%9C%A8lucy-power%E2%9C%A8-781a4a36</a></p> <p>• Important to know<br/>Please keep your RVSP up to date - if you have a place and decide not to join us, do let someone else take the opportunity. The sooner you can let people know the better, people often need to make arrangements in order to attend.</p> ",
    "end_time": 1553029200,
    "link": "https://www.meetup.com/agile-bath-bristol/events/259036507/",
    "location": null,
    "org": "agile",
    "start_time": 1553022000,
    "title": "Introduction to Transactional Analysis, how it can transform your life and work."
}