{
    "cancelled": false,
    "description": "<p>Join us for Pimms and pizza at our summer Agile Games meet-up, hosted by Gemma Honour and Josh Bruen from the Scrum Master team at Royal Bank of Scotland in Central Bristol.</p> <p>In the first of our Agile Games meet ups we will play the Ball Point Game, share experiences of a range of games and have a chance to chat about all things Agile Games!</p> <p>The bright and bouncing Ball Point game is a popular game used by Agile coaches to introduce Agile values and principles in a way that’s engaging and gets people learning through play.</p> <p>Part 1 – Stay and Play<br/>The first half of the session will be used to give those who wish to try facilitating the game for the first time a friendly space to practice. We also want to give those who haven’t experienced taking part in a ball-point game before the opportunity to learn through taking<br/>part. We will also get a group or two to experiment with adaptations of the game, based on suggestions from the room so long as we have enough attendees and facilitators.</p> <p>Part 2 – Games Show and Tell<br/>The second part of the session, we’d be keen for those experienced in running other Agile games to share their games with the group, and potentially pick a game out of those discussed to use at the next Agile Games meet up.</p> <p>Tell us what you are hoping to get from the meet-up:<br/>When you sign up to this meet up, please let us know in advance if:<br/>a) You’d like to gain experience in facilitating the Ball Point game, and would like volunteer to run it with a small group at this meet up.<br/>b) You have an adaptation of the Ball Point game that you’d like to try out with a group<br/>c) You are an experienced Ball Point game facilitator, who would be willing to be a backup if we don’t have enough ‘learning facilitators’</p> <p>All the balls, flip-charts etc will be provided for the workshop – however you’ll need to come prepared if your adaptation uses alternative equipment or props!</p> <p>Note: RSVPs close at 17:00hrs to enable details to be passed to security. RBS take security seriously and you won't be able to 'drop in' without an RSVP.</p> <p>Gemma is a Scrum Master who has been using games and play to bring about insight and learning with her teams for the last few years. She was inspired to set up an ‘Agile Games Play Space’ when wanting to test out adaptations to games to bring out particular learning points.<br/><a href=\"https://uk.linkedin.com/in/gemma-honour-4b404487\" class=\"linkified\">https://uk.linkedin.com/in/gemma-honour-4b404487</a></p> <p>Josh is a Scrum Master at RBS in the Digital Studio, he’s a Scrum with Kanban enthusiast who likes helping teams visualise their workflow! <a href=\"https://uk.linkedin.com/in/josh-bruen-57731639\" class=\"linkified\">https://uk.linkedin.com/in/josh-bruen-57731639</a></p> <p>Housed in the RBS offices in central Bristol with lovely views over the river, the Digital Studio is fast approaching its two year anniversary. The studio started out with a very small, enthusiastic team and has grown this team with Agile at its core, to the point that they are now over 100 members strong. The studio houses six scrum teams working predominantly on the largest commercial banking platform in the UK.<br/><a href=\"https://jobs.rbs.com/pages/bristol\" class=\"linkified\">https://jobs.rbs.com/pages/bristol</a> , www.rbs.com</p> ",
    "end_time": 1560283200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/262030701/",
    "location": null,
    "org": "agile",
    "start_time": 1560276000,
    "title": "Summer Agile Games"
}