{
    "description": "<p>Ahoy Mateys! After the success of our Summer Agile Games meet-up, head to the high seas for a Nautical Themed Games meet up, hosted by Toby Dykes, Gemma Honour and Josh Bruen.</p> <p>Our headline game will be a deep dive into Kanban principles using the Ship Building Simulation Game, as brought to us by Toby Dykes. This is a game which you can use with your teams to create experiential learning, around the principles of pull, limiting WIP and understanding Little's Law.</p> <p>Part 1 – Ship Building Game<br/>We’ll be taking part in the ship building game, as facilitated by Toby Dykes. We’ll be exploring through play ideas around systems and lean thinking, flow and Kanban.</p> <p>Part 2 – Games Show and Tell<br/>After pizza, we’ll open up a talk about the ship building game - and get some hints and tips from Toby on how to facilitate and how to coach learning out of the games - as well opening up the floor to ideas on adaptations that could be used.</p> <p>We’ll also open up to the audience to either: run a demo of a short demo of a game (or describe it / draw it out) and answer questions about it – or if you want to demo it with the crew, you can also do this too!</p> <p>Gemma (<a href=\"https://uk.linkedin.com/in/gemma-honour-4b404487\" class=\"linkified\">https://uk.linkedin.com/in/gemma-honour-4b404487</a>) and Josh (<a href=\"https://uk.linkedin.com/in/josh-bruen-57731639\" class=\"linkified\">https://uk.linkedin.com/in/josh-bruen-57731639</a>) are Scrum Masters at Royal Bank of Scotland (RBS) who were inspired to bring more learning through games into our teams, and have created a learning / practice group to help others in the Agile community do so.</p> <p>Toby will be our game facilitator, who has 20 years’ experience of working with Agile values and principles across organisations covering pharma; aviation &amp; travel; retailing &amp; telecoms; financial services and construction. Toby is passionate about ensuring teams deliver against measurable objectives which are aligned with organisational objectives by fostering Agile traits such as collaboration, transparency and simplicity.</p> <p>Housed in the RBS / Natwest offices in central Bristol with lovely views over the river, the Digital Studio is fast approaching its two year anniversary. The studio started out with a very small, enthusiastic team and has grown this team with Agile at its core, to the point that they are now over 100 members strong. The studio houses six scrum teams working predominantly on the largest commercial banking platform in the UK. Find out more about opportunities at RBS via their careers site: <a href=\"https://jobs.rbs.com/\" class=\"linkified\">https://jobs.rbs.com/</a></p> <p>Note: We'll start at 19:00hrs, RSVPs close at 17:00hrs to enable details to be passed to security. RBS take security seriously and you won't be able to 'drop in' without an RSVP.</p> <p>When you sign up to this meet up, please let us know in advance if you have a game that can be played in under 15 minutes and would like to demo for the show and tell</p> <p>All the equipment for the Ship Building game will be provided for the workshop – however you’ll need to come prepared if your adaptation or game for demo uses alternative equipment or props!</p> ",
    "end_time": 1569355200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/264686782/",
    "location": {
        "address": "Trinity Quay",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4531135559082,
        "longitude": -2.5836379528045654,
        "name": "Natwest Building"
    },
    "org": "agile",
    "start_time": 1569346200,
    "title": "Nautical Theme Games Meet Up"
}