{
    "cancelled": false,
    "description": "<p>Escape Rooms For Team Building, an Interactive Talk</p> <p>Building a high performing team requires time and dedication, but the process can be greatly accelerated through team building activities. These could be simple, unstructured social events, or activities with a specific aim of helping the team to learn to work better together.</p> <p>Our hosts for this evening are ALD Automotive, Emersons Green, who are kindly providing a room and buffet.</p> <p>Escape rooms are ideal for team building. Escape rooms are a fun, social activity where small teams have to solve puzzles in order to escape from a locked room, usually within an hour. Escape rooms involve a shared team goal, pressure of the one hour deadline, a variety of puzzles that require different skill sets, communication and collaboration, and self-organisation and adaption as new options are uncovered as the game progresses.</p> <p>This talk explores these features using example puzzles from Escape Rooms Cheltenham, for participants to tackle (without being locked in a room).</p> <p>The talk concludes with some suggestions on how to make the escape room experience more than just a fun team time, for example using retrospection, team development tools, such as Belbin Team Roles, and creating your own escape rooms.</p> <p>Presenter Bio<br/>Pete George is currently working with Malvern Panalytical, until very recently he coached DevOps teams with BNP Paribas Fortis, in Brussels. He has 20yrs experience working with Agile delivery teams, predominantly Scrum, and has been a Scrum Master/Agile coach since 2013.</p> <p>In addition to coaching, Pete regularly delivers training in Agile, Scrum and team development through George Team Development Ltd. He also runs Escape Rooms Cheltenham, which provides fun escape room challenges that are optimised for team building.</p> <p>Linked In: <a href=\"https://www.linkedin.com/in/pete-george/\" class=\"linkified\">https://www.linkedin.com/in/pete-george/</a><br/>Twitter: <a href=\"https://twitter.com/George_TeamDev\" class=\"linkified\">https://twitter.com/George_TeamDev</a></p> <p>About ALD<br/>ALD Automotive specialise in long term car leasing and fleet management, providing company cars and a wide range of services.<br/>Web: <a href=\"https://www.aldautomotive.co.uk/\" class=\"linkified\">https://www.aldautomotive.co.uk/</a><br/>LinkedIn: <a href=\"https://www.linkedin.com/company/ald-automotive-uk/\" class=\"linkified\">https://www.linkedin.com/company/ald-automotive-uk/</a><br/>Twitter: <a href=\"https://twitter.com/ALDAutomotiveUK\" class=\"linkified\">https://twitter.com/ALDAutomotiveUK</a> <a href=\"https://twitter.com/hashtag/getfutureready\" class=\"linkified\">https://twitter.com/hashtag/getfutureready</a></p> <p>The address is:-<br/>ALD Automotive, Bristol (Head Office), Oakwood Drive, Emersons Green, Bristol, BS16 7LB</p> <p>It is worth noting that Google Maps does not recognise Oakwood Drive, and as meetup uses the same data the map pin is dodgy. It is best to use the postcode.</p> <p>Bing Maps has the correct location<br/><a href=\"https://www.bing.com/maps?q=ALD+Automotive+%2C+Bristol+%28Head+Office%29%2C+Oakwood+Drive%2C+Emersons+Green%2C+Bristol%2C+BS16+7LB\" class=\"linkified\">https://www.bing.com/maps?q=ALD+Automotive+%2C+Bristol+%28Head+Office%29%2C+Oakwood+Drive%2C+Emersons+Green%2C+Bristol%2C+BS16+7LB</a></p> <p>Directions by car:-<br/>From the M32, exit onto the A4174 towards Hambrook. Follow the A4174 until the Lyde Green roundabout. Take a left turn onto Westerleigh Road and then a right turn at the next roundabout onto Jenner Boulevard. The ALD Office entrance will be on your left after approximately quarter of a mile.</p> <p>There are also a range of bus services, if you're heading out by car and have space, why not offer a lift share?</p> ",
    "end_time": 1573592400,
    "link": "https://www.meetup.com/agile-bath-bristol/events/265507345/",
    "location": {
        "address": "Oakwood Drive",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.50303649902344,
        "longitude": -2.4719109535217285,
        "name": "ALD Automotive, Bristol (Head Office)"
    },
    "org": "agile",
    "start_time": 1573585200,
    "title": "Escape Rooms For Team Building, an Interactive Talk with Pete George"
}