{
    "description": "<p>It’s CHRISTMASSS!!! Or not quite, but it is time for another Agile Games Special! Hosted by Gemma Honour and Ceri Newton-Sargunar.</p> <p>Bristol Location TBC.</p> <p>Gemma is a Scrum Master at the Royal Bank of Scotland (RBS) who set up these events to inspire others to bring more learning through games into teams. She is committed to exploring better ways to get people working and learning together.</p> <p><a href=\"https://www.linkedin.com/in/gemma-honour-4b404487\" class=\"linkified\">https://www.linkedin.com/in/gemma-honour-4b404487</a></p> <p>Ceri is an Agile Behavioural Coach and runs Agile and Behavioural Psychology workshops in house and at events around the UK, helping teams and individuals progress on their Agile Journey.</p> <p><a href=\"https://www.linkedin.com/in/ceri-newton-sargunar-2b81b91a\" class=\"linkified\">https://www.linkedin.com/in/ceri-newton-sargunar-2b81b91a</a></p> <p>---</p> <p>Join us for An Agile Christmas Cracker - the games special this December where we bring you ‘Agile Party games’. This event will feature multiple short and simple games that you can take back to your teams to highlight Agile principles or bring about learning and reflection on how work is done.</p> <p>This session will have more opportunities to try facilitating a game than ever before, and a selection of much shorter games that you can easily learn and take away with you to share with your teams.</p> <p>Of course, as usual we’ll have a selection of drinks and party snacks to keep up the energy, as we form small groups to rotate around different games.</p> <p>Part 1 – Musical Chairs Agile Games</p> <p>Join a group and make your way to a game table, there you will meet your facilitator who will run the game for the first time. Then one of you will stay on to facilitate the next group (with the original facilitator to keep you company, and help you out).</p> <p>We are looking for about x6 10 minute games, so do please get in contact in advance if you have a 10 minute game you’d like to share with the group</p> <p>Part 2 – Games Show and Tell</p> <p>We’ll open up a talk about the various games by chatting to their creators (or finders). We’ll find out more about how they came up with the game, or how they found / adapted the game as well as what they used that game for.</p> <p>We’ll also use this opportunity to find out a bit more about what you’d like us to focus on next for our Spring Agile Games Special Edition!</p> <p>This workshop is run for our community and by our community. All we want for Christmas is you! Yes, we’d love to get new faces sharing their games and their learning, so please do get in touch with Gemma or Ceri if you would like to discuss sharing a game with the group in either this, or a future Agile Games Special.</p> ",
    "end_time": 1575406800,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/266542238/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45039367675781,
        "longitude": -2.583983898162842,
        "name": "OVO Energy"
    },
    "org": "agile",
    "start_time": 1575399600,
    "title": "Agile Games Special - A Christmas Cracker!"
}