{
    "cancelled": false,
    "description": "<p>Join us for a highly interactive workshop on Mob Drawing! A way of embracing diversity of thought and convergent thinking through visualisation techniques. The session is run by Stuart Young and hosted by IOP Publishing in central Bristol, who have been kind enough to provide snacks n' drinks too.</p> <p>How can you create an environment where all members of a team feel safe to be creative? The best ideas come from embracing group diversity, not silo thinking.</p> <p>Stuart will demonstrate how everyone has the ability to visualise their ideas and how you can welcome the judgement, preferences, and beliefs of all individuals within a working group.</p> <p>Expect high levels of audience participation, collaboration and pen action. No ability to draw is required for you to get the most out of this workshop!</p> <p>About the speaker:<br/>Stuart Young (Innovation Practice Lead at Radtac) describes himself as a Business Visualiser, Agile Enthusiast, Design-Thinker and Empathy driven storyteller.</p> <p>When Stuart is not assisting businesses to simplify complexity through live illustration he is facilitating a suite of Design Thinking and Visual Thinking Skills workshops that catalyse customer centric creativity and innovation.</p> <p>You can find out more about the services Stuart offers by viewing Radtac’s Visualisation services and Innovation practice. Stuart will also be facilitating a Visual Thinking Skills workshop here in Bristol on the day of our scheduled Meetup on the 17th of December</p> <p><a href=\"https://www.radtac.com/training/design-innovation/visualisation/visual-thinking-skills/\" class=\"linkified\">https://www.radtac.com/training/design-innovation/visualisation/visual-thinking-skills/</a></p> <p>About IOP Publishing:<br/>IOP Publishing are our kind hosts this evening. They provide a range of journals, ebooks, magazines, websites and services that enable researchers and research organisations to reach the widest possible audience for their research. Find them here <a href=\"http://ioppublishing.org/\" class=\"linkified\">http://ioppublishing.org/</a> and stay tuned on twitter @IOPPublishing (<a href=\"https://twitter.com/ioppublishing?lang=en\" class=\"linkified\">https://twitter.com/ioppublishing?lang=en</a>)</p> ",
    "end_time": 1576616400,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/266586457/",
    "location": {
        "address": "Temple Way",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.450740814208984,
        "longitude": -2.5852301120758057,
        "name": "IOP Publishing"
    },
    "org": "agile",
    "start_time": 1576609200,
    "title": "Mob Drawing Workshop - Stuart Young"
}