{
    "cancelled": false,
    "description": "<p>At this meetup we will take some time to reflect on 2019. You will have the opportunity to draw out key lessons and highlights from the year - particularly the events, skills and other factors that brought you to where you are now. You'll have space to consider your own development in 2020 - not just what you (or your team) do, but who you want to be. This will be informed by discussion on why we do what we do, and the possibilities for growth or professional success that can be realised by a commitment to a clearly articulated purpose - at individual or organisational level.</p> <p>Our hosts will be Just Eat at their central Bristol Office (where you'll also find a number of agile development teams) <a href=\"https://careers.just-eat.com/opportunities\" class=\"linkified\">https://careers.just-eat.com/opportunities</a></p> <p>Paul Hendrie specialises in blending academic research with training metholodogies to design and deliver bespoke courses for specific academic disciplines. He has worked in training and development roles at multinational companies in London and the Middle East, and more recently in academic management at universities in Japan and Bristol.<br/>Paul sees course design and delivery as the ultimate creative artform: the art of positive personal transformation. Outside of his core academic role, he runs occasional training to equip knowledge workers with improved productivity, clearer purpose and deeper professional joy. He is particularly interested in equipping freelancers and small businesses to enjoy greater professional success.</p> <p>Paul leads the Bristol Personal Development Meetup, a series of focused evening workshops <a href=\"https://www.meetup.com/Bristol-Personal-Development/\" class=\"linkified\">https://www.meetup.com/Bristol-Personal-Development/</a> and you can find him overhere; <a href=\"https://www.linkedin.com/in/paul-hendrie-7802421/\" class=\"linkified\">https://www.linkedin.com/in/paul-hendrie-7802421/</a></p> ",
    "end_time": 1579035600,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/267637868/",
    "location": null,
    "org": "agile",
    "start_time": 1579028400,
    "title": "What you (or your team) do, and who you want to be in 2020 with Paul Hendrie"
}