{
    "cancelled": false,
    "description": "<p>How are you coping in your roles with a lockdown in place? Struggling to Scrum Master? Discovering new and unusual ways of keeping the spirit of Agile alive? Got a team going stir crazy? Or is your Product going to Pot?</p> <p>Join your Agile Bristol and Bath Meet Up organisers; Gemma Honour, Stuart Adair, Ewan Milne and John Clapham for a workshop where you’ll be invited to share what’s working for you, what’s not, and what you've uncovered around tools and techniques that are emerging to get us through.</p> <p>Gemma Honour is a Scrum Master with NatWest Group. She uses games and visuals to help teams understand and engage with Agile principles. <a href=\"https://www.linkedin.com/in/gemma-honour-4b404487/\" class=\"linkified\">https://www.linkedin.com/in/gemma-honour-4b404487/</a></p> <p>Stuart Adair is an experienced independent consultant with over 15 years hands on agile experience in both public and private organisations in various roles including recently training and coaching NHS and Public Health England teams. With a deep understanding of people, teams and organisations he uses coaching, games, passion and a little humour to help teams understand and get better with agile. He wishes he could draw as well as Gemma!</p> <p><a href=\"https://www.linkedin.com/in/stuart-adair/\" class=\"linkified\">https://www.linkedin.com/in/stuart-adair/</a></p> <p>We’ll be hosting this event via zoom, for security a zoom link and password will be sent to participants prior to the event starting.</p> <p>---</p> <p>In these unusual times we’re bringing together an unusual workshop to talk about how we are coping and how we are getting on with working in our current situation where most of us are now at best working remotely, and in some cases are looking for work, or are furloughed.</p> <p>As now we are now a month into lockdown, most of us will have experienced issues and maybe have discovered new ways of overcoming them. We’d like to offer the opportunity to get together and share the knowledge across the community. It's also just a really nice chance to connect with some friendly familiar faces!</p> <p>In this workshop we’ll be opening up to find out how you are doing, and then breaking out into some rooms for some specialised topic discussions. We’ll then summarise our findings back into the group so that we are pooling the outcome of these discussions.</p> <p>We’ll be hosting discussion rooms on:</p> <p>- Keeping focus. How to motivate and pace yourself and your teams when working through global crisis</p> <p>- Facilitating collaborative discussion. How to make the stifled online experience more engaging and better set out for group problem solving.</p> <p>- Not in work? What are you doing if you are either furloughed or not in employment? Discussion on how to keep skills up to date or work to transfer offering online.</p> <p>- Agile Games over the internet. Sharing ideas about what you’ve tried, what has worked, and what people should avoid!</p> ",
    "end_time": 1588186800,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/270215641/",
    "location": null,
    "org": "agile",
    "start_time": 1588181400,
    "title": "Online Huddle - Sharing our Learning Workshop"
}