{
    "cancelled": false,
    "description": "<p>To Serve over Not to Serve, is that even a question?</p> <p>How much are scrum masters recognised today, where teams are more disconnected from each other and needs can become discounted? What can we do to serve others, and have our own needs met?</p> <p>Transactional Analysis created by Eric Berne describes the dynamics when we serve others unselfishly, and the effects that this has on people and teams. Serving the organisation, serving the development team, and serving the product owner; what is the outcome of doing this. Find out a bit about TA, authentic emotions, human hungers and needs from John and Nims (Agile Coach and TA Practitioner). How to serve and not to serve, how to avoid online zombie scrum and things you can do to bring balance. This will be an interactive workshop session with some useful actionable takeaways.</p> <p>John is a Coach and Scrum Master; working with teams and organisations to grow connections and agility. He has a software development background discovering agile in 2003/4 via the manifesto, XP which lead to working with teams using kanban, scrum. He has worked with a wide range of organisations, he is principle led, agnostic and appropriate for the context. His passion is working with people, supporting them get to discover what they need in the moment. As he has become more interested in the human condition, he has spent more time looking at earlier work that influences agile and lean thinking.</p> <p>The connections that grow between us, the act of stepping back, reflecting, and taking the time needed for folks to be. The outcomes on co-creation and personal growth when we do this is truly transformative.</p> <p>Nims is an organisational design and development consultant (OD) and executive coach. She works part time at the Ministry of Defence where she works on complex projects in designing teams/functions, developing effective teams and increasing OD capability in the workplace. She is a freelance consultant where she brings in her expertise as a transactional analysis (TA) practitioner and focuses on the psychological aspects of what happens in the organisation. Her focus is on creating psychologically healthy teams.</p> ",
    "end_time": 1597170600,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/272271885/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "agile",
    "start_time": 1597165200,
    "title": "To Serve or Not to Serve"
}