{
    "cancelled": false,
    "description": "<p>Agile coaching isn't about being proficient in agile methodologies, frameworks or even practices and \"helping\" others to adopt them. So who, or what, is an \"agile\" coach? Could an agile coach actually coach individuals, teams or organisations further away from agile and still be doing their job? Leadership coach and agile author Geoff Watts will explore the overlap and differences between the world of professional and agile coaching, sharing his view on this widely interpreted role of the agile coach.</p> <p>To allow more general chatting time the evening will be split into two sections, you can join for the whole or just part, just RSVP as usual.<br/>Part 1 ( 6:00 - 6:45 ) Talk, Q&amp;A<br/>Part 2 ( 7.00 - 7:30 ) Open Spaces - For networking, socialising, lightning talks etc</p> <p>The talk will take the usual format, with time for discussion after. Around 7.00pm we’ll make a number of rooms available for the open space, and you’ll be able to go where you please. Rooms may host pre-selected content, if for example someone would like to host a lightning talk, or lean coffee. As always we’ll be guided by the community and improvise on the night.</p> <p>Our speakers:</p> <p>Geoff Watts<br/>Geoff helps leadership teams create an empowering culture throughout their organisation; one that is resilient to the rapid changes we face in the business world today and harnesses the power of self-organising agile teams.</p> <p>You can learn more about his services here: <a href=\"https://www.inspectandadapt.com/\" class=\"linkified\">https://www.inspectandadapt.com/</a></p> <p>Aislinn Green<br/>Aislinn has worked in an agile coaching capacity since 2005. She works with organisations and teams to help them realise their goals through agility. In this capacity she has helped numerous others to develop and grow their agility coaching capabilities.</p> <p>Aislinn has worked as an agile coach in various industries from finance to pharmaceuticals where she has experienced first hand the many and varying challenges that businesses and teams face. She is a passionate learner and always keen to learn from those around her and from other fields of study.</p> ",
    "end_time": 1615318200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/276273262/",
    "location": null,
    "org": "agile",
    "start_time": 1615312800,
    "title": "Agile coaching isn't about coaching agile, with Geoff Watts and Aislinn Green"
}