{
    "cancelled": false,
    "description": "<p>Zombie Apocalypse! Overwhelm, Conflict, Stress (and hope) for teams facing the end of the world* (full title - Meet Up didn't let me have enough characters for the full one!)</p> <p>In this practical and gently interactive session, we'll walk through the evolutionary, psychological and neuroscientific factors that have made teamwork during a pandemic, so challenging. Neatly sidestepping pseudoscience and Pop Psych, we'll explore what actually happens in our brains and bodies (and why) when we experience extremely challenging events - and how this affects our ability to stop, collaborate and listen. And, without a squeezy ball in sight, we'll look at real steps and activities to help your team(s) to pull through and work together more effectively, when things get tough.</p> <p>Takeaways include:<br/>- How our personality affects our reactions; how this can help your team.<br/>- Communication, conflict and feedback - the immediate and wider impact of workplace drama.<br/>- Tools, activities and practices to help team members work with stress, overwhelm and unhealthy conflict (with or without the added influence of a pandemic.)<br/>- Explanations that help in trying to understand what happens in our brains (it's got nothing to do with lizards).<br/>- How our personality, reactions and emotions impact on teamwork in the office and online, and how to support this.<br/>- Tools to help leaders and coaches identify who might need extra support before it's critical.<br/>- Where our reactions come from, and what extreme emotion is good for.<br/>- How real behavioural change happens.</p> <p>ABOUT THE SPEAKER:</p> <p>Ceri is an Agile Behavioural Coach, an ex-teacher and a neuroscientist-in-training; her current mission is to make the latest scientific research and ideas, accessible and *useful* to agile professionals.</p> <p>She coaches agile coaches and teams, and speaks about behavioural science globally. Powered by research and tea, her favourite pastimes include noticing the spaces between, turning assumptions on their heads, and reading pretty much everything that is offered to her. Ceri also loves brains, but not in *that* way.</p> <p>She mostly hangs out on LinkedIn and can't wait to have a properly nerdy conversation with you there!</p> ",
    "end_time": 1632249000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/280788334/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "agile",
    "start_time": 1632243600,
    "title": "Zombie Apocalypse!*"
}