{
    "cancelled": true,
    "description": "<p>2021 is nearly done, and while we firmly believe in the power of positive thinking there might just be a few little things you’d like to get off your chest, ready for a clean start in January...</p> <p>...and so the ABB team and aspiring punologists bring you...A Christmas Ranto. Share your short stories, your epic wins and terrible defeats, heroes and villains, poisonous apples and awakening kisses.</p> <p>If all that sounds a bit too theatrical, what we’re really looking for is light hearted lightning talks around 5 to 10 minutes. To be honest, they don't even have to be that ranty. It’s a great opportunity to take to the stage for the first time. More seasoned performers may like to try the dreaded PechaKucha.</p> <p>Talks should meet the following criteria:<br/>-Something you’re passionate about<br/>-Something the group will enjoy and might learn from<br/>-Kind and inclusive - You’re welcome to share how you overcame a frustrating tool or process, just don’t rant about a person, company, discriminate or over generalise about a group.</p> <p>If we can figure out how, we’ll vote so you can see how relatable your rant is.</p> <p>After the talk we’ll raise a glass (or mince pie) in honour of the players and enjoy a natter. Duration will depend on the number of talks, and subsequent sociability.</p> <p>So, Let us know if you’ve got a talk, or a gem of an idea, we look forward to hearing from you.</p> <p>By the way, Gemma, Stuart, Ewan and John were hoping this would be an in-person event, and we certainly hope to resume those in the new year. For now though, we’ll play it safe, and hope to see you somewhere soon.</p> <p>Update: We've had a slow response to this one, which is fine, experimentation is a key part of agility :-) We're going to cancel this, wish you a merry Christmas, and hope to see you next year!</p> ",
    "end_time": 1639513800,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/282456439/",
    "location": null,
    "org": "agile",
    "start_time": 1639506600,
    "title": "A Christmas Ranto"
}