{
    "cancelled": false,
    "description": "<p>**Note: This is a rescheduled event, there are two meetup event pages, one for people attending in person (this page) and one for remote attendees. Please choose just one off these. Meetup doesn't support hybrid (as far as we can tell) so we use two event pages to get a better idea of how many people are attending in person.**</p> <p>Solution Focus Coaching is a simple, effective approach to individual, group and team coaching. Despite its name it has little to do with jumping to solutions and solutionising. More of a way of thinking than a process, the emphasis of Solution Focus is deciding what to go towards and the discovery of new, sometimes unexpected, ways to get there.</p> <p>The approach is distinguished from other methods by it’s experimental, forward looking nature, a recognition that every individual, team and organisation is different and resourceful enough to find better ways to do and think. It works as well for getting unstuck in spontaneous coaching moments as it does meticulously planned workshops.</p> <p>In this session we’ll take a look at the tenets of Solution Focus, hear how it works in harmony with agile approaches and get some practical try-it-tomorrow fieldwork. Theory will be mixed with hard earned practical experience working in agile and transformation teams across organisational levels and domains.</p> <p>About John<br/>John Clapham is a leadership coach and agile consultant, specialising in developing organisational agility. He helps leaders to think clearly and organisations learn to become more effective, productive and enjoyable to work in. Recognising that people, teams and organisations are all unique, John is not wedded to any particular agile approach, preferring to focus on foundational behaviours alongside uncovering and amplifying what’s already working. John's forays into coaching, lean and agile are fuelled by coffee and Bristol's frequently inclement weather. <a href=\"https://www.cotelic.co.uk/\" class=\"linkified\">https://www.cotelic.co.uk/</a></p> <p>About our hosts<br/>Ovo Energy and Kaluza are building a supportive zero carbon community – and bringing everyone the green energy, technology and guidance they need to make change happen. And, to lead by example, we’re committed to becoming a net zero carbon business by 2030. For more see [<a href=\"https://www.ovoenergy.com/\" class=\"linkified\">https://www.ovoenergy.com/</a> ](<a href=\"https://www.ovoenergy.com/\" class=\"linkified\">https://www.ovoenergy.com/</a> )and [<a href=\"https://www.kaluza.com/](https://www.kaluza.com/\" class=\"linkified\">https://www.kaluza.com/](https://www.kaluza.com/</a>)</p> ",
    "end_time": 1647376200,
    "link": "https://www.meetup.com/agile-bath-bristol/events/284442486/",
    "location": null,
    "org": "agile",
    "start_time": 1647369000,
    "title": "Get where you want to go, an introduction to Solution Focus Coaching (In person)"
}