{
    "cancelled": false,
    "description": "<p>We are delighted to renew our association this month with the ACCU Conference (conference.accu.org), which is taking place at the Bristol Marriott Hotel City Centre, 5-9 April.</p> <p>Our speaker is Seb Rose: consultant, coach, trainer, analyst, and developer for over 40 years.</p> <p>**Living documentation - the pot of gold at the end of the BDD rainbow**</p> <p>Living Documentation is documentation that automatically notifies the team when it's out-of-date or incorrect. And it comes for free when you follow a Behaviour-Driven Development (BDD) approach.</p> <p>If there is one thing that the agile community has learned over the past twenty years, it's that user stories on their own are insufficient to specify, document, and validate a product. BDD is a non-dogmatic approach that brings the business and delivery teams closer together by adopting three core practices: Discovery, Formulation, Automation. We will look at each of these practices and see how they each have a part to play: collaborative working to dispel misunderstandings (Discovery), specify product behaviour in business-readable language (Formulation), guide product development and automatically ensure that the delivered product behaves as specified (Automation). Together, these practices build on existing agile methods to support rapid feedback, reduced rework, joyful teams, and satisfied customers.</p> <p>In this session we'll explore what BDD is (and what it's not), how to incorporate BDD into your agile process (and what challenges you might face), and why every team should aspire to having Living Documentation (and what the costs are of not having Living Documentation).</p> <p>Disclaimer - no pixies, faeries, elves, or unicorns were used in the making of this presentation.</p> <p>**About our speaker:**</p> <p>Seb has been a consultant, coach, designer, analyst and developer for over 40 years. He has been involved in the full development lifecycle with experience that ranges from architecture to support, from BASIC to Ruby.<br/>During his career, he has worked for companies large (e.g. IBM, Amazon) and small, and has extensive experience of failed projects. He's now Developer Advocate with SmartBear Advantage, promoting better ways of working to the software development community.</p> <p>Regular speaker at conferences and occasional contributor to software journals. Co-author of the BDD Books series \"Discovery” and \"Formulation\" (Leanpub), lead author of “The Cucumber for Java Book” (Pragmatic Programmers), and contributing author to “97 Things Every Programmer Should Know” (O’Reilly).</p> <p>He blogs at cucumber.io/blog and tweets as @sebrose.</p> ",
    "end_time": 1649187000,
    "link": "https://www.meetup.com/agile-bath-bristol/events/284887394/",
    "location": {
        "address": "2 Lower Castle Street, Old Market, ",
        "city": "Bristol BS1 3AD",
        "country": "gb",
        "latitude": 51.45596694946289,
        "longitude": -2.5847840309143066,
        "name": "Bristol Marriott Hotel City Centre "
    },
    "org": "agile",
    "start_time": 1649181600,
    "title": "Seb Rose: Living documentation - the pot  of gold at the end of the BDD rainbow"
}