{
    "cancelled": false,
    "description": "<p>Systems Thinking and Coaching<br/> <br/>As Change Agents, we are employed to help others adapt to their changing environment so that they can thrive in their context. So why then, is there so much resistance change?<br/> <br/>“It is rare that we are asked to do the thing that really needs doing” – AWA Coach.<br/> <br/>If the leaders knew what needed to be done, they would not need us. It is the very things that are not said that lock the status quo. It is uncovering the elephants in the room in a way that empowers everyone to move forwards that enables change. Having courage and safety is the foundation of the journey, and having the vocabulary and skills needed to have the conversation is the visible house of success.<br/> <br/>In this talk, Simon Powers shares some of the tools he uses in AWA’s new Systems Coaching Course that is running this Summer. These tools will help you to have workshops to uncover the real problems that need solving.<br/> <br/> <br/>About the Speaker - Simon Powers<br/> <br/>Simon is the Founder and CEO of AWA. Simon has over 20 years’ experience helping large organisations thrive in the market and be better places to work. He works with the board of directors or senior managers to transform the way that they see themselves, each other, and their organisations. The results are better organisational design, better processes, more engaged staff, and an organisation that is customer focused and more successful.<br/> <br/>Simon is a qualified trainer focusing on Enterprise Agile Coaching, Systems Coaching, Innovation and Leadership.<br/> <br/>Simon and AWA has won multiple awards including Best Agile Conference Speaker and Person who has done the most to promote agility globally.</p> ",
    "end_time": 1652812200,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/285672077/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "agile",
    "start_time": 1652806800,
    "title": "Systems Thinking & Coaching - Simon Powers"
}