{
    "cancelled": false,
    "description": "<p>Most of us in our careers whether long or short, have experienced agile in a software or IT environment, but how many though have used agile elsewhere in a business.<br/>Well agile is growing in many new areas, HR, marketing, procurement and others as organisation's discover the benefits many of us have seen in tech.</p> <p>So if you've ever thought how could this work, where would I start you're in the right place.<br/>We have 3 speakers from across Europe who want to share their real work experiences and show you the art of the possible.</p> <p>Eoin Cannon (Bio at the bottom) will discuss Applying Agile to solve high stakes, long term commercial challenges</p> <p>Agile is not just for software development. It can be applied to broader business challenges as well. It’s designed for working in unpredictable environments and tackling complex problems –well beyond technology businesses or functions.</p> <p>A leading European consumer goods company was facing a ‘wicked’ problem - develop a new future, long-term packaging strategy that is sustainable both environmentally and commercially?</p> <p>Hear about how we used Design thinking techniques with a large multi-disciplinary team to tackle this problem across 2 sprints. Come and understand about how we approached this, the obstacles we encountered and what we learned. See how Agile works in non-tech environments and how it can applied in a variety of environments.</p> <p>Luisa Colombo introduces Agile - a way to make your HR function relevant<br/>HR is often described as a support function, which is unfortunately far from the business and the employees, struggling to generate value at the right time, whose main concerns are related to rules and constraints.<br/>That was the challenge of a fast-growing international SME, located in 6 different sites, where the HR/People department was more and more dealing with BAU admin issues, loosing the opportunity to shape the role in more impactful way.<br/>A REX on how Agile can help in revamping the HR role, improving communication across the company and focusing on what is most important. Come and see how we experimented new ways of working, the difficulties we faced and what we learned</p> <p>Julie Fehr takes us through a reflection on the journey she and her team embarked on in embracing and embedding agile ways of working to deliver our project ‘social value in the supply chain’.</p> <p>Bio's....<br/>Eoin Cannon<br/>Eoin helps organisations and people learn how to navigate complex business environments. His focus is on supporting companies to become more adaptive, customer centred and collaborative.</p> <p>Before becoming an Agile coach and Scrum Master, Eoin worked at with large multinationals as a consumer marketing executive, building teams globally with large FMCG multinational businesses. Frustrated with the lack speed and human centred design on many projects, he embraced Agile as a more effective way of working and progressing projects.</p> <p>His work includes leading large commercial, HR and organisational change projects, developing organisational agility and coaching individuals and teams for companies across various industries – from pharmaceuticals to the not-for-profit sector.</p> <p>Eoin holds an honours degree in history from Trinity College, an MBA from Lancaster University and is a qualified Scrum Master, IC Agile Coach, Business coach and expert facilitator.</p> <p>Luisa Clombo<br/>“The whole is greater than the sum of its part.”</p> <p>This has always been for Luisa what teamwork is and how business success is determined by collective results.<br/>Luisa believes in PEOPLE and teams having such a great potential inside, and yet it is not always straightforward to let it flourish, profit from this and create a better future.<br/>With a solid background in economics, Luisa has more than 15 years experience working within organizations, mainly in HR functions. She has coached leaders and teams to unlock their potential, learn new skills and find innovative ways to boost their performance.<br/>She combine her background in human resources and organizational development, with Agile practices, contributing to the transformation of HR functions into a People Care Experience and she helps leaders to co-design and co-create the company they want to be, where talented people are happy to stay and develop.</p> <p>Julie Fehr<br/>Julie is Head of Procurement and Commercial - IT &amp; Telco at SSE. Over 20 years’ experience in procurement. She's worked in both IT &amp; Utilities industries.</p> <p>Prior to joining SSE in IT Procurement almost seven years ago, she worked at IBM for 19 years mainly in the Procurement team specialising in Software &amp; IT services.</p> <p>Julie is finding new ways how agile can help the businesses she works in.</p> ",
    "end_time": 1657650600,
    "link": "https://www.meetup.com/agile-bath-bristol/events/287044743/",
    "location": null,
    "org": "agile",
    "start_time": 1657645200,
    "title": "Agile Anywhere - Can you do it...Yes you can !"
}