{
    "cancelled": false,
    "description": "<p>**Lessons from Alice**<br/>'Yes, that's it,' said the Hatter with a sigh: 'it's always tea-time, and we've no time to wash the things between whiles.'</p> <p>The Mad Hatter obviously worked in software development. Time and time again we know what we should do but we don't do it. To live in the Mad Hatters' world we need to organise ourselves for the here and now.<br/>Lewis Caroll achieved worldwide fame with his Alice books. Charles Dodgson, was also a mathematician with serious maths books to his name. \\*Alice in Wonderland\\* is reputedly full of mathematical references, so what lessons might Alice have for software engineers?</p> <p>‘Would you tell me, please, which way I ought to go from here?'<br/>'That depends a good deal on where you want to get to,' said the Cat.<br/>'I don’t much care where—' said Alice.<br/>'Then it doesn’t matter which way you go,' said the Cat.<br/>'so long as I get somewhere,' Alice added<br/>'Oh, you’re sure to do that,' said the Cat, 'if you only walk long enough.'</p> <p>**About Allan**<br/>Allan Kelly advises and mentor managers and teams in using agile approaches and OKRs to accelerate delivery teams, meet deadlines, and execute against strategy. He believes these approaches benefit businesses and create more fulfilling work environments.</p> <p>Allan is a keynote conference speaker and author of several books including \"Succeeding with OKRs in Agile\", \"The Art of Agile Product Ownership\" and \"Business Patterns for Software Developers\". He blogs at [allankelly.net](<a href=\"http://allankelly.net/\" class=\"linkified\">http://allankelly.net/</a>) and can be contacted there or on Linkedin, [<a href=\"https://www.linkedin.com/in/allankellynet/](https://www.linkedin.com/in/allankellynet/\" class=\"linkified\">https://www.linkedin.com/in/allankellynet/](https://www.linkedin.com/in/allankellynet/</a>)</p> ",
    "end_time": 1665516600,
    "link": "https://www.meetup.com/agile-bath-bristol/events/288750259/",
    "location": null,
    "org": "agile",
    "start_time": 1665509400,
    "title": "Lessons from Alice"
}