{
    "cancelled": false,
    "description": "<p>Ever seen a TED Talk and thought \"*I wonder if?*\"<br/>Ever watched a lightning talk and been hit by inspiration but no where to strike?<br/>Ever wanted to share a thought, opinion, advice or insight but need someone to help you put pen to paper?</p> <p>Here is your opportunity; Agile Bath &amp; Bristol present an evening of \"**Test your Talks**\" on Weds March 20th at Huboo.</p> <p>\"**Test your Talks**\", like lightning talks, but less stress and more of a supportive community to help you find your voice and present your idea(s) in a ten to fifteen minute slot.</p> <p>You can talk about anything, yes, anything that is in your comfort zone, even the Pedestrianization of Norwich City Centre, because stepping up and presenting is tough enough!</p> <p>You will have a fully supportive and welcoming audience who are there to help you succeed, and advice and guidance beforehand if required.</p> <p>So, find your voice and **Test your Talks** with us... contact us directly if you have something to say!</p> <p>So, we currently have an hour, including handover &amp; questions, so this will work and @⁨Ash (Mohd Ashraf Shaik)⁩ that excludes yours, so we have capacity if you manage to get it done!</p> <p>AGENDA:<br/>1. Dan⁩: \"Visual Communication\" (15mins)</p> <p>2. Rebecca: \"Facing Her Fears: Reluctant Public Speaker Finally Eats Her Frog\" (6'40\")</p> <p>3. Tim⁩ \"Iterative Development and the Greatest Rocket of All Time\" (4mins)</p> <p>4. Chris Hughes⁩ \"Everything Works, sorta\" (15mins)</p> <p>5. Feathers McGraw: \"Monopoly's Free Parking rule is bad for your agility (and other lessons I learnt playing board games)\" (12 mins)</p> <p>6. Laurence: \"4d week (Thurs off)\" &amp; \"Always be Slicing; how ABS can keep you on the road\" (15mins)</p> <p>**Sponsor &amp; Location**</p> <p>Located in a fantastic central Bristol venue, we thank Huboo for this event (41 Corn Street Bristol)</p> ",
    "end_time": 1710966600,
    "link": "https://www.meetup.com/agile-bath-bristol/events/299353971/",
    "location": {
        "address": "41 Corn Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454383850097656,
        "longitude": -2.594731092453003,
        "name": "Huboo Fulfilment"
    },
    "org": "agile",
    "start_time": 1710959400,
    "title": "\"Test your Talks\""
}