{
    "cancelled": false,
    "description": "<p>**Innovate with Impact: The RapidWorks Toolkit**</p> <p>Calling all innovators, change-makers and problem solvers! Join us for an interactive workshop that will revolutionise your approach to corporate innovation and problem solving!</p> <p>In this taster session, you will discover the absolute cornerstone of build, measure, learn - the art of assumption mapping! Validate your learning with a laser sharp focus and avoid waste at all cost!</p> <p>Learn how to bring customer problems to life, measure the impact of your solutions, and leverage rapid experimentation to continuously learn and iterate.</p> <p>Learn - Build - Measure - Rinse and Repeat</p> <p>Whether you are an experienced innovator, seasoned changemaker or starting out, we will give you the confidence to navigate uncertainty with high impact and minimal waste in order to drive meaningful change in your organisation.</p> <p>Get ready to roll up your sleeves, get scrappy and immerse yourselves into the world of RapidWorks.</p> <p>**About the Speakers:**</p> <p>Dan &amp; Nicky co-created the RapidWorks framework in partnership with Eric Ries’ Lean Start Up Co. It lays out the process, governance and financial rigour to underpin best practice in innovation – the creation of value through something new. They have delivered RapidWorks bootcamps for BT Group, EY, University of Cambridge, De Beers Group, Lloyd’s of London and the Government Digital Sustainability Alliance.</p> <p>**About the Sponsors:**</p> <p>This meet-up is proudly brought to you by Huboo! We'll be hosted in their gorgeous offices which can be found on Corn Street, and we'll be fed pizza and drinks by their very welcoming team!</p> <p>**Timings**:</p> <p>* Doors open: 18:15hrs<br/>* Workshop Start: 18:45hrs<br/>* Workshop Finish: 20:30hrs<br/>* Exit building: 20:40hrs<br/>* Debrief (aka Pub): 21:00hrs</p> ",
    "end_time": 1713900600,
    "link": "https://www.meetup.com/agile-bath-bristol/events/300150711/",
    "location": {
        "address": "41 Corn Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454383850097656,
        "longitude": -2.594731092453003,
        "name": "Huboo Fulfilment"
    },
    "org": "agile",
    "start_time": 1713891600,
    "title": "Innovate with Impact: The RapidWorks Toolkit - with Nicky and Dan"
}