{
    "cancelled": true,
    "description": "<p>This month, we've got a really valuable workshop that is a hot topic in the agile community right now, brought to you by Duncan Evans. This is not one to be missed!</p> <p>6:30 - Pizza, networking, and good conversation<br/>7:00 - Grow Your Career with Value Ecocycles workshop<br/>8:30 - Wrap up and networking game<br/>9:00 - Carriages home-/pub-wards</p> <p>**About the workshop..**<br/>The agile delivery industry is in the midst of a value crisis... As budgets are cut and certainty is low, we're seeing huge pressure to demonstrate value in our work.</p> <p>This workshop brings two ideas together.<br/>1\\. Treat work assignments as if you were going to present a case study for your next job interview\\. Even if you have no plans to move\\, what would you do differently now if you wanted to be able to demonstrate value later?<br/>2\\. Learn the Ecocycle liberating structure\\, as taught in our Scrum\\.org Professional Agile Leadership class\\. Look at the value you currently bring\\, and find opportunities to support others to learn your skills\\, freeing you up to grow\\.</p> <p>**Part One: Creating Value**<br/>The first part of this workshop will be about identifying and articulating the value that people provide in their professional environment. If you're a delivery practitioner in roles such as Scrum Master, Delivery Lead or Agile Coach; you might think about the organisational capabilities you develop. Product practitioners might look at ways they identify and capitalise on opportunities. Engineering specialists might look at the ways they create and maintain value.</p> <p>We'll run a round of 1 - 2 - 4 - all on this topic. Attendees will take a minute to think about forms of value they create. They'll then pair up and compare notes finding common themes, before joining pairs into fours to agree a selection of key ideas to share with all. These will be mapped onto flip charts to help create a visual representation of the diverse ways in which modern delivery professionals can add value.</p> <p>**Part two: Growing Value**<br/>The Ecocycle planning liberating structure has been used with great success in the Scrum.org Professional Agile Leadership class that we are licensed to teach. We'll bring printouts of this exercise allowing participants to do this exercise, and then collaborate with each other to find opportunities to grow professionally.</p> <p>First, participants map out all of their routine activities onto a figure-of-eight lifecycle chart - similar to the one here in this reference: [<a href=\"https://www.liberatingstructures.com/31-ecocycle-planning/](https://www.liberatingstructures.com/31-ecocycle-planning/\" class=\"linkified\">https://www.liberatingstructures.com/31-ecocycle-planning/](https://www.liberatingstructures.com/31-ecocycle-planning/</a>) Most people will find that they have many activities in \"maturity\" - they can add value with little or no effort; as well as some activities in \"gestation\" - new ways they could be adding higher levels of value, that require significant time and investment.</p> <p>Next, we'll highlight the potential issues of maintaining the status quo. Mature activities could stagnate and become stale; gestation activities could become lost opportunities. So, we'll ask participants to help each other in finding ways to move round the ecocycle. Supporting and mentoring colleagues to take on mature activities, freeing up time to invest in gestation activities.</p> ",
    "end_time": 1715803200,
    "link": "https://www.meetup.com/agile-bath-bristol/events/300799107/",
    "location": null,
    "org": "agile",
    "start_time": 1715794200,
    "title": "Grow your career with Value Ecocycles"
}