{
    "cancelled": false,
    "description": "<p>Roman Pichler will be discussing all things around product ownership in this meetup, including some time for a Q&amp;A session as part of this event.</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/7/5/e/6/event_129270182.jpeg\" /></p> <p><b>Who is Roman Pichler?</b></p> <p>Roman is a leading agile and lean product management expert, a Certified Scrum Trainer, and the founder of Pichler Consulting. He helps his clients create great products by providing bespoke consulting, coaching and training services. Roman is the author of four books on Agile and Scrum including Agile Product Management with Scrum.<br/>Roman’s involvement with Agile started in 1999. He coached his first agile project in 2001 and began working with Scrum in 2004. Roman started his career as a programmer working for a web startup. He then worked as a developer, software architect, consultant, project manager, ScrumMaster, product owner, and development manager for large enterprises before starting his own business in 2006.</p> <p>Roman has more than ten years experience in helping companies transition to Agile. This includes rolling-out Scrum in several companies, and teaching and coaching executives, product managers, product owners, development managers, project mangers, and teams. He is the founder of the London Scrum User Group, an active contributor to the Scrum Alliance and the London product management community, and a regular speaker at international conferences. Roman was named one of the 20 most influential agile people in April 2012.</p> <p>When Roman is not busy working, he enjoys spending time with his wife and two children, rides his mountain bike in the local hills or goes rock climbing. He is based near London in Wendover, Buckinghamshire, United Kingdom. Roman speaks English and German fluently.</p> ",
    "end_time": 1349730000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/65972222/",
    "location": {
        "address": "Woodlands Lane, Bradley Stoke Bristol BS32 4JF",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.545597076416016,
        "longitude": -2.5615479946136475,
        "name": "Hilton Bristol hotel"
    },
    "org": "agile",
    "start_time": 1349719200,
    "title": "Roman Pichler explains Product Ownership"
}