{
    "cancelled": false,
    "description": "<p>When you come to a meetup like this, you pick up new ideas that you'd like to try when you get back to work. However, you may feel like you hit a brick wall when it comes persuading your team to try the idea out. Resistance is very common in organisations large and small. As an agile coach, Rachel has learned that forcing adoption of new practice results in minimal compliance. Teams who don't want to be try the new approach often fall back to old ways of doing things. Come to get some tips for getting to the heart of resistance and how to dissolve barriers to adopting new working practices. We'll also do some practical exercises in Force-Field Analysis to generate ideas that get your team moving in the right direction.</p> <p> </p> <p><b>Who is Rachel Davies?</b></p> <p><a href=\"http://photos3.meetupstatic.com/photos/event/4/f/a/8/event_123800392.jpegRachel\" class=\"linkified\">http://photos3.meetupstatic.com/photos/event/4/f/a/8/event_123800392.jpegRachel</a> is co-author of the first “Agile Coaching” book and the UK’s leading expert in coaching agile teams. She is internationally recognized and presents at industry conferences worldwide. Rachel has over 20 years experience in software development in a variety of roles from software developer to manager. She has worked as an agile practitioner since 2000 and utilizes a range of agile methods including XP, SCRUM, Lean/Kanban, and DSDM. She has extensive experience facilitating retrospectives and user story workshops.</p> <p>You can <a href=\"http://twitter.com/rachelcdavies\">follow Rachel on Twitter</a> and <a href=\"http://agilecoach.typepad.com/\">read her blog here</a></p> ",
    "end_time": 1352844000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/65972282/",
    "location": {
        "address": "BA1 5LR",
        "city": "Bath",
        "country": "gb",
        "latitude": 51.383705139160156,
        "longitude": -2.357667922973633,
        "name": "IPL Offices"
    },
    "org": "agile",
    "start_time": 1352833200,
    "title": "Rachel Davies talks about Coaching Teams Through Change"
}