{
    "cancelled": false,
    "description": "<p>Large-scale software and systems development involves a complex mix of people, teams, technologies, skills, architectures, and organisational structures that must all interact for projects to reach their goals. However, many organisations struggle to scale up agile approaches for their various programs, products, and services. Karl Scotland introduces a process model for designing a contextually appropriate Kanban system for complex and large-scale development. Karl will show you how to design a custom Kanban system by studying the current development process, reaching an initial system understanding, sharing that understanding, putting limits in place, sensing how the system is performing, and continually learning from the system to guide improvements.</p> <p><b>Who is Karl Scotland?</b></p> <p><a href=\"http://photos4.meetupstatic.com/photos/event/4/f/8/event_125101272.jpegKarl\" class=\"linkified\">http://photos4.meetupstatic.com/photos/event/4/f/8/event_125101272.jpegKarl</a> is a versatile software practitioner with over 15 years of experience covering development, project management, team leadership, coaching and training. For the last 10 years he has been successfully applying Agile methods, and most recently has been a pioneer and advocate of using Kanban Systems for software development.</p> <p>Currently an Agile Coach with Rally Software in the UK, Karl is a founding member of the Lean Software and Systems Consortium and the Limited WIP Society, and has previously championed Agile and Lean Thinking with the BBC, Yahoo! and EMC Consulting. Karl writes about his latest ideas on his <a href=\"http://availagility.co.uk/\">blog</a>, and you can also <a href=\"http://twitter.com/kjscotland\">follow him on Twitter</a>.</p> <p> </p> ",
    "end_time": 1344978000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/65971922/",
    "location": {
        "address": "Prudential Buildings, 11-19 Wine St., Bristol",
        "city": "BS1 2PH",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5922799110412598,
        "name": "Nokia Bristol"
    },
    "org": "agile",
    "start_time": 1344967200,
    "title": "Karl Scotland explains Kanban System Design"
}