{
    "cancelled": false,
    "description": "<p><b>From the presenter...</b></p> <p>\"I feel old. It turns out that it has been 10 years since I started thinking about pair programming.\"</p> <p>\"Come and explore some of the facts and myths around pairing in an interactive way. Do crosswords. Draw pictures. See how different modes of pairing feel. Leave with a deeper understanding of pair programming based on my PhD studies of experienced commercial pairs and the literature on cognitive psychology. Arm yourself with a set of behaviours to help you pair more effectively in the future.\"</p> <p><b>About the presenter...</b></p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/5/9/0/8/event_282442792.jpeg\" /></p> <p>Dr. Sallyann Freudenberg is an agile coach and mentor experienced in working with both experienced agile teams and those new to an agile approach. Her 25-years in IT has included roles in development, design, analysis, UI and Project Management on projects as diverse as industrial real-time process control systems and banking CRM. During the past 10 years Sallyann has been focused entirely in the agile and lean space, providing a blend of training, mentoring, research and coaching across Europe that focuses on creating successful and sustainable agile organisations.</p> <p>Sallyann provides a variety of standardized and tailored training sessions alongside ‘on the ground’ agile coaching and mentoring. She is particularly focused on collaboration and agile as a ‘cultural change’ and as such often assists with strategic change management. Her facilitation skills are particularly honed and as such she is often called upon to facilitate difficult meetings. She is passionate about maximizing the learning outcomes from any situation.</p> <p>Sal also holds a PhD in Collaborative Software Development for which she spent<br/>three years observing and analyzing experienced, commercial agile teams. She speaks and delivers workshops at conferences worldwide, including the Agile and XP conferences.</p> <p>Outside of work, Sallyann enjoys running and kickboxing. She is the mother of three young boys, which allows her to indulge her love of Lego but somewhat curtails her love of scuba diving. A one-time PADI instructor, she has logged several hundred dives in many of the world’s top sites. At the moment she is eagerly awaiting her eldest son’s eighth birthday, so that he can learn to dive and give her an excuse to do so with more regularity.</p> <p>Sal loves to travel. Most recently she took advantage of extended maternity leave to take her family on a six-month trip of Thailand, Singapore, Australia, New Zealand and Hong Kong.</p> <p>You can follow Sallyann on <a href=\"http://twitter.com/SalFreudenberg\">Twitter</a> here.</p> ",
    "end_time": 1384293600,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/95055012/",
    "location": null,
    "org": "agile",
    "start_time": 1384282800,
    "title": "“10 Years Of Thinking About Pair Programming” with Sallyann Freudenberg"
}