{
    "cancelled": false,
    "description": "<p>\"Us and Them\" culture is deeply engrained in our organisations and can easily derail our efforts to become Agile by hindering cross functional collaboration. If we are to deliver software effectively we must find ways that change the mindset from one of blame to one where fellowship is the norm. This practical workshop explores ways to initiate this mindset shift. We'll learn how to lay the foundations by building mutual respect with listening and empathy and progress to understanding each others needs and collaborating with ease.</p> <p> </p> <p>Tom will be running this workshop at the Paris Scrum Gathering later in September, so this is a great opportunity to get a preview.<img src=\"http://photos1.meetupstatic.com/photos/event/4/b/1/6/event_234139222.jpeg\" /></p> <p> </p> <p><a href=\"http://photos4.meetupstatic.com/photos/event/e/0/e/e/event_239037582.jpegAfter\" class=\"linkified\">http://photos4.meetupstatic.com/photos/event/e/0/e/e/event_239037582.jpegAfter</a> sailing the worlds oceans and dealing with the Mad Men of Madison Avenue, Tom settled down and joined a small <a href=\"http://www.biomni.com/\">software house</a> in London. 12 years later he's still there, having blogged all about his journey from frustration to  agility on his blog <a href=\"http://diaryofascrummaster.wordpress.com/\">Diary of a Scrummaster</a> and on <a href=\"https://twitter.com/diaryofscrum\">twitter</a>. Tom has recently discovered the answer to the worlds problems and plans to fix them with a 2-day training course and a soon to be released book <a href=\"https://leanpub.com/programmersguidetopeople\">The Programmers Guide to People</a>.</p> ",
    "end_time": 1378846800,
    "link": "https://www.meetup.com/agile-bath-bristol/events/95054962/",
    "location": {
        "address": "Prudential Buildings, 11-19 Wine St., Bristol",
        "city": "BS1 2PH",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5922799110412598,
        "name": "Nokia Bristol"
    },
    "org": "agile",
    "start_time": 1378836000,
    "title": "\"Us and Them\" Workshop with Tom Howlett"
}