{
    "cancelled": false,
    "description": "<p>Cultural Diversity can sometimes be seen as a negative, but it has the power to take teams and projects to places never thought possible.  This hands-on workshop will allow you to explore Culture Diversity, working through the benefits and hindrances it can bring to a project.  Cultural Diversity occurs in all teams, not just those spread across the world.  You will investigate how to unlock the diversity within your teams and leave with practical ideas to facilitate a similar session with your own teams after the workshop.</p> <p> </p> <p><a href=\"http://photos3.meetupstatic.com/photos/event/8/e/0/0/event_223656352.jpegGlenn\" class=\"linkified\">http://photos3.meetupstatic.com/photos/event/8/e/0/0/event_223656352.jpegGlenn</a> is a techie at heart, cutting his teeth writing embedded software for Motorola on their GSM mobile phone network gear. He moved on to running a team that spanned the UK and China as a Software Development Manager.  Later Glenn led the successful change program to rollout Scrum across the entire business unit again across the UK and China that included 300+ engineering staff.</p> <p>More recently Glenn has been helping organisations both large and small with their journey of agile adoption through a combination of being a Scrum Master and Agile Coach with experience in Telecoms, Government and Enterprise and Financial industries.</p> <p>Glenn’s passion is working with teams, coaching and facilitating them to success, which he does through his own company Tootechnical Ltd.</p> <p>Blog: <a href=\"http://www.tootech.co.uk/\"><a href=\"http://www.tootech.co.uk\" class=\"linkified\">http://www.tootech.co.uk</a></a></p> <p>Twitter: <a href=\"https://twitter.com/gupster\">@gupster</a></p> <p>LinkedIn: <a href=\"http://uk.linkedin.com/in/glennpsmith/\"><a href=\"http://uk.linkedin.com/in/glennpsmith/\" class=\"linkified\">http://uk.linkedin.com/in/glennpsmith/</a></a></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/4/b/1/6/event_234139222.jpeg\" /></p> <p>This session has been chosen by the Scrum Alliance to run at the Paris Scrum Gathering in September. Come along and get a preview of this session before it's official outing in Paris.</p> ",
    "end_time": 1370984400,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/95054902/",
    "location": {
        "address": "Long Down Ave, Bristol BS34 8QZ ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.5003776550293,
        "longitude": -2.5566821098327637,
        "name": "HP Labs"
    },
    "org": "agile",
    "start_time": 1370973600,
    "title": "The Ups and Downs of Cultural Diversity, a hands on workshop run by Glenn Smith"
}