{
    "cancelled": false,
    "description": "<p><b>Test is not for Finding Bugs</b></p> <p>James Grenning</p> <p>in association with <a href=\"http://accu.org/index.php/conferences/accu_conference_2013\">ACCU 2013</a>*.</p> <p> </p> <p>Test used to be something that had to get done sometime before shipping the product. Test could wait while we did the important work of specifying, designing and coding the system. Test was what we did to find bugs. Test was reactive.</p> <p>That was then. Test should not be that unpleasant activity at the end of the development phase; it is an integral and critical part of everyday work.  It does not add drudgery, or overhead; it adds rewarding feedback and makes it possible to put more value into the software instead of wasting time chasing bugs. Test is specification; test is defect prevention, test drives good designs. Tests must be largely automated, though you may think that you cannot afford to automate; when in reality, you cannot afford not to.</p> <p>--</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/8/6/9/4/event_209434452.jpeg\" /></p> <p>James Grenning trains, coaches, and consults worldwide. He has more than thirty years of software development experience, both technical and managerial. James' mission is to bring improved technical and management practices to embedded development teams. He is one of the authors of CppUTest, a unit test harness for embedded C and C++. His book, Test Driven Development for Embedded C, is helping embedded engineers improve their designs and reduce defects.</p> <p> </p> <p>*There are spaces reserved for all attendees of Accu 2013. No need to register here if you are a delegate at the conference.</p> ",
    "end_time": 1365629400,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/95054872/",
    "location": null,
    "org": "agile",
    "start_time": 1365618600,
    "title": "James Grenning presents Test is not for Finding Bugs"
}