{
    "cancelled": false,
    "description": "<p>On agile teams, testing is an activity, not a phase or a role and many teams struggle with this concept. In this development model, where do testers fit in agile teams?</p> <p>Janet Gregory explains how testing activities are included throughout the agile process, and what value a tester can add to the agile team.</p> <p>Sharing her extensive experiences, she describes the importance of collaboration and simplicity in activities such as automation, ATDD (Acceptance Test Driven Development), and exploratory testing.</p> <p>Models such as the agile testing quadrants give a framework to identify testing needs for not only every story, but for features and the project.</p> <p>Janet presents an overview of agile testing practices and delegates will have an opportunity through discussions and exercises to understand how agile practices fit together and allow teams to complete story testing within an iteration, and deliver quality products that satisfy business needs.</p> <p> </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/5/2/c/8/event_281421192.jpeg\" /><b>Who is Janet Gregory?</b></p> <p>Janet Gregory is a Calgary-based consultant, specializing building quality systems. Her passion is promoting agile quality processes in software development.</p> <p>She is co-author with Lisa Crispin of Agile Testing: A Practical Guide for Testers and Agile Teams (Addison-Wesley, 2009).</p> <p>Janet has helped introduce agile practices into companies as tester or coach, and has successfully transitioned traditional test teams into the agile world. Her focus is working the business users and testers to understand their role in agile projects. She practices Lean principles, Extreme Programming, and SCRUM. Her experience as a QA Manager both in a traditional and in agile environments gives her an understanding of the issues faced by most teams. She has introduced lasting change into organizations.</p> <p>Janet contributes articles to publications such as Better Software, Software Test &amp; Performance Magazine and Agile Journal, and enjoys sharing her experiences at conferences and user group meetings around the world. Janet was named one of the 13 Women of Influence in testing by Software Test &amp; Performance magazine – January 2010 issue.</p> <p>Janet has a degree in Computing Science from the University of Alberta, an Information Management Certificate from the University of Calgary, Scrum Master Certification, and took her Quality Management Certification from the ASQ (American Society for Quality).</p> <p>You can <a href=\"http://twitter.com/janetgregoryca\">follow Janet on Twitter</a> and <a href=\"http://janetgregory.ca/blog/\">read her blog here</a></p> <p> </p> ",
    "end_time": 1386108000,
    "link": "https://www.meetup.com/Agile-Bath-Bristol/events/95055022/",
    "location": null,
    "org": "agile",
    "start_time": 1386097200,
    "title": "\"Agile Testing Practices\" with Janet Gregory"
}