{
    "date": 1521140400,
    "description": "<p>We are delighted to bring to you Bristol's first PyData meetup! We have a great speaker line-up in the works, we'll introduce you to ourselves, and find out what's happening in both the local data community as well as the global PyData community.</p> <p>Refreshments will be generously provided by our host OVO Energy. Whilst there is a high probability of beer and pizza, requests or suggestions are encouraged.</p> <p>📊 TALKS<br/>=========</p> <p>Expect two 30-minute talks, plus two 5-minute lightning talks, plus community announcements.<br/>——————————————</p> <p>John Sandall on \"A Brief Introduction to Data Science, Machine Learning and the PyData Ecosystem\"<br/>————————————————————————————————————————<br/>Once confined to the corridors of academia, data science and machine learning are now having a massive impact on the world of business and beyond. There have been significant technological advances in just the last 10 years alone, from the explosion of open source software to the big data revolution, to yield what The Economist now calls the fourth industrial revolution.</p> <p>In this talk we'll go beyond the hype and understand what data science really is, where it came from and where it's going. We'll demystify the field of machine learning, explain the terminology and see examples of how popular techniques are being used in practice. Finally, we'll see how you can get started by exploring the PyData ecosystem and provide concrete next steps towards a career in what the Harvard Business Review has dubbed \"the sexiest job of the 21st century\".</p> <p>Marco Bonzanini on “Understanding Natural Language using Word Vectors”<br/>————————————————————————————————————————<br/>This talk is an introduction to word vectors, a.k.a. word embeddings, a family of Natural Language Processing (NLP) algorithms where words are mapped to vectors. An important property of these vectors is being able to capture semantic relationships, for example:<br/>Paris - France + Italy = ???</p> <p>These techniques have been driving important improvements in many NLP applications over the past few years, so the interest around word embeddings is spreading. In this talk, we'll discuss the basic linguistic intuitions behind word embeddings, we'll compare some of the most popular word embedding approaches, from word2vec to fastText, and we'll showcase their use with Python libraries.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>Adam Smith will be sharing his experiences of the last year building an algorithmic trading system in python. He'll share some things he's found which have really helped and more things he tried that didn't! The main focus will be on the model building pipeline that uses the XGBoost library to fit decision tree based models to features extracted from financial time series data.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub afterwards, to be chosen by Single Transferable Vote at our launch social on 15th February, watch this space!</p> <p>We're limited on the number of attendees, so if you realise you can't make it please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from both the local and the global data community. See you on the 15th!</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/247814072/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45083236694336,
        "longitude": -2.582695960998535,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 1st Meetup"
}