{
    "date": 1526578200,
    "description": "<p>We are delighted to bring to you Bristol's second PyData meetup!</p> <p>Refreshments will be generously provided by our host OVO Energy. Whilst there is a high probability of beer and pizza, requests or suggestions are encouraged.</p> <p>Expect two 30-minute talks, plus two 5-minute lightning talks, plus community announcements.</p> <p>📊 TALKS<br/>=========<br/>Ed Boal on \"GDPR for data people\"<br/>————————————————————————————————————————<br/>What is the GDPR really about? What does the GDPR mean for the data science community? Can Big Data and the GDPR co-exist? What does Data Protection by Design look like? Do anonymisation and pseudonymisation techniques provide the answer?</p> <p>Ed Boal, head of the Digital Media &amp; Technology (<a href=\"https://www.gregglatchams.com/for-business/sector-expertise/digital-media-technology/\" class=\"linkified\">https://www.gregglatchams.com/for-business/sector-expertise/digital-media-technology/</a>) team at Bristol-based law firm Gregg Latchams, will attempt to answer all of these questions and more. As a specialist technology and data protection lawyer, Ed advises clients across a broad variety of hardware products and software platforms and loves nothing more than to pull apart privacy policies and the motives behind them.</p> <p>Louis Taylor on \"Kubernetes for Data Scientists\"<br/>———————————————————————————————————————<br/>In this talk we will quickly cover the basics of containerisation, then move on to an overview of the Kubernetes project and surrounding ecosystem of tools to help run software at scale, and how it can help python-wielding data scientists.<br/>Louis is a Solutions Engineer at Jetstack, with a background in AI &amp; Robotics.</p> <p><a href=\"https://kubernetes.io/\" class=\"linkified\">https://kubernetes.io/</a><br/><a href=\"http://github.com/kragniz\" class=\"linkified\">http://github.com/kragniz</a><br/><a href=\"https://twitter.com/kragniz\" class=\"linkified\">https://twitter.com/kragniz</a></p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>James Yarrow on \"Why run Python in SQL Server?\"<br/>———————————————————————————————————————<br/>As of SQL server 2017, we now can run Python in SQL server, what does this bring us? What options do we have now? Is this worth doing?<br/>James is a local data enthusiast and organiser of SQL Bristol User Group. Currently working at OVO Energy tackling the challenges that come with sustained growth and disruption.<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/james-yarrow-7a346796/\" class=\"linkified\">https://www.linkedin.com/in/james-yarrow-7a346796/</a></p> <p>Graeme Taylor on \"Voronoi Diagrams\"<br/>———————————————————————————————————————<br/>Using Bristol air quality data as an example, I'll discuss the relatively unknown visualisation technique of Voronoi diagrams: what they are, where they come from, and how python can help with producing them.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from both the local and the global data community. See you on the 17th!</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/249747294/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45083236694336,
        "longitude": -2.582695960998535,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 2nd Meetup"
}