{
    "date": 1532023200,
    "description": "<p>We are delighted to bring to you Bristol's third PyData meetup!</p> <p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for sponsorship of the food and refreshments.</p> <p>Expect two 30-minute talks, plus two 5-minute lightning talks, plus community announcements.</p> <p>📊 TALKS<br/>=========<br/>Miranda Mowbray on \"Rights for malware!\"<br/>————————————————————————————————————————<br/>Several organisations have suggested giving legal rights to AI that passes some consciousness-related criteria. I will discuss the extent to which software and robots already pass criteria for consciousness, and argue that this idea is a bad one, not (as some sci-fi suggests) because conscious code may become destructive, but because malware may be programmed to fake consciousness.<br/><a href=\"http://www.bristol.ac.uk/engineering/people/miranda-j-mowbray/index.html\" class=\"linkified\">http://www.bristol.ac.uk/engineering/people/miranda-j-mowbray/index.html</a></p> <p>Miranda Mowbray is a lecturer in Computer Science at the University of Bristol, where her research interests include cyber security and big data ethics. Most of her career has been in industrial research, at HP. Her PhD is in Mathematics, from London University. She is a Fellow of the British Computer Society.</p> <p>Chris Musselle on \"The Case for Testing in Data Science\"<br/>———————————————————————————————————————</p> <p>A Data Scientist’s work is often focused more on the research and exploration rather than the development side of building software. However, in order to demonstrate value from the analytics we do, we have to be able to deliver reliably. This often takes the form of either a reproducible research report/project, or in the form of a built prototype that developers/stakeholders can further experiment with. Testing is a fundamental component to any good software project, though unfortunately is often a bit of an afterthought in the Data Science world. This talk aims to motivate more Data Scientists to embrace testing in order to deliver more reliable analytic outputs.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1.<br/>Jaunius Urbonas on \"Brief introduction to the application of PCA in Data Science\"</p> <p>———————————————————————————————————————<br/>2.<br/>Margriet Groenendijk on \"Call for Code: Innovation and Technology for Good\"<br/><a href=\"https://callforcode.org/\" class=\"linkified\">https://callforcode.org/</a><br/><a href=\"https://www.linkedin.com/in/margrietgroenendijk/\" class=\"linkified\">https://www.linkedin.com/in/margrietgroenendijk/</a></p> <p>———————————————————————————————————————<br/>3.<br/>TBC</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from both the local and the global data community. See you on the 17th!</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/252503849/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45083236694336,
        "longitude": -2.582695960998535,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 3rd Meetup"
}