{
    "date": 1537464600,
    "description": "<p>We are delighted to bring to you Bristol's fourth PyData meetup!</p> <p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for sponsorship of the food and refreshments.</p> <p>Expect two 30-minute talks, plus two 5-minute lightning talks, plus community announcements.</p> <p>*NEW* PRE-MEETUP DEEP LEARNING WORKSHOP \"An Intro to Deep Learning with Keras\"<br/>===============================<br/>We are hosting an optional, fun and free “pre-meetup” workshop also at Ovo Energy, from 5pm-6:30pm, entitled “An Intro to Deep Learning with Keras” and run by our very own John Sandall.<br/>If you wish to attend please sign up to the separate Eventbrite event via this link: <a href=\"http://bit.ly/pydata-bristol-keras-workshop\" class=\"linkified\">http://bit.ly/pydata-bristol-keras-workshop</a>, and bring your laptop with the pre-requisites installed.<br/>(Only 20 places available)</p> <p>📊 TALKS<br/>=========<br/>\"Controlling Aircraft with Deep Reinforcement Learning\" by Gordon Rennie<br/>————————————————————————————————————————<br/>Reinforcement learning is a branch of machine learning in which agents learn how to act in a human-like way: through repeated interactions with their environment. Combining reinforcement learning with deep neural nets has recently enabled exciting advances in the field, such as human-champion level performance in the boardgame Go, control in complex robotics tasks, and defeating teams of professional players in DotA 2. In this talk I will give an overview of reinforcement learning and deep reinforcement learning, and look at some of their applications. As a more concrete example, we will examine my dissertation project where I integrated the open-source flight simulation engine JSBSim into a deep RL system, and trained agents to fly planes – all in Python!</p> <p><a href=\"https://www.linkedin.com/in/gordon-rennie/\" class=\"linkified\">https://www.linkedin.com/in/gordon-rennie/</a></p> <p>Mike O'Connor on \"Hand pose classification in VR using Tensorflow\"<br/>———————————————————————————————————————<br/>I'll be presenting some experiences and lessons learned in using Tensorflow Premade Estimators to prototype a classifier for detecting hand poses from a pair of virtual reality gloves. The talk will be accessible to beginners in machine learning and Tensorflow interested in rapid prototyping of machine learning applications with neural networks.</p> <p>Bio:<br/>Mike O'Connor (@mikeoconnor0308) is a computer scientist currently pursuing a PhD at the University of Bristol, with research interests in high-performance computing, machine learning and human-computer interaction.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Coen de Groot with “Hot off the press - A report from PyCon UK”</p> <p>With PyData the day after PyCon UK, he will be giving you the highlights from the most data-relevant talks of this five day Python conference.</p> <p>Coen is a professional software developer with 25+ years experience. A freelance Python developer since 2011, he uses web frameworks (Flask, Django, Zope, Pyramid) as well as “bare-bones” Python.</p> <p>———————————————————————————————————————<br/>2. Matt Hamilton<br/>\"I’m going to talk about some of the recent playing about with machine learning and predicting cryptocurrency prices. And also demo Watson Image Recogniser\"</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from both the local and the global data community. See you on the 17th!</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/253608445/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45012664794922,
        "longitude": -2.584117889404297,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 4th Meetup"
}