{
    "date": 1542133800,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, plus two 5-minute lightning talks, plus community announcements.</p> <p>*NEW* PRE MEETUP WORKSHOP<br/>===============================<br/>We are again running a free workshop on an \"Intro to Recurrent Neural Networks\" immediately before Tuesday's meetup at OVO Energy from 5pm-6:30pm. Pre-requisites and hard-core mathematics will be kept to a minimum to make it as accessible to all as possible.<br/>Please register in advance on eventbrite and ensure you bring your laptop with the the various pre-requisites installed.<br/><a href=\"https://www.eventbrite.co.uk/e/intro-to-recurrent-neural-networks-tickets-52401888459\" class=\"linkified\">https://www.eventbrite.co.uk/e/intro-to-recurrent-neural-networks-tickets-52401888459</a></p> <p>📊 TALKS<br/>=========<br/>Enrico Rotundo on \"JupyterLab &amp; its extensions: towards a broad open source ecosystem\"<br/>———————————————————————————————————————<br/>I’ll share some insights and ideas regarding JupyterLab and its modular architecture. This has been a major topic at JupyterCon 2018 and it’s deemed to enable unprecedented functionalities for the end users. Developers can now extend the system by writing widgets that implement new data science functionalities. Available extensions already added integrations with tools like git, matplotlib, GitHub and Latex. Shortly, there’ll be a complete ecosystem of open source extensions that'll redefine the user experience. I’ll share some ideas to better expose your extensions to the final users by solely relying on free and open source services. The talk is accessible to data scientists, developers and product owners that work with the Jupyter stack.</p> <p>Bio : <a href=\"https://enricorotundo.github.io/pages/bio.html\" class=\"linkified\">https://enricorotundo.github.io/pages/bio.html</a></p> <p>Vaclav Pohoriljak on \"Information Archeology\"<br/>———————————————————————————————————————<br/>A definition of \"information archeology\"<br/>- Case studies:<br/>1. Banking<br/>2. Oracle vs ERP<br/>3. Cybersecurity<br/>Lessons learned and implications for Python</p> <p>Vaclav Pohoriljak -, studied theoretical economy at Charles university in Prague, focusing on monetary policy, central bank independence and game theory. He then worked as IT professional in investment banking, TV manufacturing and the gaming industry. He applied financial (cost-revenue), game theoretical, econometrical and macro-modelling principles on dynamic IT world. He will explain how these principles enable good analysis, but require relevant data to make analysis accurate.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Benjamin Byford: \"An uber short introduction to AI ethics\"</p> <p>Ben is a researcher and technologist with 10 years of design and coding experience. In 2015 he began doing talks on AI ethics and started the Machine Ethics podcast <a href=\"https://machine-ethics.net/\" class=\"linkified\">https://machine-ethics.net/</a>.<br/>Ben has also started an AI ethics consultancy www.ethicalby.design.</p> <p>———————————————————————————————————————</p> <p>2. Rob Charlwood: \"Developing on Google's Cloud Platform\"</p> <p>Rob is the Director and CTO at Bitniftee Limited.<br/>During a long and varied career he has gained a wealth of experience in building fast and scaleable applications for the web.<br/>Rob also runs the Django Bath &amp; Bristol Users Group (DBBUG)</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from the global data community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/255667468/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45012664794922,
        "longitude": -2.584117889404297,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 5th Meetup"
}