{
    "date": 1544464800,
    "description": "<p>We are delighted to announce a joint Christmas social event with fellow Bristol-based Python meetup, the Python DBBUG group.</p> <p>** CHANGE OF VENUE**<br/>We will be meeting at Runway East Bristol this time, for those coming by train it is approximately 12 minutes' walk from Bristol Temple Meads.<br/>Address: 1 Victoria St, Bristol BS1 6AA</p> <p>We would like to thank Elucidata for kindly sponsoring the venue hire.</p> <p>You can expect several 5 minute Christmas themed lightning talks from both PyData and DBBUG groups' members, as well as extended breaks and networking time plus community announcements. There will be a staffed bar on site, and free mince pies!</p> <p>If you would like to give a Christmas lightning talk on the evening then please send a direct message to Frank Kelly via meetup.com. We are always looking for new speakers and lightning talks.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. (PyData) Bharat Kunwar: \"Santas routing problem - observations on a Kaggle competition\"</p> <p>How can Santa plan his route for his reindeers to navigate through 180,000 cities along the shortest path? However, there is a twist… departing from every 10th city with a non-prime index incurs a 10% distance penalty. This lightning talk is an interactive discussion of different ways in which of tackling this problem in a currently running Kaggle Competition in a computationally efficient manner.</p> <p>Bio: Bharat is a Cloud Software Engineer at StackHPC. In his spare time, he likes to dabble with interesting datasets.<br/>———————————————————————————————————————</p> <p>2. (Python DBBUG) Rob Charlwood: \"1 day with Docker - What I learned in my first 8 hours\"</p> <p>———————————————————————————————————————</p> <p>3. (PyData) Matt Hamilton on trading using Reinforcement Learning</p> <p>———————————————————————————————————————</p> <p>4. (Python DBBUG) Paul Lyon: \"How IBM Watson (and Others) respond to sarcastic customer reviews\"</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:00, talks kick off at 18:30 sharp, beers available from the bar in the intervals. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from the global data community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/256838903/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "pydata",
    "title": "PyData Bristol - Christmas Special"
}