{
    "date": 1547751600,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for continued sponsorship of the pizza and refreshments.</p> <p>Expect one 30-minute talk, two 10-minute talks, one 5-minute lightning talk plus community announcements and networking over beers.</p> <p>If you would like to speak at a future PyData Bristol event- please fill out the form here: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>===============================<br/>NOTE: there will NOT be a PRE MEETUP BEGINNERS' WORKSHOP this time, apologies for any inconvenience!<br/>===============================</p> <p>📊 TALKS<br/>=========<br/>Daniel Howarth on \"Predicting my baby son's mood with deep learning\"<br/>———————————————————————————————————————<br/>The talk is based on a project I undertook to explore how deep learning might be used to help new parents. I will run through the project and try and answer questions I was curious about when I started it: how computers ‘see’ and what makes deep learning good for computer vision problems? How much data is enough and what makes a good dataset? What is transfer learning and how can I apply it my model? And, how do you train and test a deep learning model?<br/>I will also cover my implementations using PyTorch (an open source deep learning library developed by Facebook), lessons learned from the project and next steps.</p> <p>Dan is a senior consultant at Altran Digital, with a background in the aerospace and defence sector. He is a relative newcomer to coding, machine learning, and parenting.</p> <p>=======================================================================</p> <p>MEDIUM-SIZED TALKS</p> <p>1. Samantha North on “Tribalism and political misinformation on Twitter”<br/>In this lightning talk, I will introduce my PhD research in progress, in which I use data science approaches in Python to understand social and political behaviour. Specifically, I’m interested in how tribalism online might affect the spread of political misinformation topics related to the EU referendum.</p> <p>Samantha North is a PhD candidate in computational social science at the University of Bath. Before starting her PhD, she worked as a freelance journalist in the Middle East and studied Mandarin in China, picking up some Python along the way.</p> <p>———————————————————————————————————————</p> <p>2. Sam Drew on \"Efficient Brute-force Correlation\"<br/>Using Approximate Nearest Neighbour and Asymmetric hashing to find similarities in large sets of time-series data</p> <p>Sam is a Software Developer/Economist who spends his copious spare time experimenting with machine learning and data analysis methods, with interests in data privacy, economic modelling and the social impact of technology.</p> <p>=======================================================================</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Tim Vivian-Griffiths on \"Dash apps in docker running on AWS\"</p> <p>Tim is a consultant Data Scientist with a PhD in Machine Learning. He helps run PyData Cardiff meetup.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as announcements and news from the global data community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/257214823/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45012664794922,
        "longitude": -2.584117889404297,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 6th Meetup"
}