{
    "date": 1553106600,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for continued sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, two 5-minute lightning talks plus community announcements and then the all-important networking over beers.</p> <p>If you would like to speak at a future PyData Bristol event- please fill out the form here: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>📊 TALKS<br/>=========<br/>1. Avon Huxor on \"Artificial intelligence as a 'Knowledge Medium'\"</p> <p>The traditional metaphor of AI views it as the design of intelligent agents. he will describe an alternative approach in which we view the technology as a medium for the expression and exchange of knowledge between people. By drawing on analogies to existing media, Avon will show how we can address many of the problems that currently bedevil the field. What these technologies can offer is the next stage in the long-term process of the externalisation of both human knowledge, and \"human reasoning or knowledge processes”.</p> <p>Avon's first involvement in AI goes back to the 1980s. When the ‘AI Winter’ hit the field, he moved to another passion of his and became a research astronomer for 20 years. He recently returned to AI/ML and currently works in medical document analysis.</p> <p>2. Florian Dejax on \"From parquet to model/data parallelism with Tensorflow.\"</p> <p>We will go through the process of generating a parquet file that can be ingested into a tensorflow model. We will then study how we can scale the model to larger dataset by training it on a multi-GPU server.</p> <p>Florian started his career in Paris as a consultant for Keyrus Capital Markets, where he has developed a deep learning model analyzing tweet sentiment linked to CAC40 listed companies for traders. He then moved to London where he worked on Real Time Bidding optimization algorithms and now is with Barclaycard International in the Applied and ML team.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Lenka Hašová on \"The solar potential of Bristol city; a powerful combination of data science and GIS\"<br/>Bio: Graduate Data Scientist Lenka is interested in DS applications for a wide range of geospatial data.</p> <p>2. David Greenwood on \"Back to the Future? A simple way of inferring the distribution of ‘expected’ future stock prices\"</p> <p>Bio: David is Director of Data Science for CheckRisk - a RiskTech consultancy - with expertise in modelling financial markets and investment portfolios.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 19:00 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>If you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/259092029/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45083236694336,
        "longitude": -2.582695960998535,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 7th Meetup"
}