{
    "date": 1557941400,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for continued sponsorship of the pizza and refreshments.</p> <p>Expect three 30-minute talks plus community announcements and then the all-important networking over beers.</p> <p>** Note: talks start at 6:45pm **</p> <p>1. Alistair Rogers on \"Supervised Link Prediction in Networks'\"<br/>2. Steph Locke on \"Rmarkdown: Why it's great for Python folks\"<br/>3. Felix Laumann on \"MedSpace - Medical Image Analysis with Bayesian Deep Learning\"</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>📊 TALKS<br/>=========</p> <p>1. Alistair Rogers on \"Supervised Link Prediction in Networks'\"</p> <p>Attempting to predict conflicts in Africa via Supervised Link Prediction. Based on the history of conflicts that have happened within previous time periods, can we predict the conflicts that will happen within the current time period? Borrowing from methods used in social networks, we can construct \"temporal\" graphs of conflicts and predict structures of graphs in the future.</p> <p>Alistair is a Data Scientist with experience working with clients in Government, Healthcare and Banking. Working on model deployment and portable environments with Docker Experienced in R, Python and SQL. Specialisms: Graph/Network Analytics, Optimisation, Machine Learning.</p> <p>2. Steph Locke on \"Rmarkdown: Why it's great for Python folks\"</p> <p>Eep, what's R got to do with Python? Well, the rmarkdown package allows us to do literate programming like Jupyter notebooks but with a lot more flexibility around outputs. Interleave Python, SQL, and R in this easy to use environment, develop parameterised reports and ship outputs to PDF, PowerPoint, Word, Hugo, HTML dashboards and more with ease.</p> <p>Steph is the founder of a consultancy in the UK. Her talks, blog posts, conferences, and business all have one thing in common – they help people get started with data science. Steph holds the Microsoft MVP award for her community contributions. In her spare time, Steph plays board games with her husband and takes copious pictures of her doggos.</p> <p>3. Felix Laumann on \"MedSpace - Medical Image Analysis with Bayesian Deep Learning\"</p> <p>Bayesian deep learning has the advantage of incorporating a measure for uncertainty naturally. This is especially in the field of medical image analysis indispensable where human health decisions with potential vast consequences are made on a daily base. Given the ageing population and the scarcity of health service resources, doctors often need to make these decisions without consulting a second opinion. Bayesian deep learning can be this precious second opinion in such decision-making processes by favouring a decision, but also stating how certain the network is about this decision. We discuss three different methods (Bayes by Backprop, Dropout, Flipout) how Bayesian deep learning can be implemented, validate their performances on different medical image data sets, and discuss the advantages and disadvantages of each.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>No lightning talks this time. For next meetup, if you're interested: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:30, talks kick off at 18:45 sharp, beers from 21:00. There will be a designated pub to head to afterwards.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"http://pydata.org/code-of-conduct.html\" class=\"linkified\">http://pydata.org/code-of-conduct.html</a>). To discuss any issues or concerns relating to the code of conduct or the behavior of anyone at a PyData meetup, please contact NumFOCUS Executive Director Leah Silen ([masked]; [masked]) or the group organizer.</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/260679477/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45083236694336,
        "longitude": -2.582695960998535,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 8th Meetup"
}