{
    "date": 1563471000,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for continued sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, two 5 minute lightning talks plus community announcements and then the all-important networking over beers.</p> <p>** Note: talks start at 7pm **</p> <p>1. Margriet Groenendijk on \"Deep Learning for Everyone with MAX\"<br/>2. Rod Mupambirei on \"Anomaly detection - what works for me\"<br/>3. Malte Lichtenberg on \"A gentle introduction to Q-learning in Python\"<br/>4. Edmund Barter on \"Manifold cities: What makes Bristol tick?\"</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>🛠 CODE DOJO<br/>==============<br/>17:00-18:30: Bring your laptop with any data projects you're working on, a few of us will be around to give advice, help debug &amp; generally share ideas!</p> <p>📊 TALKS<br/>=========</p> <p>1. Margriet Groenendijk on \"Deep Learning for Everyone with MAX\"</p> <p>Training deep learning models takes a lot of time and effort. What if you could start with a model from a curated list? Meet MAX: the IBM Model Asset eXchange. MAX is a one-stop exchange to find and use machine learning models. You can find both pretrained and trainable models that are all created with open source ML engines like TensorFlow, Keras, PyTorch, and Caffe2. Through a few examples you will learn how to get started.</p> <p>Margriet is a Data &amp; AI Developer Advocate for IBM. She develops and presents talks and workshops about data science and AI. She is active in the local developer communities through attending, presenting and organising meetups. She has a background in climate science where she explored large observational datasets of carbon uptake by forests and global scale weather and climate models.</p> <p>2. Malte Lichtenberg on \"A gentle introduction to Q-learning in Python\"</p> <p>Q-learning is one of the most-used reinforcement learning algorithms. Malte will motivate / explain the approach and together we will implement the algorithm live in Python and observe its learning behaviour when employed in a simple toy domain. Malte will then briefly provide intuition on the modifications that are required to turn Q-learning into the Deep Q-Network (DQN), which was the first algorithm that learned how to play ATARI games from pixel input.</p> <p>Malte is a PhD student in Artificial Intelligence focusing problems in bounded rationality and reinforcement learning. He is active in the local AI/ML community and brings a unique view on the subject having previously worked at the Max Planck Institute for Human Development and as an Econometrician at SO1.ai.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Rod Mupambirei on \"Anomaly detection - what works for me\"<br/>Rodwel is an actuary working in the insurance industry with a particular interest in incorporating statistical techniques in data science and machine learning applications.</p> <p>2. Edmund Barter on \"Manifold cities: What makes Bristol tick?\"<br/>To understand how Bristol works we used a manifold learning technique called diffusion maps, and applied it to census data, to identify the most important factors.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 17:00, talks kick off at 19:00 sharp, beers in The Knights Templar from shortly after 21:00.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/262193660/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45014190673828,
        "longitude": -2.5840909481048584,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 9th Meetup"
}