{
    "date": 1569515400,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue and also IBM for continued sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, two 5 minute lightning talks, community announcements and then the all-important networking over beers.</p> <p>** Note: talks start at 7pm **</p> <p>1. Dave Parr on \"Snakes and Lambdas: Data-ops on AWS Micro-services\"<br/>2. Frank Kelly on \"Machine Learning on the Edge with the Jetson Nano\"<br/>3. Louis Taylor on \"A Linux container from scratch in Python\"<br/>4. Alexandra Craciun on “The Magic of Python Underscores”</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>🛠 PRE-MEETUP FREE WORKSHOP<br/>==============<br/>17:30-18:30:<br/>There will be a short workshop provided by Tim of PyData Cardiff. This will focus on the topic of using unsupervised learning techniques for exploratory purposes. Topics include: K-means, Gaussian Mixture Models, hierarchical clustering techniques, and others.<br/>No need to book for this, just turn up to the venue from 17:30 onwards. You can bring a laptop to work along, or the material can be worked through at a later date. Any updates will be emailed beforehand.</p> <p>📊 TALKS<br/>=========</p> <p>1. Dave Parr on \"Snakes and Lambdas: Data-ops on AWS Micro-services\"</p> <p>Data science doesn't stop after modelling. It still needs to be deployed to users in a robust and scalable way. AWS Lambda can empower data scientists to own the whole deployment, enabling quick iteration and cloud native architecture. However, it's not for all services all the time. Covering the basics of what lambda is and how to use it, this talk will then cover how to decide if it's the right solution, and finish with stumbling blocks that Dave has gone through, so you don't have to.<br/><a href=\"http://www.daveparr.info\" class=\"linkified\">http://www.daveparr.info</a><br/>@daveparr (Twitter)</p> <p>2. Frank Kelly on \"Machine Learning on the Edge with the Jetson Nano\"</p> <p>This talk will describe my journey of experimentation with the Jetson Nano Developer Kit, which is a low cost, single board computer about the size of the Raspberry Pi with super machine learning powers onboard.<br/>I'll explain how I got on getting it set up, with my review of the spec and features of this device. We will move on to how to start training and inference with models in Python-based deep learning frameworks, as well as advice on how to integrate sensor data.</p> <p>Frank (@norhustla) is an industrial engineer and data scientist @HAL24K.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Louis Taylor on \"A Linux container from scratch in Python\"</p> <p>How would you run a docker container using only Python and the Linux kernel? If you're unsure what really happens when you docker run an image, come and see some parts demystified, and a walk through of Python code to make it happen.<br/><a href=\"http://github.com/kragniz\" class=\"linkified\">http://github.com/kragniz</a><br/>@kragniz (Twitter)</p> <p>2. Alexandra Craciun on : “The Magic of Python Underscores”</p> <p>An extensive exploration about everything you wanted (never wanted?) to know about Python underscores. Expect a few magic tricks en route!<br/><a href=\"https://www.linkedin.com/in/alexandra-craciun-268b7a8/\" class=\"linkified\">https://www.linkedin.com/in/alexandra-craciun-268b7a8/</a><br/>Alex designs ML algorithms for low-power audio apps.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>The workshop will run from 17:30- 18:30 and then talks kick off at 19:00 sharp; then beers in The Knights Templar from 21:00.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/263898473/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45014190673828,
        "longitude": -2.5840909481048584,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 10th Meetup"
}