{
    "date": 1572282000,
    "description": "<p>We'd like to thank our hosts OVO Energy for providing the venue and IBM for sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, two 5 minute lightning talks, community announcements and then the all-important networking over beers.</p> <p>** Note: talks start at 7pm **</p> <p>1. Lizzie Stone on \"Learning to live life on the edge with a robotic sense of touch\"<br/>2. Ronan Lamy on \"Pythonic doesn't mean slow!\"<br/>3. Yifan Xie on \"Data Science Projects Experience Sharing - a DS consultant point of view\"<br/>4. TBC</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>🛠 PRE-MEETUP FREE BEGINNERS' WORKSHOP<br/>==============<br/>17:00-18:30:<br/>There will be a short workshop provided by our very own John Sandall. First Steps with Python: This is aimed at total beginners and will focus on learning the basics of the Python programming language, as well as how to use tools such as Jupyter Notebook, with the aim of learning to use Python to work with data. Zero programming experience required.<br/>No need to book for this, just turn up to the venue from 17:00 onwards. You can bring a laptop to work along, or the material can be worked through at a later date. Any updates will be emailed beforehand.</p> <p>📊 TALKS<br/>=========</p> <p>1. Lizzie Stone on \"Learning to live life on the edge with a robotic sense of touch\"</p> <p>How can a robot feel touch, and how can it be useful? I'll talk you through the revolutionary and surprisingly simple TacTip optical tactile sensor, which enables robots to easily perceive physical interactions with the world around them. This sensor data is highly dimensional, providing a rich picture of the world, but comes with the cost of figuring out the meaning of changes in 256 parameters!</p> <p>In the age of DL the common answer to this kind of problem is to throw lots of data at it until it works, but with real robots this can take hours to collect! I take a different approach and show that, with clever planning. much less data is needed to interact with the world and achieve the same (or better) performance, saving you hours of training time. I'll show you some impressive results from my most recent work.</p> <p>Lizzie is a PhD with the Tactile Robotics group at the EPSRC Centre for Doctoral Training in Future Autonomous and Robotic Systems based in Bristol Robotics Laboratory.</p> <p>2. Ronan Lamy on \"Pythonic doesn't mean slow!\"</p> <p>PyPy is a fast and compliant implementation of Python; an interpreter for the Python language that can act as a full replacement for CPython. It's optimised to enable efficient just-in-time compilation of Python code to machine code, and supports Python 2.7 and 3.6as well as the main pillars of the PyData ecosystem (numpy, Cython, pandas, ...).<br/>Performance is a major concern for Python programmers. With PyPy, there is no need to choose between clear code and good performance. This talk aims to convince you that PyPy should be part of every Python programmer's toolbox.</p> <p>Ronan is a contributor to PyPy.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Yifan Xie on \"Data Science Projects Experience Sharing - a DS consultant point of view\"</p> <p>2. TBC</p> <p>🕖 LOGISTICS<br/>==============</p> <p>The workshop will run from 17:00- 18:30 and then talks kick off at 19:00 sharp; then beers in The Knights Templar from 21:00.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "link": "https://www.meetup.com/PyData-Bristol/events/265527534/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45014190673828,
        "longitude": -2.5840909481048584,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "title": "PyData Bristol - 11th Meetup"
}