{
    "cancelled": false,
    "description": "<p>We'd like to thank our hosts OVO Energy for providing the venue and IBM for sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, two 5 minute lightning talks, community announcements and then the all-important networking over beers.</p> <p>** Note: talks start at 7pm **</p> <p>1. Mike O'Connor on \"Python Frameworks for Interactive Scientific Visualisation in Virtual Reality\"<br/>2. John Sandall on \"How To Forecast An Election\"<br/>3. Sam Franklin on \"Getting geospatial work done with the Pydata stack\"<br/>4. Miquel Perello-Nieto on \"Beyond temperature scaling: Obtaining well-calibrated multiclass probabilities with Dirichlet calibration\"</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>📊 TALKS<br/>=========</p> <p>1. Mike O'Connor on \"Python Frameworks for Interactive Scientific Visualisation in Virtual Reality\"</p> <p>In this talk, Mike O'Connor will present Narupa, a virtual reality tool for interactive scientific visualization. The open-source Python-based software combines high-performance computing with rigorous physics simulations to allow researchers to visualize and interact with the nanoscopic world, and enable them to intuitively reason about the complex molecular structures and the high dimensional datasets they produce. Mike will present some of the unique challenges that arise when combining HPC, simulation and data science with aspects of game design in virtual reality.</p> <p>Dr. Mike O'Connor is a Research Associate at the Intangible Realities Lab, University of Bristol.</p> <p>2. John Sandall on \"How To Forecast An Election\"</p> <p>Learn about the field of psephology, a division of political science that deals with the examination and statistical analysis of elections and political polling. Psephology and the polling are a powerful force in contemporary politics. They shape our political narratives around elections, govern the news cycle and act as powerful social proof of a campaign’s success or failure.</p> <p>As trust in polling declines and as technology begins to unlock new sources of political information, we ask what is the future of this discipline and how will it affect campaigning? How do psephologists calculate results and turnout? What kind of models, approaches and data do psephologists currently use? Can new approaches be developed using data science techniques which are emerging from different sectors?</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Sam Franklin on \"Getting geospatial work done with the Pydata stack\"</p> <p>2. Miquel Perello-Nieto on \"Beyond temperature scaling: Obtaining well-calibrated multiclass probabilities with Dirichlet calibration\"</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Talks kick off at 19:00 sharp; then beers in The Knights Templar pub from 21:00.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1574366400,
    "link": "https://www.meetup.com/PyData-Bristol/events/266189787/",
    "location": null,
    "org": "pydata",
    "start_time": 1574359260,
    "title": "PyData Bristol - 12th Meetup"
}