{
    "cancelled": false,
    "description": "<p>Details<br/>We'd like to thank our hosts OVO Energy for providing the venue and IBM for sponsorship of the pizza and refreshments.</p> <p>Expect two 30-minute talks, two 5 minute lightning talks, community announcements and then the all-important networking over beers.</p> <p>** Note: talks start at 7pm **</p> <p>1. Anne Koopman on \"Sleep on it: Evaluating the effect of sleep on creativity with Python &amp; R\"<br/>2. David Greenwood on \"The Many Factors of Santa: A festive use for Bayesian Variational Auto-Encoder)\"<br/>3. Bharat Kunwar on FastAI - A fun Christmas of Learning?</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>📊 TALKS<br/>=========</p> <p>1. Anne Koopman on \"Sleep on it: Evaluating the effect of sleep on creativity with Python &amp; R\"</p> <p>-When we're struggling with a difficult problem, we may be advised to 'sleep on it'. Indeed, anecdotal evidence and some studies suggest that sleep promotes creativity and problem solving.<br/>-In this talk I discuss one of my experiments, which compared (change in) creative production after a night of sleep versus a day of wakefulness. I'll also talk a bit about the use of open source programming methods in my field.<br/>-The experimental tasks I used were written in Python with PsychoPy, an open source software package that makes building experiments really easy. The data were analysed with R, so I'll have some snazzy graphs to show you as well!</p> <p>Anne is finishing up her PhD at Cardiff University, where she looks at the effect of sleep on memory and creativity.</p> <p>2. David Greenwood on \"The Many Factors of Santa: A festive use for Bayesian Variational Auto-Encoder)\"</p> <p>-Understand why and how to combine Deep Learning and Bayesian methods<br/>-Learn how-to generate images with VAE (Variational Encoders)<br/>-Learn about how-to implement them in Python using Keras using a pictures of Santa (rather than the the NIST dataset or cats).</p> <p>David is the Director of Data Science for CheckRisk where he specialises in the use of data science to provide forward looking risk models that enable smart risk taking.</p> <p>⚡️ LIGHTNING TALKS<br/>=====================</p> <p>1. Bharat Kunwar on FastAI - A fun Christmas of Learning?<br/>Bharat is an experienced problem solver in the data-driven modelling domain with a keen interest in AI. In his current role at StackHPC, he specialises in the intersection of Cloud and High Performance Computing.</p> <p>2. TBC</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Talks kick off at 19:00 sharp; then beers in The Knights Templar pub from 21:00.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1576789200,
    "link": "https://www.meetup.com/pydata-bristol/events/266864770/",
    "location": null,
    "org": "pydata",
    "start_time": 1576782000,
    "title": "PyData Bristol - 13th Meetup"
}