{
    "cancelled": false,
    "description": "<p>We'd like to thank our generous hosts OVO Energy for providing the venue.</p> <p>We are going for a different format for this event. We will be running an extended introduction workshop for beginners, there will also be break-out rooms for people to use.</p> <p>New to python? Bring your laptop and start your journey with us!</p> <p>Familiar with Python, A Evening to work on your own project, with supportive peers available for advice. Ask for tips from others more experienced than yourself, or teach somebody else something great!</p> <p>If you would like to speak at a future event- please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>🛠 CODE DOJO<br/>==============<br/>18:00-21:00: Bring your laptop with any data projects you're working on, a few of us will be around to give advice, help debug &amp; generally share ideas!</p> <p>🛠 FREE BEGINNERS' WORKSHOP<br/>==============<br/>18:00-21:00:<br/>There will be a workshop provided by our very own John Sandall. First Steps with Python: This is aimed at total beginners and will focus on learning the basics of the Python programming language, as well as how to use tools such as Jupyter Notebook, with the aim of learning to use Python to work with data. Zero programming experience required.<br/>No need to book for this, just turn up to the venue from 17:00 onwards. IT IS HIGHLY RECOMMENDED TO BRING A LAPTOP. Any updates will be emailed beforehand.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 17:30, Workshops will kick off at 18:00 sharp, beers in The Knights Templar from shortly after 21:00.</p> <p>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1579813200,
    "link": "https://www.meetup.com/PyData-Bristol/events/267902147/",
    "location": {
        "address": "1 Rivergate, Temple Quay, Bristol, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45083236694336,
        "longitude": -2.582695960998535,
        "name": "Ovo Energy"
    },
    "org": "pydata",
    "start_time": 1579802400,
    "title": "PyData Bristol - Intro to Python Workshop and Code Night"
}