{
    "cancelled": false,
    "description": "<p>‼ RSVP at <a href=\"https://meetup.com/PyData-Manchester/events/270272244\" class=\"linkified\">https://meetup.com/PyData-Manchester/events/270272244</a> ‼</p> <p>Stream Link: <a href=\"https://youtu.be/C1hqHk1SfrA\" class=\"embedded\">https://youtu.be/C1hqHk1SfrA</a></p> <p>PyDataUK? You are right! The UK chapters of PyData have banded together to create some super talks during this lockdown period.</p> <p>Details on the event and RSVPs are at <a href=\"https://meetup.com/PyData-Manchester/events/270272244/\" class=\"linkified\">https://meetup.com/PyData-Manchester/events/270272244/</a> and the event will be live-streamed to YouTube.</p> <p>📊 TALKS<br/>=========</p> <p>1. Paige Bailey on \"Introduction to Tensorflow Probability\"</p> <p>TensorFlow Probability (TFP) is a Python library built on TensorFlow that makes it easy to combine probabilistic models and deep learning on modern hardware (TPU, GPU). It's for data scientists, statisticians, ML researchers, and practitioners who want to encode domain knowledge to understand data and make predictions. TFP includes:</p> <p>2. Ian Ozsvald on \"Making Pandas Fly\"</p> <p>Larger datasets can't fit into RAM - suddenly you can't use Pandas any more - but we need to analyse that data! First we'll review techniques to compress our data (maybe cutting our DataFrame RAM usage in half!) so we can process more rows using regular Pandas. Next we'll look at clever ways to make common operations run faster on DataFrames including dropping down to numpy and compiling with Numba. We may also review the new Modin accelerator.</p> <p>This talk is inspired by Ian's work updating his O'Reilly book High Performance Python to the 2nd edition for 2020. Ian is the co-founder of the PyDataLondon meetup with over 11,000 members, he also teaches virtually on topics including Higher Performance Python and Software Engineering for Data Scientists with classes coming up in June 2020.</p> <p>🕖 LOGISTICS<br/>==============</p> <p>* 18:00-18:10 - Intro slides<br/>* 18:10-18:25 - Say hello to PyDatas Edinburgh, Southampton &amp; Bristol<br/>* 18:25-18:30 - \"Five Packages To Power-Up Your Python Productivity\" - ⚡️ talk by John Sandall<br/>* 18:30 - \"TensorFlow Probability\" - Paige Bailey - @DynamicWebPaige<br/>* 19:00 - \"Making Pandas Fly\" - Ian Ozsvald - @ianozsvald</p> <p>Friendly banter and chatter will occur in the PyDataUK Slack channel (<a href=\"http://tinyurl.com/pydatauk-slack\" class=\"linkified\">http://tinyurl.com/pydatauk-slack</a>) which you're also invited to join. You are welcome to attend the talks with a tipple of your choice in hand (remembering that the Code of Conduct applies to our online meetups just as it does with our physical event) for the lovely company of fellow PyData folk. All welcome.</p> <p>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1588705200,
    "link": "https://www.meetup.com/PyData-Bristol/events/270438883/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "pydata",
    "start_time": 1588698000,
    "title": "PyDataUK - May 2020"
}