{
    "cancelled": false,
    "description": "<p>PyData is back in Bristol - in person for the first time since February 2020! We'd like to thank our new hosts [Cookpad](<a href=\"https://www.cookpadteam.com/\" class=\"linkified\">https://www.cookpadteam.com/</a>) for providing the venue, pizza and refreshments, and [Adlib](<a href=\"https://www.adlib-recruitment.co.uk\" class=\"linkified\">https://www.adlib-recruitment.co.uk</a>) for additional sponsorship.<br/>Expect one 30-minute talk, three 5-10 minute lightning talks, community announcements and some relaxed networking over beers and soft drinks.<br/>\\*\\* Note: doors open from 6 and the talks start at 6:30pm sharp \\*\\*</p> <p>1. Sudarsan Balaji on \"Optimization Methods in Python\"<br/>2. (lightning) Alon Samuel on \"How to issue applicable research experiments with DVC and VScode.\" <br/>3. (lightning) Hanson Bharth on \"TBC\"<br/>4. (lightning) Frank Kelly on \"An Introduction to Tsetlin Machines\"</p> <p>If you would like to speak at this or a future event - please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p># TALKS</p> <p>**Sudarsan Balaji** on **Optimization Methods in Python**<br/>In the absence of known algorithms to “solve” problems, we rely on optimisation techniques to arrive at acceptable levels of solutions. In this talk, we review our journey in looking at a few solving algorithms, and see them fail, and come up with alternative attempts using optimisation solutions. Along the way, we also create a useful set of abstractions that we are able to consume effectively. The algorithms explored, in order, are:<br/>Brute-force search, Backtracking method, Genetic algorithm, Particle Swarm and Simulated Annealing.</p> <p>Sudarsan is a Solution Consultant at Sahaj AI Software, where he is focusing on robust, useful applications that don’t break. Breaking down problems and thinking through them is his favourite pastime.<br/>Sudarsan holds a Bachelor’s degree in Mechatronics from SASTRA University, India, and has done a Game Play Design course at University of Aarhus, Denmark.</p> <p>**2\\. Alon Samuel** on **How to issue applicable research experiments with DVC and VScode**.<br/>How to build a pipeline from raw data into a working model with results with DVC. <br/>Track changes with VS code. And the power of changing and researching each step of the way while keeping the pipeline working. </p> <p>Alon is working as a senior Data Scientist at Polecat.com ltd - with NLP models. Before that he was a data scientist and a team leader at Razorlabs working on computer vision and NN for various customers. He has a bachelors degree in Electrical Engineering and Physics from Tel Aviv Uni.</p> <p>3. **Hanson Bharth** on **TBC**</p> <p>4. **Frank Kelly** on **An Introduction to Tsetlin Machines**<br/>The Tsetlin Machine is a type of automata-based machine learning model that learns expressions from propositional logic. Frank will go over its inner workings, benefits/downsides over traditional machine learning approaches and explain how you can use them too.<br/>Frank is a Principal Data Scientist at Sahaj.ai, organiser at PyData Bristol with an engineering-focused, multi-domain background (including aerospace, shipping, tech startups, smart cities and offshore oil &amp; gas). He also works on side projects focused on data-driven, environmental causes.</p> <p># 🕖 LOGISTICS</p> <p>Talks kick off at 18:30 sharp; then networking/beers in either one of the nearby Punchbowl or Barley Mow pubs from 20:40.<br/>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.<br/>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p># 📜 CODE OF CONDUCT</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1665516600,
    "link": "https://www.meetup.com/pydata-bristol/events/288874048/",
    "location": null,
    "org": "pydata",
    "start_time": 1665507600,
    "title": "PyData Bristol - 17th Meetup"
}