{
    "cancelled": false,
    "description": "<p>PyData is back in Bristol and running frequently again!</p> <p>We'd like to thank our hosts [Cookpad](<a href=\"https://www.cookpadteam.com/\" class=\"linkified\">https://www.cookpadteam.com/</a>) for providing the venue, pizza and refreshments, and [Adlib](<a href=\"https://www.adlib-recruitment.co.uk\" class=\"linkified\">https://www.adlib-recruitment.co.uk</a>) for additional sponsorship.<br/>Expect one 30-minute talk, one 20 minute talk and two 5-10 minute lightning talks, community announcements and some relaxed networking over beers and soft drinks.<br/>\\*\\* Note: doors open from 6 and the talks start at 6:30pm sharp \\*\\*</p> <p>1. **The 7 lines of code you need to run faster real-time inference -** Adrian Boguszewski<br/>2. **Semi-supervised Image Segmentation: An introduction to CycleGAN -** David Kersh<br/>3. TBC<br/>4. TBC</p> <p>If you would like to speak at this or a future event - please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p># TALKS</p> <p>**The 7 lines of code you need to run faster real-time inference**<br/>You've already trained your great neural network. It reaches 99.9% of accuracy and saves the world, so you would like to deploy it. However, it must run in real time and process data locally, and you don't want to build a web API. After all, you are a Data Scientist, not a Web Developer… So, is it possible to automatically optimize and run the network fast on the local hardware you have, not the hardware you wish you had? Absolutely! During the talk, I'll present the OpenVINO Toolkit. You'll learn how to automatically convert the model using Model Optimizer and run the inference with the Runtime. The magic with only seven lines of code. After all, you'll get a step-by-step jupyter notebook to try at home.</p> <p>AI Software Evangelist at *Intel*. Adrian graduated from the Gdansk University of Technology in the field of Computer Science 6 years ago. After that, he started his career in computer vision and deep learning. For the previous two years, as a team leader of data scientists and Android developers, Adrian was responsible for an application to take a professional photo (for an ID card or passport) without leaving home. He is a co-author of the LandCover.ai dataset and he was teaching people how to do deep learning. His current role is to educate people about OpenVINO Toolkit. In his free time, he’s a traveller. You can also talk with him about finance, especially savings and investments.</p> <p>**Semi-supervised Image Segmentation: An introduction to CycleGAN**<br/>Deep learning models have proven to be very effective for a plethora of problems including image segmentation - the ability to assign labels to pixels. Of note is the heavy reliance on labelled data; supervised data which is typically labour intensive and expensive to produce. Concurrently, Generative Adversarial Networks are of huge interest due to their ability to produce unique, complex representations which can often times rival human works. In this short presentation we example CycleGAN models, which can be used not only to produce interesting, beautiful representations of inputs, but can also be used to generate useful results, free of label-dependencies</p> <p>David is a Senior Data Scientist at the technical consultancy *Toumetis,* harnessing machine and deep learning to optimise the operations of power companies in the United States. He has over 7 years' experience working in R&amp;D and previously worked for the scientific instrumentation company *Malvern Panalytical.*</p> <p># 🕖 LOGISTICS</p> <p>Talks kick off at 18:30 sharp; then networking/beers in either one of the nearby Punchbowl or Barley Mow pubs from 20:40.<br/>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.<br/>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p># 📜 CODE OF CONDUCT</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1668717000,
    "link": "https://www.meetup.com/pydata-bristol/events/289291453/",
    "location": {
        "address": "1 Broad Plain",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454139709472656,
        "longitude": -2.5822019577026367,
        "name": "Cookpad"
    },
    "org": "pydata",
    "start_time": 1668708000,
    "title": "PyData Bristol - 18th Meetup"
}