{
    "cancelled": false,
    "description": "<p>🎄 PyData Bristol Xmas Social (Joint with Data Bristol!)🎄</p> <p>It has been a great year and we are going to wrap it up with a festive social event. Please come and join us at the The Famous Royal Navy Volunteer,<br/>17-18 King Street, Bristol!</p> <p>Our social will be held jointly with Data Bristol - See their event here: <a href=\"https://www.meetup.com/databristol/events/290007148/\" class=\"linkified\">https://www.meetup.com/databristol/events/290007148/</a></p> <p>If you're planning to come and haven't joined us previously, I'll have a 'Data Bristol' meetup sign out on a table/please message me or post in the discussion for this meetup with any questions.</p> <p>We will be starting up again next year so if you would like to speak at January’s or a future event - please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p># 🕖 LOGISTICS</p> <p>We will meeting at The Knights Templar, You should be able to spot the organisers there.<br/>If you realise you can't make it, please un-RSVP in good time so we know roughly how many of us will be there.<br/>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.</p> <p># 📜 CODE OF CONDUCT</p> <p>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1671141600,
    "link": "https://www.meetup.com/pydata-bristol/events/290220404/",
    "location": {
        "address": "17-18 King Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451751708984375,
        "longitude": -2.5945849418640137,
        "name": "The Famous Royal Navy Volunteer"
    },
    "org": "pydata",
    "start_time": 1671132600,
    "title": "PyData Bristol - Xmas Social 🎄 (Joint with Data Bristol!)"
}