{
    "cancelled": false,
    "description": "<p>PyData is back in Bristol and running frequently again!<br/>We'd like to thank our hosts [Cookpad](<a href=\"https://www.cookpadteam.com/\" class=\"linkified\">https://www.cookpadteam.com/</a>) for providing the venue, pizza and refreshments, and [Adlib](<a href=\"https://www.adlib-recruitment.co.uk\" class=\"linkified\">https://www.adlib-recruitment.co.uk</a>) for additional sponsorship.<br/>Expect one 30-minute talk, one 20 minute talk and one 10 minute lightning talk, community announcements and some relaxed networking over beers and soft drinks.<br/>\\*\\* Note: doors open from 6 and the talks start at 6:30pm sharp \\*\\*</p> <p>1. **Applying unsupervised learning in plasma physics - Gregory Daly**<br/>2. **TBC**<br/>3. **TBC**</p> <p>If you would like to speak at this or a future event - please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a><br/>\\# TALKS<br/>**Applying unsupervised learning in plasma physics**<br/>Low-temperature plasmas are probably one of the most important technologies in the world. But most of you will have no idea why, so we'll need a short introduction to how every semiconductor device you've ever used is made (it's using plasmas). Plasmas are a uniquely challenging environment to make any useful measurements of. We will show how unsupervised learning can be used to make sense of complex diagnostic data for controlling plasma processing and creating useful generative models.</p> <p>Greg is the lead of the data-driven innovation team at Oxford Instruments Plasma Technology and a doctoral researcher at the University of Exeter in the Sustainable Materials and Manufacturing CDT. Greg's research focuses on application of AI and deep learning in semiconductor manufacturing and plasma physics.</p> <p>\\# 🕖 LOGISTICS<br/>Talks kick off at 18:30 sharp; then networking/beers in The Knights Templar from 20:40.<br/>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.<br/>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.<br/>\\# 📜 CODE OF CONDUCT<br/>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1673555400,
    "link": "https://www.meetup.com/pydata-bristol/events/290350783/",
    "location": {
        "address": "1 Broad Plain",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454139709472656,
        "longitude": -2.5822019577026367,
        "name": "Cookpad"
    },
    "org": "pydata",
    "start_time": 1673546400,
    "title": "PyData Bristol - 19th Meetup"
}