{
    "cancelled": false,
    "description": "<p>PyData is back in Bristol and running frequently again!<br/>We'd like to thank our hosts [Cookpad](<a href=\"https://www.cookpadteam.com/\" class=\"linkified\">https://www.cookpadteam.com/</a>) for providing the venue, pizza and refreshments, and [Adlib](<a href=\"https://www.adlib-recruitment.co.uk\" class=\"linkified\">https://www.adlib-recruitment.co.uk</a>) for additional sponsorship.<br/>Expect two 25-minute talks, two 5 minute lightning talks, community announcements and some relaxed networking over beers and soft drinks.<br/>\\*\\* Note: doors open from 6 and the talks start at 6:30pm sharp \\*\\*</p> <p>1. **Applying Unsupervised Learning in Plasma Physics - Gregory Daly**<br/>2. **Using Numba Effectively Today - Cheuk Ting Ho**<br/>3. **[Lightning talk] NBFire Jupyter notebooks - Philip Clarke**<br/>4. **[Lightning talk] Intro to Federated Learning - Akiko Ogawa**</p> <p>If you would like to speak at this or a future event - please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>\\# TALKS<br/>**1\\. Applying Unsupervised Learning in Plasma Physics \\- Gregory Daly**<br/>Low-temperature plasmas are probably one of the most important technologies in the world. But most of you will have no idea why, so we'll need a short introduction to how every semiconductor device you've ever used is made (it's using plasmas). Plasmas are a uniquely challenging environment to make any useful measurements of. We will show how unsupervised learning can be used to make sense of complex diagnostic data for controlling plasma processing and creating useful generative models.<br/>*Speaker bio:*<br/>Greg is the lead of the data-driven innovation team at Oxford Instruments Plasma Technology and a doctoral researcher at the University of Exeter in the Sustainable Materials and Manufacturing CDT. Greg's research focuses on application of AI and deep learning in semiconductor manufacturing and plasma physics.</p> <p>**2.** **Using Numba Effectively Today - Cheuk Ting Ho**<br/>Have you ever heard of Numba? It is (mainly) a JIT (Just-In-Time) compiler to make your math-heavy Python code run faster under certain conditions. Most people found all of it is like a mystery - It sounds like magic, but how does it work? Under what conditions does it work? And because of it, new users found it hard to start using it and it requires a steep learning curve to get the hang of it.<br/>This talk requires no prior experience. Through demos, we will explore in what situation Numba works, when it does not and the reason why. We will also look at some cases where we can make Numba works by changing a few things in your code. Hopefully, by the end of the talk, you will have a better understanding of how Numba works before you even start using it. This knowledge can save you some time on try and error, making your experience in using it better.<br/>*Speaker bio:*<br/>After having a career in data science, Cheuk now brings her knowledge of data and passion for the tech community as the developer advocates for Anaconda. Cheuk constantly contributes to the open-source community by giving free talks and tutorials and organising sprints to encourage diverse contributions.</p> <p>\\# ⚡ LIGHTNING TALKS<br/>3. **NBFire Jupyter Notebooks - Philip Clarke**<br/>Quick demo on how to schedule jupyter notebooks in the cloud using NBfire.<br/>*Speaker bio:*<br/>Philip is part of a Gloucestershire based start-up providing notebook scheduling as a service. [NBfire](<a href=\"https://www.nbfire.io\" class=\"linkified\">https://www.nbfire.io</a>) is a new platform that allows you to schedule, parameterise and run your notebooks in the cloud. It will be available to members of PyData Bristol as a free service to test as an MVP with a view to providing a monthly subscription should members of the meetup find it useful.<br/>4. **Intro to Federated Learning - Akiko Ogawa**<br/>Federated learning is an emerging machine learning methodology that involves deploying and training models on edge devices without data needing to be moved to the cloud.<br/>The talk will explain how AI in distributed systems and IoT could solve new problems where sensor data required for training could be compromised or insufficient.<br/>*Speaker Bio:*<br/>Akiko is a Data Engineer at LV= General Insurance / Allianz. She has recently specialised in data and information systems after being involved as a multi-disciplinarian in the arts, innovation design and systems thinking.<br/>\\# 🕖 LOGISTICS<br/>Talks kick off at 18:30 sharp; then networking/beers in The Knights Templar from 20:40.<br/>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.<br/>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.<br/>\\# 📜 CODE OF CONDUCT<br/>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behavior of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1673555400,
    "link": "https://www.meetup.com/pydata-bristol/events/290350783/",
    "location": {
        "address": "1 Broad Plain",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454139709472656,
        "longitude": -2.5822019577026367,
        "name": "Cookpad"
    },
    "org": "pydata",
    "start_time": 1673546400,
    "title": "PyData Bristol - 19th Meetup"
}