{
    "cancelled": false,
    "description": "<p>PyData is back in Bristol and running frequently again!<br/>We'd like to thank our hosts [Cookpad](<a href=\"https://www.cookpadteam.com/\" class=\"linkified\">https://www.cookpadteam.com/</a>) for providing the venue, pizza and refreshments, and [Adlib](<a href=\"https://www.adlib-recruitment.co.uk\" class=\"linkified\">https://www.adlib-recruitment.co.uk</a>) for additional sponsorship.<br/>Expect two 25-minute talks, two 5 minute lightning talks, community announcements and some relaxed networking over beers and soft drinks.<br/>\\*\\* Note: doors open from 6 and the talks start at 6:30 pm sharp \\*\\*</p> <p>1. **Reinforcement learning: theory and applications by Peter Marinov.**<br/>2. **Posit, Python and you! by Dr Adam Sardar**<br/>3. **Tracking Korfball Players Using Computer Vision and Machine Learning by Andrew Bovey.**<br/>4. **Google Summer of Code - all you need to know to get started by Lenka Hasova**</p> <p>If you would like to speak at this or a future event - please fill out this form: <a href=\"https://goo.gl/forms/8lsz1WA1986Ahbbs1\" class=\"linkified\">https://goo.gl/forms/8lsz1WA1986Ahbbs1</a></p> <p>\\# TALKS<br/>===</p> <p>1\\. Reinforcement learning: theory and applications by Peter Marinov\\.<br/>===</p> <p>Reinforcement learning is a powerful framework for teaching computational agents how to make decisions based on a reward-based system. In this talk, we will explore the fundamental algorithmic principles behind the approach and see it applied to a 2D world problem, where an agent learns to navigate an icy lake with holes and cross safely to the other side.</p> <p>Speaker bio:<br/>Peter Marinov is a Data Scientist and Machine Learning Engineer with a background in Physics and Computer Science. Peter is currently the Lead Data Scientist for Measmerize, an online digital fitting room, and has previously worked as a Machine Learning Engineer for Fundamentals, building intelligent systems for the electric power grid.</p> <p># 2\\. Posit\\, Python and you\\!</p> <p>Rstudio has been instrumental these last 10 years in improving the data science ecosystem for R-based teams industry-wide. Last year the company became 'Posit' and the parity of esteem between R and Python was made explicit. This will radically affect analysis developers working in Python and it is worth being aware of this shift.</p> <p>Adam shall speak to some case-studies of tools that solve real-world data and MLops problems, with examples that you can use in your job the day after this talk.</p> <p>Adam has extensive experience of applied data science across a variety of organisations, differing in both size and sector. This has been gathered over a decade spent in industry, with prior years spent in academia applying machine learning to quantitative questions in the life sciences.</p> <p>\\# LIGHTNING TALKS<br/>===</p> <p>3\\. Tracking Korfball Players Using Computer Vision and Machine Learning by Andrew Bovey\\.<br/>===</p> <p>In this lightning talk, Andrew Bovey will discuss his exploratory work in applying computer vision techniques and machine learning methods to track korfball players from match footage. Using Detectron2's implementation of Instance Segmentation, the talk will showcase how players can be detected, and their position can be estimated, classified, and tracked as they move across the court.</p> <p>Andrew Bovey is a Data Scientist and recent graduate of the University of Exeter's Masters in Data Science with Artificial Intelligence program. His interest in sports analytics, specifically in the application of data science and machine learning techniques in Korfball, led him to work on a dissertation project that explored tracking players from match footage.</p> <p># \\# 4\\. Google Summer of Code \\- all you need to know to get started</p> <p>GSOC is a paid internship with Google which opens its applications on the 22nd of February and we are here to tell you all about it. What is it, how it works and how to start. Highly recommended for any students, early career researchers and any coding enthusiast at the beginning of their coding career.<br/>Lenka is a doctoral candidate in Advanced Quantitative Methods in Geography at the University of Bristol. She is a spatial data enthusiast and has long experience managing, analysing and modelling various spatial data. Lenka completed the Google Summer of Code in 2021 and can provide real insider information.</p> <p>\\# 🕖 LOGISTICS<br/>Talks kick off at 18:30 sharp; then networking/beers in The Knights Templar from 20:40.<br/>If you realise you can't make it, please un-RSVP in good time to free up your place for your fellow community members.<br/>Follow @pydatabristol (<a href=\"https://twitter.com/pydatabristol\" class=\"linkified\">https://twitter.com/pydatabristol</a>) for updates on this and future events, as well as news from the global PyData community.<br/>\\# 📜 CODE OF CONDUCT<br/>The PyData Code of Conduct governs this meetup (<a href=\"https://pydata.org/code-of-conduct/\" class=\"linkified\">https://pydata.org/code-of-conduct/</a>). To discuss any issues or concerns relating to the code of conduct or behaviour of anyone at the PyData meetup, please contact the PyData Bristol organisers, or you can submit a report of any potential Code of Conduct violation directly to NumFOCUS (<a href=\"https://numfocus.typeform.com/to/ynjGdT\" class=\"linkified\">https://numfocus.typeform.com/to/ynjGdT</a>).</p> ",
    "end_time": 1677184200,
    "link": "https://www.meetup.com/pydata-bristol/events/290897769/",
    "location": {
        "address": "1 Broad Plain",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454139709472656,
        "longitude": -2.5822019577026367,
        "name": "Cookpad"
    },
    "org": "pydata",
    "start_time": 1677175200,
    "title": "PyData Bristol - 20th Meetup"
}