{
    "date": 1472666400,
    "description": "<p>A lot of the meetup groups take a break in August (I have no idea why but let us know in the comments if you do). Starting this year we've decided to do something a little different and will be hosting Alternative August.</p> <p>This is a chance to get some new inspiration from different sectors of our industry with a strict no JavaScript policy ;)</p> <p>We're going to open up the floor to lightning talks, if you want to do a talk on space, lightning, the multi-world theory, php, ruby, the back to the future trilogy, graffiti, the origin of your awesome surname \"Power\", architecture, process, retro arcade machines or anything else us nerds would enjoy then please let us know in the comments.</p> <p><b>Rewired Learning - Adam Butler</b></p> <p>Coders have incredibly rewarding jobs, we get to build products that change the world and improve the quality of peoples' lives. However it is also one of the most mentally challenging careers - As developers we're expected to build something from nothing, that works across a increasingly diverse range of platforms in a constantly evolving landscape, all too often with very limited resource.</p> <p>In this talk I'll cover these challenges as well as playful mechanics that you can use to tackle these issues, whilst developing yourself personally. We'll look at some strategies to ensure that you continue to test your assumptions, experiment often and stay motivated, including some fun hardware hacks that have taught me some genuine skills that I actually use in my job.</p> <p>Expect to see Eugene, the IoT taxidermy ship it squirrel, mini missile launchers, drones and plenty of other stuff that are almost certainly applicable to building real shit, you know for banks and stuff.</p> <p><b>The Future of Conversation with ChatBots and A.I. - Phil Hall</b></p> <p>Some of you know about ChatBots, all of you know about Artificial Intelligence and the noise, smoke and mirrors and corporate/media BS that surrounds this sector.</p> <p>What you might not know is how these things relate, what is actually going on behind the scenes and where there are investments going on at this time. Where the conversations about creating a ChatBot layer to the Internet are moving forwards and what companies are meaningful and which are just putting lipstick on pigs.</p> <p>You also might not know that there is a real opportunity to take on the ChatBot market from our local community and put another feather into Bristol and the surrounding area's we-build-everything-here ethos.</p> <p>This talk will be fun, but in a geeky kind of polymath let's break this gig open and look inside to find out where the opportunity to change the Internet is ...</p> ",
    "link": "https://www.meetup.com/BristolJS/events/230666728/",
    "location": {
        "address": "South Wing, One Castlepark, Tower Hill, Bristol,  BS2 0JA",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454708099365234,
        "longitude": -2.5854411125183105,
        "name": "BaseKit (NEW OFFICE)"
    },
    "org": "bristoljs",
    "title": "Alternative August - Rewired Learning & The Future of ChatBots and A.I."
}