{
    "date": 1504114200,
    "description": "<p>Every year in August we break convention and have a strict no JavaScript policy... we call it Alternative August.</p> <p>It's an opportunity for us to bring you inspirational talks from local creatives &amp; technologists from outside of our usual field. ---</p> <p><b>Chris McKirgan - Building Drones</b></p> <p><img src=\"https://media.giphy.com/media/SlOJoT2bLao5G/giphy.gif\" /></p> <p>Sure you can buy a drone, but where's the fun in that? We'll walk through everything you need to know to build your own full-scale first-person-view multi-rotor drone - a type of drone that lets you take to the sky as if you were on board, using special video goggles. If that's too scary for you, we'll also see how you can hack together your very own tiny &amp; simple indoor FPV drone like above. We'll have a couple FPV demo drones for you to have a look at. Maybe a surprise too!</p> <p><b>Darren \"chopsy\" Robbie - Creating characters, worlds &amp; stories in animation</b></p> <p><img src=\"https://secure.meetupstatic.com/photos/event/7/e/a/7/600_463172423.jpeg\" /></p> <p>I've been involved in animation for 20 years - working as a director at Aardmans, Un1t in London, freelance &amp; recently finished a TV series for Disney Junior. I'll talk over the process I go through &amp; cover one or two examples in more detail (with hopefully some props).</p> <p><b>Silas Adekunle - Multi-functional, connected, battle bots with augmented reality capabilities.</b></p> <p><img src=\"https://secure.meetupstatic.com/photos/event/8/a/f/4/600_463175572.jpeg\" /></p> <p>The world needs more awesomeness! :) </p> <p>Robotics + Gaming + Augmented reality falls in that category. That's what we're working on at Reach Robotics. We'll share a short background on the company, the different aspects of what we're working on with MekaMon, our gaming robot and more importantly, a demo with lots of hands-on opportunity.</p> ",
    "link": "https://www.meetup.com/BristolJS/events/241908192/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "bristoljs",
    "title": "Alternative August"
}