{
    "date": 1535562000,
    "description": "<p>Every year we run an event called 'Alternative August'. It's a break from our usual topic of JavaScript and a chance for us to invite some incredibly creative, business, technology and story led talks from outside of our typical day to day.</p> <p>All of our speakers have been carefully selected to have some great content that will most likely unfamiliar but interesting to our community.</p> <p>----------------------------------------------</p> <p>Talk #1 - DATA APPROPRIATION THROUGH ORGANISATION INFILTRATION USING ENHANCED INTEGRATION &amp; TRUTH MANIPULATION - Sash Rigby</p> <p>As Technical Director of Modux, Sash leads the organisation to deliver boutique cyber security consultancy into FTSE100 telecoms, finance and UK defence organisations.</p> <p>Global organisations are commonly breached through web applications, internal networks and trusted partners. Sash will join the meetup to discuss the tradecraft commonly employed by the Modux red team to breach client organisation’s security through real attack scenarios which demonstrate successful end-to-end infiltration.</p> <p>----------------------------------------------</p> <p>Talk #2 - Mindfulness for Developers: Calmness for Coders - wellbeing in the tech workplace - Arabella Tresilian</p> <p>The developer’s brain works hard. Billions of neurons hyperwire to enable the coder to think multidimensionally for hours a day, under complex deadlines, day after day. An understanding of what keeps the brain/mind fresh makes for a more fulfilling and productive career. This interactive session gives participants an overview of neuropsychology for the coding mind, and presents them with a go-to tool for keeping their workplace brain-state healthy, calm and balanced.</p> <p>Arabella is a workplace and civil mediator, specialising in conflict prevention and mental health. She is an associate trainer to the charity Mind, leading on corporate workplace wellbeing training for the Bath region, and she's also a certified Mental Health First Aider. Most of her family members seem to be developers now, and she works from the heart of the tech world in Bath, at the Guild Co-Working Hub. Following a diagnosis of autism in her thirties, she set about hacking her mind to establish better mental health for herself, and now shares her learning with others. Find out more at arabellatresilian.com.</p> <p>----------------------------------------------</p> <p>Talk #3 - To be announced</p> <p>Description coming soon</p> ",
    "link": "https://www.meetup.com/BristolJS/events/252900124/",
    "location": {
        "address": "1-3 Broad Plain, BS2 0JP",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454097747802734,
        "longitude": -2.5825579166412354,
        "name": "Cookpad"
    },
    "org": "bristoljs",
    "title": "Alternative August"
}