{
    "date": 1559151000,
    "description": "<p>⚡️Lightning talk - Konstantinos Leimonis - GitHooks</p> <p>Ever wondered how to improve your project workflow in an automated way? We’ll learn more about git hooks, how they work, how they can be used, integrate them with our daily workflows.</p> <p>⚡️Lightning talk - Stephen Kempin - Starting out with React Native</p> <p>React Native is one the fastest growing frameworks for building native apps. In this lightning talk we will look at starting out with React Native, it’s pros and cons and how it compares to web view based solutions such as Ionic.</p> <p>We will also look at how React Native compares to React, what Expo is and what basic libraries (such as React Navigation) you will need to start building your first React Native app.</p> <p>Finally, we will briefly look at creating standalone apps and uploading these to Google Play and Apple iTunes, and the typical experiences involved in both.</p> <p>This talk is for anyone with an interest in cross platform mobile development in general, especially React and Ionic.</p> <p>Key examples used in this talk include:</p> <p>- Lyrics King<br/><a href=\"https://github.com/SKempin/Lyrics-King-React-Native\" class=\"linkified\">https://github.com/SKempin/Lyrics-King-React-Native</a></p> <p><a href=\"https://expo.io/@skempin/lyrics-king\" class=\"linkified\">https://expo.io/@skempin/lyrics-king</a></p> <p>Mike Oram - PWAs &amp; Offline Development</p> <p>In this talk, we will briefly explore what a PWA is and how to build one. We will look at the benefits of PWA's and more importantly their limitations.</p> <p>We then look a bit deeper at the technologies behind PWA's such as Service Workers, in particular we will look at the mechanics behind Service Workers, and how they will affect your back-end builds.</p> <p>Finally, we will look at offline development, the offline first life-cycle and the tools and technologies needed to start building offline applications. Comparing offline storage mechanisms, and their limitations.</p> <p>This talk is great for anyone building web-based applications, in any language, or anyone wanting to learn more about PWA's and offline development</p> <p>----------------------------------</p> <p>Huge thank you to our sponsors Novate IT, SR2, Travel Local &amp; Immersive labs.</p> <p>Also our amazing hosts Zone Digital who will be supplying our space, food and drinks!</p> <p>Video Recording Sponsored by Pusher</p> <p>You can view previous event talks and more by visiting the Pusher App YouTube channel!</p> <p>Pusher is a hosted service with APIs, developer tools and open source libraries that greatly simplify integrating real-time functionality into web and mobile applications.</p> <p>Pusher will automatically scale when required, removing all the pain of setting up and maintaining a secure, real-time infrastructure.</p> <p>Pusher is already trusted to do so by thousands of developers and companies like GitHub, MailChimp, the Financial Times, Buffer and many more.</p> <p>Getting started takes just a few seconds: simply go to pusher.com and create a free account. Happy hacking!</p> ",
    "link": "https://www.meetup.com/BristolJS/events/260566778/",
    "location": {
        "address": "The Brew House",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.455081939697266,
        "longitude": -2.584660053253174,
        "name": "Zone Digital"
    },
    "org": "bristoljs",
    "title": "Stephen Kempin - Starting out with React Native & Mike Oram - PWA"
}