{
    "date": 1567013400,
    "description": "<p>Alternative August is our annual break away from our usual JavaScript talks and an opportunity for us to bring you talks from local, talented folks doing all sorts of inspiring, weird and wonderful things.</p> <p>We're excited to announce this year we have an amazing line-up of techies and creatives.</p> <p>⚠️ Important information:</p> <p>&gt; Spaces are limited please only RSVP if you are sure you can make it</p> <p>----</p> <p>Talk #1 - Lucia Velasco - The Year is 2139</p> <p>What will AI look like in 10, 30, 100 years? Let your imagination run amok in this sci-fi short.</p> <p>Bio</p> <p>Lucia Velasco is a speaker, software developer, diversity in tech advocate, and aspirant polymath.</p> <p>Having founded Calima in 2018, Lucia now delivers programming, testing and process consultancy for startups and multinational corporations.</p> <p>In her spare time she champions tech education. You'll often find Lucia at local bootcamp Mayden Academy delivering guest lectures and helping out at taster sessions. She is a co-organiser of the PHP South West meetup, and frequent speaker at events across the UK on women in tech, autism awareness and better processes.</p> <p>-------</p> <p>Talk #2 - Ben Everard - Beyond the screen: programmable light</p> <p>A look at how to control lights with code and how to use this to build aesthetically pleasing displays, such as a word clock.</p> <p>-------</p> <p>⚠️😭Unfortunately Mark has had to drop out. We'll try and book in this talk again at Bristol JS sometime soon.</p> <p>~Talk #3 - Mark Lundin (Kuva) - Chaos &amp; Creativity~</p> <p>Working in the space between art, design and technology Kuva is an experience design and creative technology studio that welcomes the unknown and unfamiliar. In this talk, Mark Lundin, creative, coder and studio co-founder explores the studios' work, its’ process, and how to embrace the chaos and uncertainty as a source of creativity.</p> <p>-------</p> <p>Talk #4 - Gav Strange - Graft, Craft and being Daft</p> <p>Making the work is the easy part. Finding the time is the difficult bit. In this talk, Aardman Animations Senior Creative Gavin Strange shares his stories and methods behind getting the most out of those pesky 24 hours, conveyed via the medium of bright colours and animated GIFs. Gavin prides himself on being a “realistic idealist” or an “idealistic realist,” striking the balance between uncurbed enthusiasm and pragmatic process. Floaty sentiments aside, his presentation is about finding the energy and making the time to create things that matter. That’s something he believes applies to everyone, from student to CEO!</p> <p>Bio</p> <p>By Day, Gavin is a Director and Designer for the UK’s beloved creative studio Aardman Animations. By night he goes under the alias of JamFactory, indulging in all manner of passion projects, from filmmaking to illustration, toy design to photography.</p> <p>In 2016, after speaking at the prestigious Do Lectures, he wrote the book ‘Do Fly’, a motivational mantra published by The Do Book Co &amp; Chronicle Books. He co-founded the contemporary design store ‘STRANGE’ with his wife Jane and even appears in CBBC’s art-themed TV show ‘Art Ninja’.</p> <p>Making the work is the easy part, finding the time, however, is the difficult bit. In his talks and his book, Gavin shares his stories and methods behind getting the most out of those 24 pesky hours, conveyed via the medium of bright colours and animated GIFs.</p> <p>He prides himself on being a ‘realistic idealist’ or ‘idealistic realist’ – striking the balance between uncurbed enthusiasm and pragmatic process. Floaty sentiments aside, his talks are about finding the energy and making the time to create things that matter. That’s something Gav believes applies to everyone - from a GSCE to CEO!</p> ",
    "link": "https://www.meetup.com/BristolJS/events/263372370/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "bristoljs",
    "title": "Alternative August 2019 - Code / Art / Science / Technology"
}