{
    "cancelled": false,
    "description": "<p>Info meeting password:[masked]<br/>Link: RSVP to see link</p> <p>---</p> <p>Schedule</p> <p>17:30 - Let's keep the best bit of what makes a meetup a meetup... we'll start with 30 minutes where in breakout rooms.</p> <p>18:00 - Talk time - Uncle Bob - The Future of Programming</p> <p>19:15 - Breakout rooms to socialise and discuss the talk</p> <p>---</p> <p>Hi Everybody... I hope you're all looking after yourselves and staying safe during this challenging time.</p> <p>I'm super excited to announce that in April we'll be holding on online meetup of Bristol JS with an absolutely amazing speaker Robert C. Martin (also known as Uncle Bob).</p> <p>I was blown away when I saw Bob speak a few months ago, he's based in Illinois, US so thought I'd take this opportunity where we're all locked in to ask him to speak remotely for us.</p> <p>---</p> <p>The Future of Programming</p> <p>How did our industry start, what paths did it take to get to where we are, and where is it going. What big problems did programmers encounter in the past? How were they solved? And how do those solutions impact our future? What mistakes have we made as a profession; and how are we going to correct them.</p> <p>In this talk, Uncle Bob describes the history of software, from its beginnings in 1948 up through the current day; and then beyond. By looking at our past trajectory, we try to plot out where our profession is headed, and what challenges we’ll face along the way.</p> <p>---</p> <p>About Robert Martin</p> <p>Robert Martin (@unclebobmartin) is Master Craftsman at 8th Light, Skills Matter instructor and author of a range of books (as well as hundreds of articles), including: Clean Code: A Handbook of Agile Software Craftsmanship as well as his most recent, Clean Architecture: A Craftsman's Guide to Software Structure and Design.</p> <p>Uncle Bob is a renowned lecturer and thought leader in all things programming, known for his innovative, practical and engaging lectures as well as expert knowledge of clean coding, clean architecture and all things Agile.</p> ",
    "end_time": 1588185000,
    "link": "https://www.meetup.com/bristoljs/events/269785545/",
    "location": null,
    "org": "bristoljs",
    "start_time": 1588177800,
    "title": "A COVID-19 Special - The Future of Programming with Uncle Bob!"
}