{
    "cancelled": false,
    "description": "<p>👉 Important: Please read message at the bottom of this post. 👈</p> <p>🚨 Please do not join the waitlist 🚨</p> <p>---</p> <p>Hey Everybody! We're continuing to take advantage of our events being remote and asking speakers from outside of Bristol to give talks. This month we're super excited to have Max Stoiber giving a talk.</p> <p>As with last month we're keeping the best bits of what make our events special, our community. Before and after the talk you'll be invited to join a breakout rooms of up to 15 people to have a bit of a social catchup with friends, colleagues and peers.</p> <p>---</p> <p>The past, present and future of CSS-in-JS by Max Stoiber</p> <p>Where did CSS-in-JS come from, where has it gone since those humble beginnings and where will it go in the future?</p> <p>About Max</p> <p>Max is the technical cofounder of Spectrum.chat, the community platform of the future. He also makes styled-components, react-boilerplate, micro-analytics and a bunch of other open source projects and he co-organises the ReactVienna meetup. He loves to travel, to brew rad coffee and to ski beautiful mountains.</p> <p>---</p> <p>Hey!</p> <p>As some of you may know I've been working on a platform called TechTalks for building tech communities like Bristol JS. I've recently shipped the initial product and am working hard on adding a lot more.</p> <p>I'm focused on this full-time to make it a more interactive and engaging platform for our members as well as a more powerful tool for us and other communities when organising events and finding speakers.</p> <p>Because of this I'd like to ask anyone who would like to attend this event to please RSVP at:</p> <p><a href=\"https://techtalks.io/events/dfb85219-ca47-4e60-9cd1-4e5c8b7d07b3\" class=\"linkified\">https://techtalks.io/events/dfb85219-ca47-4e60-9cd1-4e5c8b7d07b3</a></p> <p>I'd also love your feedback on [masked]</p> <p>Thanks<br/>Adam</p> <p>P.S. TechTalks has a ton of the past Bristol JS videos hosted on it. Check them out at <a href=\"https://techtalks.io/talk_videos\" class=\"linkified\">https://techtalks.io/talk_videos</a></p> ",
    "end_time": 1591812000,
    "link": "https://www.meetup.com/bristoljs/events/270741506/",
    "location": null,
    "org": "bristoljs",
    "start_time": 1591806600,
    "title": "COVID-19 Special - Max Stoiber"
}