{
    "cancelled": false,
    "description": "<p>👉 Important: Please read message at the bottom of this post. 👈</p> <p>🚨 Please do not join the waitlist 🚨</p> <p>RSVP HERE 👉 <a href=\"https://is.gd/newweb20\" class=\"linkified\">https://is.gd/newweb20</a> 👈</p> <p>---</p> <p>Hey Everybody! We're continuing to take advantage of our events being remote and asking speakers from outside of Bristol to give talks. This month we're super excited to have Ben Foxall and Mike Smith giving talks on the new web.</p> <p>As with last month we're keeping the best bits of what make our events special, our community. Before and after the talk you'll be invited to join a breakout rooms of up to 15 people to have a bit of a social catchup with friends, colleagues and peers.</p> <p>---</p> <p>Building a new web - Ben Foxall</p> <p>If you’re building a web service for a frontend application to consume, chances are, you’ll create a restful endpoint that exposes your content as JSON. And, for a number of reasons, that’s a really great shout.</p> <p>However there are alternatives available! In this talk, we’ll chat about one of these alternatives; Protocol Buffers and gRPC.</p> <p>We’ll look at the technical and architectural properties by going through a series of examples of how this differs from more traditional approaches. I’ll also cover some practical aspects of tooling and setup required.</p> <p>I’ll then show how we can apply this architecture to peer-to-peer interfaces, allowing us to create new ways of interacting with the web.</p> <p>---</p> <p>Testing the new web - Mike Smith</p> <p>There's never been a better time to write tests for the web. With so many tools out there, tests for our applications can now be developed more easily and more comprehensively than ever before.</p> <p>However, the web is always moving forwards! Recently we've seen the adoption of peer-to-peer services, virtual reality, 3D graphics and more - all changing the way we interact online. Is it possible for us to test these new features, as successfully as we can test the old?</p> <p>Through a number of examples we will explore how we can write tests for even the most challenging of these new technologies.</p> <p>We will then see that revisiting traditional approaches to testing can allow us to achieve the confidence we need in our testing, no matter how advanced our applications may be.</p> <p>---</p> <p>Hey!</p> <p>As some of you may know I've been working on a platform called TechTalks for building tech communities like Bristol JS. I've recently shipped the initial product and am working hard on adding a lot more.</p> <p>I'm focused on this full-time to make it a more interactive and engaging platform for our members as well as a more powerful tool for us and other communities when organising events and finding speakers.</p> <p>Because of this I'd like to ask anyone who would like to attend this event to please RSVP here 👉 <a href=\"https://is.gd/newweb20\" class=\"linkified\">https://is.gd/newweb20</a> 👈</p> <p>I'd also love your feedback on [masked]</p> <p>Thanks<br/>Adam</p> <p>P.S. TechTalks has a ton of the past Bristol JS videos hosted on it. Check them out at <a href=\"https://techtalks.io/talk_videos\" class=\"linkified\">https://techtalks.io/talk_videos</a></p> ",
    "end_time": 1593025200,
    "link": "https://www.meetup.com/BristolJS/events/271348843/",
    "location": null,
    "org": "bristoljs",
    "start_time": 1593018000,
    "title": "COVID-19 Special - Ben Foxall & Mike Smith - A new web"
}