{
    "cancelled": false,
    "description": "<p>👉 Important: Please read message at the bottom of this post. 👈</p> <p>🚨 Please do not join the waitlist 🚨</p> <p>RSVP HERE 👉 <a href=\"https://techtalks.io/events/f8e26038-2561-484e-8a74-7a1e3a0369b8\" class=\"linkified\">https://techtalks.io/events/f8e26038-2561-484e-8a74-7a1e3a0369b8</a> 👈</p> <p>---</p> <p>Hey Everybody! We're back with two fantastic new talks.</p> <p>As with recent months we're keeping the best bits of what make our events special, our community. Before and after the talk you'll be invited to join a breakout rooms of up to 15 people to have a bit of a social catchup with friends, colleagues and peers.</p> <p>---</p> <p>Introduction to React Hooks - Rachel Davies</p> <p>Hooks were added to React last year. If you haven’t tried them out yet, this talk aims to give an introduction with some examples. We’ll also cover some factors to consider in using them and some examples of how to write tests for code using Hooks.</p> <p>---</p> <p>Taking Flight with Tailwind CSS - Oliver Davies</p> <p>An introduction to utility class and component based styling, and how to soar with Tailwind CSS.</p> <p>Things we’ll cover:</p> <p>- Advantages and disadvantages to utility based styling and Tailwind.<br/>- How to install Tailwind and add it to your build process using tools such as Symfony Encore and Laravel Mix.<br/>- How to configure and customise Tailwind for your project.<br/>- How to promote repeating classes into re-usable components for better maintainability.<br/>- Strategies to control the file size, and using external tools like PurgeCSS.</p> <p>Also, if time allows:</p> <p>- How to extend Tailwind and add extra classes with community written plugins.<br/>- How to write and test your own custom plugins.</p> <p>---</p> <p>🚨 Please do not join the meetup waitlist 🚨</p> <p>Instead RSVP over at TechTalks at 👉 <a href=\"https://is.gd/septjs\" class=\"linkified\">https://is.gd/septjs</a> 👈</p> ",
    "end_time": 1601490600,
    "link": "https://www.meetup.com/BristolJS/events/273267447/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristoljs",
    "start_time": 1601483400,
    "title": "September 2020 - React Hooks & Tailwind CSS"
}