{
    "cancelled": false,
    "description": "<p>We’re collaborating with [Pixel Pioneers](<a href=\"https://pixelpioneers.co/events/bristol-2024\" class=\"linkified\">https://pixelpioneers.co/events/bristol-2024</a>), a fantastic conference held annually at M Shed in our very own lovely city of Bristol.</p> <p>We'll have some fantastic speakers and the chance to socialise with the Bristol JS community and people from further afield attending the conference the following day.</p> <p>This is a chance to network, make new friends, and listen to a couple of insightful talks in an informal, intimate setting.</p> <p>The event is free to attend, but as space is limited, please RSVP to reserve your spot.</p> <p>**Talk #1 - Lessons for developers from the Horizon Post Office scandal**</p> <p>At the heart of the Post Office scandal is the Horizon IT system – a large distributed set of services that provided the backbone to a core piece of the countries’ infrastructure. However, the bugs and failures it suffered from formed the basis for evidence used to wrongly accuse or convict thousands of postmasters, devastating lives and livelihoods. This talk demonstrates how and why the Horizon system suffered from these failures and highlights what we as developers can learn from this cautionary tale.</p> <p>*As well as being one of the directors, [Tom Cartwright](<a href=\"https://www.linkedin.com/in/tomcartwrightuk\" class=\"linkified\">https://www.linkedin.com/in/tomcartwrightuk</a>) is also the Chief Technology Officer of CareScribe.*</p> <p>**Talk #2 - Revealing behavioural insights into the use of AI products**</p> <p>This talk will reveal the fascinating behavioural insights regarding attitudes, behaviours and willingness to use AI products, based on a real case study of designing an “intelligent assistant”, or “information agent”, for tens of thousands of users across public sector engagements.</p> <p>We'll take a look at the new mental models around AI products, barriers and solutions to encourage positive uptake. Understanding these mental models will be crucial in the new technology space that is here to stay. Grounding the talk on a real-life example will help bring the learnings to life, to upskill others in how to design effectively for positive and responsible uptake of AI products.</p> <p>*[Hannah Beresford](<a href=\"https://www.linkedin.com/in/hannah-beresford-beard-73919056/\" class=\"linkified\">https://www.linkedin.com/in/hannah-beresford-beard-73919056/</a>) is a UX Research Manager at Deloitte Digital and specialises in user research for AI products.*</p> <p>**Sponsors**</p> <p>A huge thank you goes to our venue sponsor, award-winning assistive technology company [CareScribe](<a href=\"https://carescribe.io/\" class=\"linkified\">https://carescribe.io/</a>), for hosting us and providing refreshments.</p> <p>**Where?**</p> <p>CareScribe HQ, Temple Studios, Bristol, BS1 6QA ([Google Maps](<a href=\"https://maps.app.goo.gl/zC4gn3npuMhJ5RxD9\" class=\"linkified\">https://maps.app.goo.gl/zC4gn3npuMhJ5RxD9</a>)). Right next to the Temple Meads train station!</p> <p>**About Pixel Pioneers Conference**</p> <p>A quick personal note from me (Adam) organiser of Bristol JS:</p> <p>I've been an attendee of Pixel Pioneers since they started in Bristol and have massively enjoyed the conference, learnt a ton and had a great time getting to know people who organise and attend the events.</p> <p>This is not a paid endorsement, I wanted to pair with Oliver who organises the event because I think it's a great event and want others to be aware of it.</p> <p>Beyond the fantastic talks and workshops, I've liked that they support diversity in the tech community by offering scholarships to underrepresented or marginalised groups in tech. I'm really excited for this years event and hope to see some of the Bristol JS community there too.</p> <p>Pixel Pioneers are offering **Bristol JS members 15% off with the code BristolJS,** follow this link to get your ticket: [<a href=\"https://ti.to/pixel-pioneers/bristol-2024/discount/BristolJS](https://ti.to/pixel-pioneers/bristol-2024/discount/BristolJS\" class=\"linkified\">https://ti.to/pixel-pioneers/bristol-2024/discount/BristolJS](https://ti.to/pixel-pioneers/bristol-2024/discount/BristolJS</a>)</p> ",
    "end_time": 1718305200,
    "link": "https://www.meetup.com/bristoljs/events/301338413/",
    "location": {
        "address": "Temple Studios",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.44817352294922,
        "longitude": -2.5817110538482666,
        "name": "CareScribe"
    },
    "org": "bristoljs",
    "start_time": 1718298000,
    "title": "Bristol JS × Pixel Pioneers"
}