{
    "cancelled": false,
    "description": "<p>In March we welcome <b>Charles Tolman</b> as he previews his <a href=\"http://accu.org/index.php/conferences\">accu2013</a> conference presentation, <b>An Exploration of the Phenomenology of Software Development</b>; a sharing of the more subtle aspects of software development from a practitioner's standpoint.</p> <p>The field has seen an unprecedented transition of a significant part of humanity from physical work to an internally oriented environment dealing with non-physical constructs.</p> <p>Yet just how aware are we of this fact? How do we see the development of the skills in dealing with this inner world’s dynamic? How can we communicate about it in any way that makes sense?</p> <p>Gathering insights from the likes of Wolfgang Goethe, Henri Bortoft, Richard Glass and also the recent work of Christopher Alexander, the speaker welcomes those who have the courage to literally take their hearts into their hands and dive into this inner world from a practitioner’s viewpoint.</p> <p><b>About our speaker:</b><br/><a href=\"http://photos2.meetupstatic.com/photos/event/b/1/5/a/event_205785402.jpegHaving\" class=\"linkified\">http://photos2.meetupstatic.com/photos/event/b/1/5/a/event_205785402.jpegHaving</a> started in electronics back in the mid 70s Charles moved on from soldering chips onto computer boards to programming them through microcode, assembler, Pascal, Eiffel and thence to C++. He is now one of the [ir]responsible architects for a too large media editing system and having seen many silver bullets come and go, is interested in programmer development as much as improving technical competence.</p> <p> </p> ",
    "end_time": 1364416200,
    "link": "https://www.meetup.com/ACCU-Bristol/events/105025942/",
    "location": null,
    "org": "accu",
    "start_time": 1364410800,
    "title": "Meeting #5: An Exploration of the Phenomenology of Software Development"
}