{
    "date": 1378317600,
    "description": "<p><b>Say what you want not how you want it done - logic programming with answer sets</b></p> <p><i>An introduction to declarative/logic programming with answer set programming</i></p> <p>If you’ve ever struggled with programming a solution for a problem that had easy to describe constraints, but is difficult to implement, this session may be for you. Good programmers are lazy - so why waste your time implementing a solution when the computer can do it for you?</p> <p>In this session you will learn how to let the computer solve your problems with declarative programming. It is a programming paradigm that allows the programmer to describe a problem and the requirements on the solutions in an intuitive way, rather than describing the algorithm to find the solutions to the problem. ASP (Answer Set Programming) is a declarative programming paradigm with its roots in knowledge representation and reasoning, a subset of artificial intelligence. In this session we’ll introduce you to the basic principles of this programming paradigm through guided exercises. You will get acquainted with concepts like negation as failure, closed world assumption and model generation.</p> <p>Join us for some hands-on fun! Learn how describing your problems is sometimes enough to get them solved.</p> <p><b>Practical notes:</b></p> <p>If you have a laptop, please bring it. We'll be programming in pairs, so if you don't have a laptop you can work with someone else. We will be using the clingo program. You can install it on your own machine, or log in to our server with ssh. Installation on windows (easy) and mac (may be difficult): you can find the download link at <a href=\"http://potassco.sourceforge.net/\"><a href=\"http://potassco.sourceforge.net/\" class=\"linkified\">http://potassco.sourceforge.net/</a></a> . Debian and Ubuntu: apt-get install clingo</p> <p><b>About our speakers:</b></p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/e/6/8/4/600_268619012.jpeg\" /> <b>Marina de Vos</b> is a senior lecturer in the department of Computer Science at the University of Bath. Her main research area is themed \"Knowledge Representation and Reasoning\". In other words she tries to make programs reasoning \"intelligently\" about the information they have and make decisions on the basis of that reasoning process. Her main tool in this is a declarative programming paradigm called answer set programming.</p> <p><b>Willem van den Ende</b> works as an independent software developer, trainer and consultant. He focuses on systemic thinking and effective development practices inspired by eXtreme Programming, agile and lean. He is co-founder of xp days benelux and agile open, and was programme chair of SPA and board member of the agile alliance. He presents at a software conference somewhere about once a month. He is based in Bath and the Netherlands. He works through <a href=\"http://evolvebeyond.com/coaching/\"><a href=\"http://evolvebeyond.com/coaching/\" class=\"linkified\">http://evolvebeyond.com/coaching/</a></a>, <a href=\"http://www.qwan.eu\"><a href=\"http://www.qwan.eu\" class=\"linkified\">http://www.qwan.eu</a></a> and his own company <a href=\"http://www.livingsoftware.nl\"><a href=\"http://www.livingsoftware.nl\" class=\"linkified\">http://www.livingsoftware.nl</a></a> .</p> ",
    "link": "https://www.meetup.com/ACCU-Bristol/events/132403682/",
    "location": {
        "address": "2 Lower Castle Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.61016082763672,
        "longitude": -2.52667498588562,
        "name": "Bristol Marriott Hotel City Centre"
    },
    "org": "accu",
    "title": "Say what you want not how you want it done - logic programming with answer sets"
}