{
    "cancelled": false,
    "description": "<p><i>We start 2015 with an early version of a talk which will feature on the programme of the ACCU Conference in April.</i></p> <p>The OuLiPo is a literary collective of mathematicians and writers whose interest is in applying algorithmic constraints to works of fiction. A simple example is the lipogram, a text which avoids any use of a particular letter. A more sophisticated example is Richard Beard's novel \"Damascus\" in which the action occurs during a single day, and where every noun used in the book can be found in the Times newspaper published on that day.</p> <p>It's no coincidence that the OuLiPo's origins overlap with those of the electronic computer. Early computers proved capable of cracking puzzles which had long eluded mathematicians: for example, in 1959 a program running on an UNIVAC 1206 discovered a Graeco-Latin square of order 10, a construct Euler had conjectured impossible some 200 years earlier. The OuLiPian writer Georges Perec combined this square with a knight's tour of a 10 by 10 chess board to create the algorithm which powers the book Donald Knuth considers perhaps the greatest 20th century novel, \"Life A User's Manual\".</p> <p>As software developers we too form a collective whose members are both writers and mathematicians. This talk will discuss the OuLiPo in more depth, investigating some remarkable parallels between their work and our own, and will consider what lessons we can learn from them.</p> <p><b>About our speaker</b></p> <p>Thomas Guest is an experienced and enthusiastic software developer who likes puzzles, programming, running and noodles. His website is <a href=\"http://wordaligned.org/\"><a href=\"http://wordaligned.org\" class=\"linkified\">http://wordaligned.org</a></a></p> ",
    "end_time": 1421874000,
    "link": "https://www.meetup.com/ACCU-Bristol/events/219301279/",
    "location": {
        "address": "2 Lower Castle Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.61016082763672,
        "longitude": -2.52667498588562,
        "name": "Bristol Marriott Hotel City Centre"
    },
    "org": "accu",
    "start_time": 1421866800,
    "title": "Lessons from the OuLiPo with Thomas Guest"
}