{
    "cancelled": false,
    "description": "<p>Happy new year to you all!!  I hope you all had a great Christmas and New Year.</p> <p>To kick us off for 2017, I am very pleased to say that the excellent and always entertaining Jim Hague will be sharing his reflections on project management and leadership from a real-life death march project.  </p> <p>You know where you're starting from. You know roughly where you want to go to. You have a fair idea of what you're going to have to do to get half way there. But you can only guess what problems you will encounter from that point. Still, you have a wonderful new technology that will make your journey much easier, you have generous funding and the backing of the board, even if some of the detailed objectives keep changing. </p> <p>What could possibly go wrong? </p> <p> This session tells the tragic story of the Victorian Exploring Expedition of 1860. A generously-funded attempt to chart an overland route to the Gulf of Carpentaria on Australia's north coast, it ended achieving its primary goal but at a terrible cost, both financially - it ended 5x over budget - and otherwise, as 8 men perished on what became, literally, a death march project. We look at the management and leadership failures that doomed a project that came agonisingly close to success but ended in disaster, and reflect on parallels with the human issues in contemporary software development</p> <p>After the talk we'll adjourn ourselves to the Brewdog for a post talk beer or two.</p> <p>Speaker Biography:</p> <p>Jim has been paid to write software since 1990 and still can't quite believe it. During that time he's never quite managed to stay with one sector, doing scientific instrument control, photo lab equipment and an embedded JVM amongst others. For 13 years he nearly got stuck in air traffic control, but has recently been on the move again. In a desperate attempt to make his day job look really interesting he's a morris dancer in his spare time.</p> ",
    "end_time": 1484172000,
    "link": "https://www.meetup.com/accu-bristol/events/236529030/",
    "location": null,
    "org": "accu",
    "start_time": 1484161200,
    "title": "Jim Hague on The Victorian Exploring Expedition of 1860"
}