{
    "cancelled": false,
    "description": "<p>We are delighted to have Chris Simmons and Pedro Ferreira with us, and they're going to do a dry run of their ACCU conference talk on Machine Learning in Python.  </p> <p>And thanks to our sponsors JetBrains, there'll be a chance to win a single user licence for one of their products.  </p> <p>After the talk, we will be heading off to the Brewdog for a beer, so please do come and join us.</p> <p>Synopsis:</p> <p>This presentation is a case study taken from the travel and holiday industry. Paxport/Multicom, based in UK and Sweden, have recently adopted a recommendation system for holiday accommodation bookings. Machine learning techniques such as Collaborative Filtering have been applied using Python (3.5.1), with Jupyter (4.0.6) as the main framework. </p> <p>Data scale and sparsity present significant challenges in the case study, and so the effectiveness of various techniques are described as well as the performance of Python-based libraries such as Python Data Analysis Library (Pandas), and Scikit-learn (built on NumPy, SciPy and matplotlib). </p> <p>We will look at how a problem mainly based in analysis and data modeling can be alleviated by the notebook environment provided by Jupyter is also provided.</p> <p>Bio - After graduating in software engineering Pedro’s interest in artificial intelligence led him to work in the video game industry for a year. That same interest has him now taking part of a Knowledge Transfer Partnership with Paxport(Multicom) and University of West of England working on a Machine Learning related problem. </p> ",
    "end_time": 1489615200,
    "link": "https://www.meetup.com/accu-bristol/events/238220314/",
    "location": {
        "address": "2 Lower Castle Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.61016082763672,
        "longitude": -2.52667498588562,
        "name": "Bristol Marriott Hotel City Centre"
    },
    "org": "accu",
    "start_time": 1489604400,
    "title": "Machine Learning with Python - Case Study"
}