{
    "cancelled": false,
    "description": "<p>I am extremely happy to announce that we've got the excellent James Pascoe speaking to us on the 19th, which promises to be a very exciting topic about Linux PCIe Network Drivers.  </p> <p>It promises to be an enjoyable evening.</p> <p>I'd like to thank our sponsors Jet Brains for giving us a 1 year licence to any of their products as a raffle prize, which we will be drawing.</p> <p>And post talk, we will decamp to the Brewdog for beers, or possibly another pub if the Brewdog is full, but we'll decide on the night.</p> <p><b>Talk Synopsis</b></p> <p>Writing a Linux network driver is the art of blending kernel abstractions with hardware interactions - the intention being to achieve design goals that are typically specified in terms of performance, robustness and security. </p> <p>This talk describes the development and internals of a complex PCIe network driver that interfaces an[masked]ad multi-gigabit wireless network interface to the 4.8.8 Linux kernel.</p> <p>The talk introduces a number of PCIe concepts before explaining the structure of the code in detail. In particular, the presentation will focus on the topics of initialisation, tear-down, the packet path (including IP stack integration), the use of threaded interrupt handlers (plus interrupt mitigation with NAPI) and user-space interactions through Netlink.</p> <p>This talk acts as both a primer for those who are interested in writing their own network drivers and as an introduction to the existing code-bases in the Linux kernel source tree.</p> <p><b>Speaker Bio</b></p> <p>James is interested in all things C, C++17 and Python. James is currently a Senior Software Engineer at Blu Wireless, where he works on Linux device drivers,[masked]ad MAC firmware and developing Python tools for processing large data-sets. </p> <p>Prior to joining Blu Wireless, James worked at Intel where he developed graphics infrastructure for Android platforms. Before Intel, James was a Senior Microprocessor Architect at STMicroelectronics, where he was part of a team developing bespoke (and later ARM based) cores and CPU subsystems. James has also worked at U4EA Technologies, where he built novel QoS mechanisms for network routers. Before working in industry, James was a post-doctoral Research Fellow in the Math and Computer Science department at Emory University, Atlanta, GA. </p> <p>James holds a first class degree and a PhD in Computer Science from The University of Reading and an MBA (with distinction) from The University of Warwick.</p> ",
    "end_time": 1500498000,
    "link": "https://www.meetup.com/accu-bristol/events/240783141/",
    "location": {
        "address": "2 Lower Castle Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.61016082763672,
        "longitude": -2.52667498588562,
        "name": "Bristol Marriott Hotel City Centre"
    },
    "org": "accu",
    "start_time": 1500487200,
    "title": "The Anatomy of a Linux PCIe Network Driver"
}