{
    "cancelled": false,
    "description": "<p>The process of natural evolution has inspired programmers to develop machine learning algorithms that can ‘evolve’ solutions to problems. Such ‘evolutionary algorithms’ have been widely applied and to illustrate their use, we take the evolution of a solution to the counting game FizzBuzz as an example. (A typical game of FizzBuzz involves counting through a sequence of numbers starting at one, but multiples of three are substituted with ‘Fizz’, multiples of five are substituted with ‘Buzz’, and multiples of fifteen are substituted with ‘FizzBuzz’.)</p> <p>The workshop begins with a brief introduction on some of the biological processes of evolution and how they’ve shaped the approach of evolutionary algorithms. To get programming as quickly as possible, we use an evolutionary algorithm framework, the open source Java Class Library for Evolutionary Computing (JCLEC) (<a href=\"http://jclec.sourceforge.net\" class=\"linkified\">http://jclec.sourceforge.net</a>).</p> <p>Workshop participants are introduced to programming with the framework by exploring:<br/>1) ‘OneMax’, a ‘hello world’-type kata example for evolutionary algorithms,<br/>2) ‘how to program you way out of a paper bag using genetic algorithms’, and then<br/>3) ‘FizzBuzz’, a counting game.</p> <p>The workshop then explains Genetic Programming (GP), where source code expressed as Abstract Syntax Trees (ASTs) (or other grammars) can directly evolved with evolutionary algorithms. We also explain how Genetic Programming has been used for automatic bug fixing and the ‘genetic improvement’ of programs.</p> <p>By the end of the workshop, participants will have gained a practical understanding of the components of evolutionary algorithms (e.g. solution representations, fitness measures, diversity preservation operators), and know how extend and implement them via a framework.</p> <p>Participants are strongly encouraged to download and install the JCLEC framework before attending this programming workshop and bring their own laptop with a Java development environment installed.</p> ",
    "end_time": 1553115600,
    "link": "https://www.meetup.com/ACCU-Bristol/events/259479782/",
    "location": null,
    "org": "accu",
    "start_time": 1553108400,
    "title": "Teach Your Computer to Code FizzBuzz - Chris Simons"
}