{
    "cancelled": false,
    "description": "<p>Worried about your online privacy but not sure where to start? It doesn't have to be incredibly complicated, there are a few simple steps you can take to secure your data and we're here to help!</p> <p><b>Come along to learn some basic online security with ORG Bristol and ORG's Campaigner Ed Paton-Williams. </b>&lt;a href=\"https://www.openrightsgroup.org/people/staff\"&gt;&lt;/a&gt;</p> <p>We'll be learning how to think about online threats and getting to grips with some of the tools you can use to make your communications more secure.</p> <p><b>We'll also provide you with resources to carry on learning at home too.</b> This will be the first pilot session of some security training that ORG are developing and you'll get the chance to help us run effective future training workshops. </p> <p><b>The training will be 2hrs long with a 10 minute break</b> half-way through, coffee, tea and biscuits will be provided during the break as a thank you to attendees! </p> <p>This workshop is free to attend but we have a limited number of places so you will need to register in advance to reserve your place. If you prefer not to use Meetup, please email and you will be added to the guest list: [masked]. Spaces will be allocated on a first-come-first-served basis.</p> <p><b>It's important that we start on time so please arrive by 6.45pm or 7.00pm at the latest.</b></p> <p><i>N.B. Make sure you bring along a laptop and your mobile phone so you can set up some of the tools.</i></p> <p>See you there!</p> <p>ORG Bristol</p> ",
    "end_time": 1424811600,
    "link": "https://www.meetup.com/org-bristol/events/220479882/",
    "location": {
        "address": "Stokes Croft, Bristol",
        "city": "BS13QY",
        "country": "gb",
        "latitude": 51.46282958984375,
        "longitude": -2.589651107788086,
        "name": "Hamilton House (Reception will inform you which floor)"
    },
    "org": "org",
    "start_time": 1424803500,
    "title": "How To Protect Your Privacy Online? An Introductory Workshop"
}