{
    "description": "<p>Open Rights Group Bristol, with Bristol Transformed, present an evening of thought provoking talks on data rights, workers rights and the gig economy. After a contribution from each speaker, we will have a panel discussion with opportunity for questions from the audience.</p> <p>Free entry (sign up here: <a href=\"https://www.headfirstbristol.co.uk/#date=[masked]&amp;event_id=56306\" class=\"linkified\">https://www.headfirstbristol.co.uk/#date=[masked]&amp;event_id=56306</a>). The bar will be open!!</p> <p>Blurbs from each speaker are as follows:</p> <p>Data Access: how to protect worker rights in the gig economy<br/>James Farrar, Worker Info Exchange</p> <p>Gig employers such as Uber and Deliveroo use a massive asymmetry in information power to both exploit workers and build powerful commercial networks. The workforce is atomised and kept in the dark so organising can be difficult. Accessing employment rights can be stymied if the worker cannot evidence management control that is hidden in algorithms kept behind the digital curtain. But provisions of the EU General Data Protection Regulation (GDPR) provides important data access rights that will become increasingly important as the gateway for digital workers to secure worker rights. Join this discussion and learn how Worker Info Exchange is helping gig workers access, aggregate and understand their personal data at work and how data is helping workers organise for a more just future.</p> <p>Surviving insecurity and protesting injustice in the hidden gig economy<br/>Alex Wood, University of Birmingham</p> <p>Hundreds of thousands of workers in the UK are part of a hidden global gig economy. These workers are using platforms to remotely undertake tasks such as translation, transcription, programming, digital marketing, graphic design and data entry for clients potentially located on the other side of the world. Despite usually working from their homes, these workers are coming together to build communities to survive the insecurity inherent to the gig economy. This talk will explore the common grievances which platforms generate among these disparate workers and the emerging organisations and embryonic forms of action which workers are using to protest injustice in the hidden gig economy.</p> <p>Data Justice in the Workplace<br/>Lina Dencik, Data Justice Lab, Cardiff University</p> <p>The dual occurrences of constant data collection and use of artificial and autonomous systems in the workplace are having a profound impact on workers' lives. Workers are subjected to constant surveillance that not only monitor worker productivity but factors unrelated to work. At the same time, machine learning systems are using these data to transform how work is being allocated, assessed and completed and as a result, worker lives and value in the workplace. These systems are implemented with little discussion with workers about why it’s necessary, what is being collected, or how that information will be used. What rights do workers have to that information, to ensure that data is collected fairly and accountably, and how are they able to mediate, circumvent or resist the implementation and uses of data? How does the idea of data justice manifest itself in the workplace? In this talk, I will map some of the trends in data-driven technologies, from hiring systems to performance assessment tools, and discuss what this means for situating concerns with data as part of a workers' rights agenda.</p> ",
    "end_time": 1572296400,
    "link": "https://www.meetup.com/ORG-Bristol/events/263889104/",
    "location": {
        "address": "14 Hillgrove Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.46257400512695,
        "longitude": -2.590564012527466,
        "name": "Peoples Republic of Stokes Croft"
    },
    "org": "org",
    "start_time": 1572289200,
    "title": "Data rights, Workers rights and the Gig Economy"
}