{
    "description": "<p>We would like to invite you to a different type of hack night this time. Let’s hack CodeHub!</p> <p>What will it be about?</p> <p>CodeHub is a group that is pretty self-organising and has always benefitted from members bringing in new ideas and starting new groups or events. We’d like to get you involved in shaping CodeHub and deciding what to focus on in the next 3 to 4 months.</p> <p>How can we be the most welcoming to different types of people? What common interests exist? What things should we do more of? How much management makes sense? What kinds of events would you like to see?</p> <p>These are examples of questions that we might want to tackle, and you are welcome to bring your own! And your ideas for addressing them, of course.</p> <p>We will have a structured but very open process in place to make this happen. Isabel Dias has offered to facilitate this and share her experience of working with self-managing organisations.</p> <p>There will also be some food and mulled wine (and other drinks).</p> <p>Who should come along?</p> <p>You should come along if you<br/>- feel intrigued by the above<br/>- are a regular or occasional hack-night-goer, or attendee of any other of our events<br/>- somebody looking to mentor or find a mentor<br/>- are interested in a particular topic that could work for a study group<br/>- would like to see something realised in this group that you are missing so far<br/>This list is not exclusive!</p> <p>Also, while it would be brilliant if you consider helping with events or volunteering for anything else, this is not a requirement. The main thing is that you care about any aspects of what we do.</p> ",
    "end_time": 1576011600,
    "link": "https://www.meetup.com/CodeHub-Bristol/events/266708073/",
    "location": {
        "address": "Framework",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45198059082031,
        "longitude": -2.59443998336792,
        "name": "Framework"
    },
    "org": "CodeHub-Bristol",
    "start_time": 1576000800,
    "title": "Hacking CodeHub"
}