{
    "cancelled": false,
    "description": "<p>We are delighted to be participating in Workshop Wednesdays, alongside Women's Tech Hub, as we get back to real life meetings at Desklodge House. Hopefully, it will be the start of regular fortnightly meetings - we are all zoomed out!!</p> <p>It will be a slightly later start than previously as many people will be travelling from home due to remote working. 6.30 pm is suggested for checking in.<br/>There won't be pizzas (this may change if we get some sponsors in), though we will provide drinks though and we will also put a break in for people to mingle</p> <p>Format<br/>It will be less based on workshops for the key groups and more a drop in for networking, discussion and support. This will allow beginners as well as professionals to mix more easily and less pressure to work through training. For beginners, the specialists should be able to propose training in the areas of expertise and support where help is needed. We will also be supported by Slack channels.</p> <p>The groups to start with are: Python, WedDev101, BDSML and possibly gaming and anything else people want to meet up and discuss.</p> <p>Other groups will emerge over time, depending on what attendees are looking to learn and develop.</p> <p>We'll leave the zoom meeting available for anyone wanting to touch base with the group.</p> <p>Join Zoom Meeting<br/><a href=\"https://us02web.zoom.us/j/82188350994\" class=\"linkified\">https://us02web.zoom.us/j/82188350994</a></p> <p>Meeting ID:[masked]<br/>Find your local number: <a href=\"https://us02web.zoom.us/u/keuIvOld7X\" class=\"linkified\">https://us02web.zoom.us/u/keuIvOld7X</a></p> ",
    "end_time": 1644440400,
    "link": "https://www.meetup.com/codehub-bristol/events/283715306/",
    "location": {
        "address": "2 Redcliffe Way",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.44868850708008,
        "longitude": -2.5871479511260986,
        "name": "DeskLodge House"
    },
    "org": "CodeHub-Bristol",
    "start_time": 1644431400,
    "title": "CodeHub @WorkshopWednesdays: \"in the real\""
}