{
    "cancelled": false,
    "description": "<p>Workshop Wednesdays provide anyone with an interest in programming and web development an opportunity to advance their skills and knowledge in person. They are kindly organised by our good friends at [Womens Tech Hub](<a href=\"https://www.wthub.org/\" class=\"linkified\">https://www.wthub.org/</a>). All levels are welcome to come along and participate in one of the groups (see below) or use the opportunity to have a chat with like-minded attendees.</p> <p>Makers.tech are sponsoring the Workshop Wednesday on 5 October and have some apprenticeship offerings coming up which they are keen to share. Sign up [here](<a href=\"https://www.meetup.com/womens-tech-hub-bristol/events/287983229\" class=\"linkified\">https://www.meetup.com/womens-tech-hub-bristol/events/287983229</a>) if you would like to attend their presentation.</p> <p>In addition, the following groups will be running:</p> <p>* **CS50**: for those interested in getting a grounding a Computer Science, CS50 (Harvard) provides an excellent remote course. We provide a space where learners can watch lectures (bring your own headphones!), read notes, attempt and discuss the lab sets or problems, and share experiences with others. (Note: this is *not* a taught course - the emphasis is on self-study and sharing.)<br/>* **WebDev**: for those interested in building websites WebDev offers:<br/>* For those with experience, a shared space to work on your own full stack web projects and give/get advice.<br/>* For those with a bit of experience, an opportunity to work on a shared project and learn more skills.<br/>* For complete beginners, assistance in getting a web development environment set up and start using HTML, CSS and JS</p> <p>Other groups may also be arranged by Women's Tech Hub who will send out a separate invitation.</p> ",
    "end_time": 1664998200,
    "link": "https://www.meetup.com/codehub-bristol/events/288793669/",
    "location": {
        "address": "2 Redcliffe Way",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.44868850708008,
        "longitude": -2.5871479511260986,
        "name": "DeskLodge House"
    },
    "org": "CodeHub-Bristol",
    "start_time": 1664991000,
    "title": "CodeHub @WorkshopWednesdays"
}