{
    "cancelled": false,
    "description": "<p>![looney-tunables-1](<a href=\"https://www.zdnet.com/a/img/resize/9b2de6701b1f16ec55a122d96bf79d237554416c/2023/10/05/c4c7e6df-3ed0-4b1b-b594-9d7ff415390c/looney-tunables-1.jpg?auto=webp&amp;amp;width=1280)In\" class=\"linkified\">https://www.zdnet.com/a/img/resize/9b2de6701b1f16ec55a122d96bf79d237554416c/2023/10/05/c4c7e6df-3ed0-4b1b-b594-9d7ff415390c/looney-tunables-1.jpg?auto=webp&amp;amp;width=1280)In</a> this workshop we will be taking a deep dive into the anatomy of a real-world, serious vulnerability that came to light in Oct this year. The flaw occurs deep in the GLIBC code that is responsible for finding and loading shared libraries, meaning it is used by every Linux application!</p> <p>You will be playing the role of code reviewer, responsible for ensuring good code quality. Reviewing is a different and under-appreciated skill from coding. We will be using this vulnerability to learn some effective code review techniques. What questions and requests should you be asking to make sure this flaw doesn't see the light of day?</p> <p>Some experience in C/C++ programming will be required as we'll be staring at classic C doing pointer manipulation. And you will need access to a laptop to follow along because, although the code is only 80 lines long, that is too big to show on a screen.</p> <p>Agenda:</p> <p>18:00 - 18:30 Arrival, intros and social<br/>18:30 - 20:20 Code Reviewing the Looney Tunes Vulnerability Workshop<br/>20:20 - 20:30 Wrapping up</p> <p>As usual, please try to arrive by 18:30 or let us know in advance if you're running late.</p> ",
    "end_time": 1700079600,
    "link": "https://www.meetup.com/codehub-bristol/events/297222479/",
    "location": {
        "address": "2 Redcliffe Way",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448692321777344,
        "longitude": -2.587148904800415,
        "name": "DeskLodge House"
    },
    "org": "CodeHub-Bristol",
    "start_time": 1700073000,
    "title": "The Art of Code Review and the Looney Tunes Vulnerability"
}