{
    "date": 1493139600,
    "description": "<p>This is a chance for developers in Bristol to get together in an informal social setting to work on projects, learn, and share with other developers.</p> <p>We have a great space at Momentum Financial Technology's new office (near Temple Meads) with plenty of power outlets, good wifi, and table football and table tennis games.  Food and drinks are provided! Bring you laptop.</p> <p>If you have an idea of what you will be working on, or if you want help with something, feel free to mention it in the comments.</p> <p><b>What is a \"hack night\"?</b></p> <p>Hack night is a casual social coding event where people can come together to work on projects and learn new technologies in any language at any skill level.  It is a good time to work on those projects on the \"back burner\" that you never have time for.  Some people will have personal projects that they want to work on in a social atmosphere.  Others may be interested in pairing up to work on a project or learn something new together, or work through some of the online coding challenges.  Some people may be experts, others may be noobs, and others may just want to learn how to code - all are welcome!</p> <p><b>Previous hack night projects:</b></p> <p>• People learned game development with three.js and phaser.js</p> <p>• People worked on meteor.js and angular.js and node.js and Ruby on Rails</p> <p>• People learned javascript on CodeAcademy</p> <p>• Someone improved their functional programming by learning Haskell</p> <p>• Someone wrote a test suite runner in C</p> <p>• Someone played with node.js on an Arduino board</p> <p>• People worked through the Euler project and game coding challenges</p> <p><b>Location</b></p> <p>Bristol Hack Night is held at our sponsor's new office at 10 Temple Back, near Temple Meads.  The top level office offers a comfortable modern setting for our hack nights, complete with table tennis and table football games.  We will still of course have beer and food.</p> <p>Map and directions: <a href=\"http://files.meetup.com/12370892/Map%20Momentum%20Financial%20Technology%20office.pdf\"><a href=\"http://files.meetup.com/12370892/Map%20Momentum%20Financial%20Technology%20office.pdf\" class=\"linkified\">http://files.meetup.com/12370892/Map%20Momentum%20Financial%20Technology%20office.pdf</a></a></p> <p><b>Food, drinks, and space sponsored by Momentum Financial Technology (MoneyHub)</b></p> <p><a href=\"http://www.bluespeckfinancial.co.uk\">&lt;/a&gt;</p> <p>&lt;a href=\"http://www.bluespeckfinancial.co.uk\"&gt;</a></p> <p><a href=\"http://www.bluespeckfinancial.co.uk\">&lt;/a&gt;</p> <p>&lt;a href=\"http://www.bluespeckfinancial.co.uk\"&gt;</a></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/d/6/a/8/600_434694952.jpeg\" /></p> ",
    "link": "https://www.meetup.com/CodeHub-Bristol/events/kwzltlywgbhc/",
    "location": {
        "address": "10 Temple Back",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45281219482422,
        "longitude": -2.5860190391540527,
        "name": "Momentum Financial Technology office"
    },
    "org": "CodeHub-Bristol",
    "title": "Bristol Hack Night"
}