{
    "date": 1531818000,
    "description": "<p>About</p> <p>WebDev101 is a self-directed study group for everyone interested in improving their knowledge of any subject in the field of web development. As we are not instructor-led, you will only get out what you put in to this group!</p> <p>The goal of WebDev101 is to help each other progress in our individual and/or group goals by providing a space and time in which to meet other like-minded developers, ask questions and potentially find a mentor - or be one.</p> <p>Come with a goal in mind</p> <p>We encourage group members to come prepared with one or several learning goals that you feel are achievable over the 20-week period we will be meeting. That way you can measure your progress, no matter how big or small, and be accountable to yourself each Meetup.</p> <p>Some example goals are:<br/>- Learn how the web works &amp; explain it to a friend<br/>- Learn how to use Chrome Dev Tools<br/>- Set up Sass in a project and incorporate use of nesting, mixins, extend/inheritance<br/>- Complete a freeCodeCamp module<br/>- Learn what JS promises are and how they are used<br/>- Create a JS calculator<br/>- Set up a project with Laravel<br/>- Use Git on a team project (and how/why version control is important)<br/>The sky is the limit with goals, but the more specific they are, the more likely you are to achieve them!</p> <p>Teaching is learning - Volunteer to give a presentation</p> <p>Teaching others what you’ve learned is the quickest way to true mastery of a subject. WebDev101 encourages group members to volunteer to give a brief presentation at least once over the 10-Meetup session on a topic or goal they’ve mastered.</p> <p>The presentation should be short (maximum 10 minutes). Providing a brief exercise for the group to practice what you’ve taught them after your presentation is highly recommended, but not compulsory!<br/>Contact Audrey on the CodeHub Slack (<a href=\"http://slack.codehub.org.uk/\" class=\"linkified\">http://slack.codehub.org.uk/</a>) #webdev101 channel if you'd like to challenge yourself and sign up to give a presentation.</p> <p>Mentor</p> <p>CodeHub encourages members that are willing to mentor beginner/less experienced developers. We aim to help match you with a CodeHub mentor that has the knowledge and experience that you are working towards. Some mentors will be able to attend the WebDev101 group, while other mentors may only be available on hack nights.<br/>If you’re interested in mentoring or finding someone to mentor you on a particular topic, get in touch with Audrey on the CodeHub Slack (<a href=\"http://slack.codehub.org.uk/\" class=\"linkified\">http://slack.codehub.org.uk/</a>) #webdev101 channel.</p> <p>What to bring</p> <p>Your own laptop, a beginner's mindset, complete dedication to respecting others</p> ",
    "link": "https://www.meetup.com/CodeHub-Bristol/events/qdnmspyxkbwb/",
    "location": {
        "address": "23 - 25 St. Augustines Parade, Bristol, BS1 4UL",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45363235473633,
        "longitude": -2.5980629920959473,
        "name": "Dom's Coffee House"
    },
    "org": "CodeHub-Bristol",
    "title": "WebDev101"
}