{
    "cancelled": false,
    "description": "<p>The schedule for our first in-person hack night in a while will be familiar to anyone who has attended our online meetups:</p> <p>*[masked]pm - intros and social - say hello and learn what people will be working on<br/>*[masked]pm - solo or group study/hacking - a chance to learn, help, or just get on with a project while you have people around you to share and discuss<br/>* 8pm - post hack catch-up - let people know what you've been working on, how you got on and share anything you learned.</p> <p>**Hack Night**<br/>This is a chance for anyone with an interest in programming and web development to code, share and learn from one another. Whether you are an experienced developer or just want to find out a little about coding, you are more than welcome. Popular topics include web-development, data, learning to code and AI, but if you would like to meet with people and learn, then please join us.</p> <p>All you'll need is:</p> <p>* A project you'd like to work on, or a subject you'd like to study<br/>* A laptop (probably!)</p> <p>**What is a \"hack night\"?**<br/>Hack night is a casual social coding event where people can come together to work on projects and learn new technologies in any language at any skill level. It is a good time to work on those projects on the \"back burner\" that you never have time for.</p> <p>Some people will have personal projects that they want to work on in a social atmosphere. Others may be interested in pairing up to work on a project or learn something new together, or work through some online coding challenges. Some people may be experts, others may be just beginning or starting back after a break - all are welcome!</p> <p>***</p> <p>**About CodeHub**<br/>CodeHub also runs workshops and facilitates study groups. Check out our website (www.codehub.org.uk) for more information.</p> <p>Please join us on the *#hacknight* channel on our Slack board: <a href=\"https://codehubbs.slack.com/\" class=\"linkified\">https://codehubbs.slack.com/</a> – request an invite during the event!</p> <p>Our Code of Conduct: <a href=\"http://codehub.org.uk/code-conduct\" class=\"linkified\">http://codehub.org.uk/code-conduct</a></p> <p>**Sponsors**<br/>Thank you to our sponsors:<br/>iO Academy (<a href=\"https://io-academy.uk/\" class=\"linkified\">https://io-academy.uk/</a>) - Regular Sponsor</p> ",
    "end_time": 1694547000,
    "link": "https://www.meetup.com/codehub-bristol/events/wfwwgtyfcmbqb/",
    "location": {
        "address": "2 Redcliffe Way",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448692321777344,
        "longitude": -2.587148904800415,
        "name": "DeskLodge House"
    },
    "org": "CodeHub-Bristol",
    "start_time": 1694538000,
    "title": "Hack Night - back in person"
}