{
    "cancelled": false,
    "description": "<p>For the online version of the Hack Night we are following this schedule:<br/>6-6.30 intros and social<br/>6.30-8 solo or group study/hacking<br/>8 post hack catch up</p> <p>Hack Night</p> <p>This is a chance for anyone with an interest in programming and web development to code, share and learn from one another. Whether you are an experienced developer or just learning to code, interested in design or programming, you are more than welcome.</p> <p>CodeHub also runs workshops, organises mentorships and facilitates study groups. Check out our website (www.codehub.org.uk) for more information.</p> <p>Please join the #hacknight channel on our Slack board: <a href=\"http://slack.codehub.org.uk\" class=\"linkified\">http://slack.codehub.org.uk</a></p> <p>Our Code of Conduct: <a href=\"http://codehub.org.uk/code-conduct\" class=\"linkified\">http://codehub.org.uk/code-conduct</a></p> <p>Thank you to our sponsors:<br/>Candide (<a href=\"https://candidegardening.com/\" class=\"linkified\">https://candidegardening.com/</a>) - Regular Sponsor<br/>iO Academy (<a href=\"https://io-academy.uk/\" class=\"linkified\">https://io-academy.uk/</a>) - Regular Sponsor</p> <p>---</p> <p>What is a \"hack night\"?</p> <p>Hack night is a casual social coding event where people can come together to work on projects and learn new technologies in any language at any skill level. It is a good time to work on those projects on the \"back burner\" that you never have time for. Some people will have personal projects that they want to work on in a social atmosphere. Others may be interested in pairing up to work on a project or learn something new together, or work through some of the online coding challenges. Some people may be experts, others may be noobs, and others may just want to learn how to code - all are welcome!</p> ",
    "end_time": 1675197000,
    "link": "https://www.meetup.com/codehub-bristol/events/wkhkjsyfccbpc/",
    "location": null,
    "org": "CodeHub-Bristol",
    "start_time": 1675188000,
    "title": "Hack Night"
}