{
    "description": "<p>Hello Gophers 👋!</p> <p>Join us again for another round of great talks 🗣, food 🍕and drinks 🍻. This time at OVO's offices 🏢. Put the event in your diaries 📕, it's going to be a good one!</p> <p>🗣 Richard Wall - Topic: An evening with golang.org/x/crypto/ssh</p> <p>A whistle stop tour of the golang.org/x/crypto/ssh package. We'll see how to create a simple SSH client and SSH server in a few lines of Go. And then we'll explore some interesting real world uses and discuss<br/>the pros and cons of using this package versus wrapping the OpenSSH<br/>CLI.</p> <p>Richard Wall is a programmer at Jetstack in Bristol, where he works on<br/>plugins and extensions for Kubernetes.</p> <p>🗣Jorge Marin - Topic: Experimenting with Golang and WebAssembly</p> <p>Ever wanted to know what WASM means? Do you wonder why we need WASM when we have Javascript? Do you dream of your Golang code running in the browser? This is a quick introduction to WebAssembly with Golang where you will learn to run your Golang program in the browser to make the web a better place.</p> <p>🍺 As always, afterwards we will be going to the pub for a drink.</p> <p>📣 We are looking for speakers! If you or anyone you know would like to speak, please let us know! We welcome all topics!</p> <p>📣Help us grow! JetBrains offers free licences to meet-ups with attendance greater than 30. If we can reach this, we will apply and be handing it out as a prize at the events.</p> <p>Thank you to our hosts and sponsors:<br/>👏Sponsor - IO Associates<br/>📍Host - OVO Energy</p> ",
    "end_time": 1543523400,
    "link": "https://www.meetup.com/golang-bristol/events/256181775/",
    "location": {
        "address": "1 Rivergate, BS1 6ED",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.450443267822266,
        "longitude": -2.5839879512786865,
        "name": "Ovo Energy"
    },
    "org": "golang",
    "start_time": 1543516200,
    "title": "Go Go Bristol"
}