{
    "cancelled": false,
    "description": "<p>Hello Bristol Gophers 👋!</p> <p>We're bringing our talks online, and while we're at it focusing on particular themes. This months theme is the fascinating world of machine learning, and we have 2 incredible speakers for you.</p> <p>Speakers:</p> <p>🗣 Daniel Whitenack - AI for every language, including Go</p> <p>There are 7,117 languages currently in use around the world, and the largest voice and natural language processing development platforms support, at most, around 100 languages. As a result, billions of people are unable to participate in the current, global conversations that are directly impacting their quality of life. The AI and tech community needs to think creatively and intentionally to extend the benefits of AI technology to these communities.</p> <p>In this talk, Daniel will describe a number of projects that SIL (an international NGO) is working on to extend AI technology into the long tail of languages. Along the way, he will discuss the unique moment we are in with regard to natural language processing (or NLP) research and development and how this moment is opening doors for local languages. he will also share how he see Go playing its part in NLP and AI. Finally, he will provide some resources for those that are wanting to contribute to and learn about related AI work in Go.</p> <p>Daniel has been combining go with machine learning from the early days, from speaking at conferences worldwide, authoring the Machine Learning in Go book, co-hosting Practical AI podcast, he's done it all and more!</p> <p>🗣 James Bowman - Building a KNN classifier from scratch</p> <p>Machine Learning is often viewed as something akin to magic, only within the grasp of big companies like Facebook and Google who build machine learning models in Python using established frameworks like Scikit-learn or TensorFlow. So why on earth would you do this in Go? In this talk, James will try to dispel some of the myths and, with just a pinch of maths, build a basic ML model from scratch in Go.</p> <p>James Bowman is the CTO at Fresh8 Gaming where he’s developed machine learning models in Go for serving adverts. He’s previously worked for a number of companies including ThoughtWorks and Sainsbury’s Argos, where he led the development of their machine learning platform.</p> <p>⏰ Schedule:</p> <p>- 18:00-18:15 intro/welcome<br/>- 18:15-18:45 first speaker<br/>- 18:45-19:15 second speaker<br/>- 19:15-19:30 workshop intro for next month/farewell/feedback</p> <p>📣 We are looking for help with organising! If you or anyone you know would like to help, give us a shout! As you can see, our pun game especially is in dire need of a</p> <p>📣Help us grow! JetBrains offers free licences to meet-ups with attendance greater than 30. If we can reach this, we will apply and be handing it out as a prize at events.</p> <p>📍 - Online (link to be sent out)</p> ",
    "end_time": 1588098600,
    "link": "https://www.meetup.com/golang-bristol/events/270047037/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "golang",
    "start_time": 1588093200,
    "title": "Go(ne online) - ML"
}