{
    "cancelled": false,
    "description": "<p>Hello Bristol Gophers 👋!</p> <p>We're coming back - and in person.</p> <p>Speakers:</p> <p>🗣️ Nick White -</p> <p>Nick is a free software loving developer who has spent most of his career working in various weird jobs creating tools for academics in the humanities. More recently he has \"gone legit\" and now works as a Regular Software Developer in a Regular Company. He found Go about 4 years ago, and it has made him a happier human.</p> <p>There are a lot of different ways people try to figure out whether you're the right person for a job working with Go. I'll talk about my experiences interviewing for a bunch of different companies, from tech giants to startups. We'll cover getting an interview, what to expect at interview, what to focus on, and how to do well with different kinds of coding and algorithm tests. As a good developer with no experience in the mainstream of the industry I had to learn a lot of these lessons the hard way, which I hope will provide an interesting perspective for both people looking for their next job, and people looking for their next hire. Oh, and I ended up getting a great job, don't worry!</p> <p>🗣️</p> <p>⏰ Schedule:</p> <p>* 18:00-18:05 intro/welcome<br/>* 18:05-18:35 first speaker<br/>* 18:35-18:45 small break<br/>* 18:45-19:15 second speaker<br/>* 19:15-19:30 farewell/next event info</p> <p>❤️ Sponsors<br/>\\- Tumelo \\(venue\\)<br/>\\- Utility Warehouse \\(food/drinks\\)</p> <p>📣 Help us grow! JetBrains offers free licences to meet-ups with attendance greater than 30. If we can reach this, we will apply and be handing it out as a prize at events.</p> <p>📍 - Runway East</p> ",
    "end_time": 1689791400,
    "link": "https://www.meetup.com/golang-bristol/events/294370338/",
    "location": {
        "address": "1 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4532356262207,
        "longitude": -2.5910940170288086,
        "name": "Runway East Bristol Bridge"
    },
    "org": "golang",
    "start_time": 1689786000,
    "title": "Go Talks - July"
}