{
    "cancelled": false,
    "description": "<p>DBBUG Lightning Talks and Social</p> <p>Date: Monday 25th March<br/>Location: Runway East, 1 Victoria St, Bristol</p> <p>Massive thank you to our sponsors Elucidata for hiring the venue for us!<br/><a href=\"https://www.elucidata.co.uk\" class=\"linkified\">https://www.elucidata.co.uk</a></p> <p>And another massive thank you to our sponsors Jumptrading for kindly laying on food and drinks for us!<br/><a href=\"https://www.jumptrading.com/jobs.html\" class=\"linkified\">https://www.jumptrading.com/jobs.html</a></p> <p>🕖Schedule<br/>============<br/>18:00 - 1900: Networking with food and drink<br/>1900 - 1905: Welcome<br/>1905 - 1910: Elucidata welcome<br/>1910 - 1915: Jumptrading welcome<br/>1915 - 1920: Rob Charlwood - Terraform &amp; Ansible on GitLab with GCP<br/>1920 - 1925: Ed Crewe - Any code you like as long as its black<br/>1925 - 1930: Eleni Lixourioti - Elixir for Python developers<br/>1930 - 1935: George Burton - Django and Genomic Medicine<br/>1935 - 1940: Shah Hussain - Building Solutions that last<br/>1940 - 1945: Robert Smith - TBC<br/>1945 - 2000: Networking<br/>2000 - 2359: Drinks at The Old Fish Market pub</p> <p>🕖 LOGISTICS<br/>==============</p> <p>Doors open at 18:00, talks kick off at 19:00 sharp. There will be a designated pub to head to afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>Follow @robcharlwood (<a href=\"https://twitter.com/robcharlwood\" class=\"linkified\">https://twitter.com/robcharlwood</a>) for updates on this and future events, as well as announcements and news from the local python community.</p> <p>📜 CODE OF CONDUCT<br/>=======================</p> <p>Be kind to others. Do not insult or put down others. Behave professionally. Remember that harassment and sexist, racist, or exclusionary jokes and language are not appropriate for DBBUG.</p> <p>All communication should be appropriate for a professional audience including people of many different backgrounds. Sexual language and imagery is not appropriate.</p> <p>DBBUG is dedicated to providing a harassment-free event experience for everyone, regardless of gender, sexual orientation, gender identity, and expression, disability, physical appearance, body size, race, or religion. We do not tolerate harassment of participants in any form.</p> <p>Thank you for helping make this a welcoming, friendly community for all.</p> <p>To discuss any issues or concerns relating to the code of conduct or the behaviour of anyone at a DBBUG meet up, please contact the group organizers - Rob Charlwood and Ed Crewe.</p> ",
    "end_time": 1553558340,
    "link": "https://www.meetup.com/python-dbbug/events/258924144/",
    "location": null,
    "org": "dbbug",
    "start_time": 1553536800,
    "title": "DBBUG Lightning Talks and Social"
}