{
    "cancelled": false,
    "description": "<p>DBBUG returns in April for Technical Talks and Social</p> <p>Date: Wednesday 26th April<br/>Time: 18:30-22:30<br/>Location: Torchbox, 3rd Floor, 15 Colston St, Bristol, BS1 5AP</p> <p>Massive thank you to our Hosts [Torchbox](torchbox.com), Sponsors [Foxley Talent](FoxleyTalent.com) and [Django Social](django.social) for their kindness in supporting this event by providing us with a venue, food and drinks!</p> <p>If you are interested in giving a talk, please get in touch with [masked]</p> <p>🕖Schedule<br/>===</p> <p>18:30 - 19:30 - Networking with drinks and food<br/>19:30 - 19:45 - Welcome and Introductions<br/>19:45 - 21:00 - 3x Talks TBC (please get in touch if you want to speak)<br/>21:00 - 21:30 - Networking/Socialising<br/>21:30 onwards, more socialising in a local pub (TBC)</p> <p>🕖 LOGISTICS<br/>===</p> <p>Doors open at 18:30, talks kick off at 19:30 sharp. There will be a designated pub to head towards afterwards.</p> <p>We're limited on the number of attendees, so if you realise you can't make it, please unRSVP in good time to free up your place for your fellow community members.</p> <p>If you can't wait for the 26th April we are also holding a DjangoSocial [Movie Night](<a href=\"https://www.meetup.com/djangosocial-bristol/events/291953964/\" class=\"linkified\">https://www.meetup.com/djangosocial-bristol/events/291953964/</a>) at Torchbox on the 14th March.</p> <p>📜 CODE OF CONDUCT<br/>===</p> <p>Be kind to others. Do not insult or put down others. Behave professionally. Remember that harassment and sexist, racist, or exclusionary jokes and language are not appropriate for DBBUG.</p> <p>All communication should be appropriate for a professional audience including people of many different backgrounds. Sexual language and imagery is not appropriate.</p> <p>DBBUG is dedicated to providing a harassment-free event experience for everyone, regardless of gender, sexual orientation, gender identity, and expression, disability, physical appearance, body size, race, or religion. We do not tolerate harassment of participants in any form.</p> <p>Thank you for helping make this a welcoming, friendly community for all.</p> <p>To discuss any issues or concerns relating to the code of conduct or the behaviour of anyone at a DBBUG meet up, please contact the group organisers</p> ",
    "end_time": 1682544600,
    "link": "https://www.meetup.com/python-dbbug/events/292108431/",
    "location": {
        "address": "15 Colston Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45486068725586,
        "longitude": -2.5978050231933594,
        "name": "Torchbox"
    },
    "org": "dbbug",
    "start_time": 1682530200,
    "title": "DBBUG April Technical Talks and Social"
}