{
    "description": "<p>***NOTE THE UPDATED LOCATION - Ovo Energy, 2nd Floor, 10 Temple Back, BS1 6FL***</p> <p>The excerpts from the presentations are:</p> <p>Colin Domoney - DevSecOps pioneer (AKA 'The Dude' at RUGGD)<br/>The adoption of DevOps presents a number of challenges to security professionals who are unaccustomed to the cadence of releases, and high levels of automation. This presentation will cover some of the challenges facing security teams as they engage with both Dev and Ops teams; and takes an optimistic view on the unique opportunity that DevOps presents to the security professional to ensure that security is both frictionless and no longer an inhibitor to progress.</p> <p>Michela D'Errico - Container &amp; IoT Security Guru (Dyson)<br/>Compliance matters. From host configuration to image creation and even container execution, every step you take to setup your container environment matters and contributes to the overall security of the system. This presentation gives a high-level overview to containerisation technology and walks through each component with a view to make them CIS compliant</p> <p>Andrew Martin - King of Kubernetes &amp; Container security (Control-Plane)<br/>Now that we have passed \"peak orchestrator\" and as Kubernetes eats the world, we are left wondering: how secure is Kubernetes? Can we really run Google-style multi tenanted infrastructure safely? And how can we be sure what we configured yesterday will be in place tomorrow? ***Food &amp; drink will be provided***</p> <p>See you all on Thursday! We'll kick off around 6pm, hope to finish around 8:30pm (there may be a post-event pub)</p> ",
    "end_time": 1521145800,
    "link": "https://www.meetup.com/DevSecOps-force-4-change/events/248296023/",
    "location": {
        "address": "10 temple back",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45317077636719,
        "longitude": -2.5861148834228516,
        "name": "Ovo Energy, 2nd Floor"
    },
    "org": "devsecops",
    "start_time": 1521136800,
    "title": "DevSecOps Meetup at Ovo Energy (2nd Floor, 10 Temple back) Thursday 15th March!"
}