{
    "cancelled": false,
    "description": "<p>We've very pleased to announce that our next meet-up is going to be hosted by FiveAI at their Bristol offices - <a href=\"https://five.ai/\" class=\"linkified\">https://five.ai/</a></p> <p>As many of you will already know, FiveAI is a venture-funded UK company based in London, Cambridge, Oxford, Bristol, Edinburgh and Millbrook.</p> <p>They are developing the software that will make autonomous vehicle services a reality in Europe, and are already testing their systems on the streets of London.</p> <p>Talks:</p> <p>- \"Scene Understanding at FiveAI\" - Blaine Rogers. Blaine is a Research Engineer working in FiveAI's Perception Team.</p> <p>- \"Where to commit a crime and get away with it using PySpark\" - Alistair Rogers. Alistair is a data scientist at OnCorps, a company that applies ML to the Asset Management and Sales sector. Alistair has worked with a number of organisations within the Healthcare, Banking and Government spaces.</p> <p>Schedule:</p> <p>18:00 - Doors/Food/Drinks/Networking<br/>18:50 - Opening Introduction/Community Messages<br/>19:00 - Alistair Rogers - \"Where to commit a crime and get away with it using PySpark\"<br/>19:30 - Short Break<br/>19:40 - Blaine Rogers - \"Scene Understanding at FiveAI\"<br/>20:30ish - Tidy up &amp; head to a local pub to continue the conversation</p> <p>Please note the talks will be filmed.</p> <p>The Bristol ML meet-up is defined by its community. If you have ideas for speakers, venues or suggestions for how we can in anyway improve please don't hesitate to contact one of the organisers.</p> <p>This is a going to be a really great set of talks, hope to see you there!</p> <p>All attendees, speakers, sponsors, organizers and volunteers at this meetup are required to agree with the following code of conduct. We expect cooperation from all participants to help ensure a safe environment for everybody.</p> <p>Our meetups are dedicated to provide a safe and harassment-free experience for everyone, regardless of gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), or technology choices.<br/>We do not tolerate harassment of participants in any form. Weapons or any other items used for the purpose of causing injury or harm to others are forbidden at the venue.</p> <p>Harassment includes offensive verbal comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.</p> <p>Participants asked to stop any harmful behaviour are expected to comply immediately. If a participant engages in harmful behaviour, the organizers may take any action they deem appropriate, including warning the offender or expulsion from the event with no refund.<br/>If you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact an organiser immediately.</p> ",
    "end_time": 1574281800,
    "link": "https://www.meetup.com/Bristol-Machine-Learning/events/265661365/",
    "location": null,
    "org": "bristol-bachine-learning",
    "start_time": 1574272800,
    "title": "Bristol Machine Learning #9 - FiveAI"
}