{
    "description": "<p>We're very pleased to announce that our next meet-up is going to be hosted by Cookpad at their Bristol offices - <a href=\"https://www.cookpadteam.com/\" class=\"linkified\">https://www.cookpadteam.com/</a></p> <p>Cookpad is a technology company with a mission to make everyday cooking fun. Their Bristol office is home to the global headquarters.</p> <p>Schedule:</p> <p>18:00 - Doors/Food/Drinks/Networking<br/>18:30 - Opening Introduction/Community Messages<br/>18:40 - Dan Cook - \"Explainable Word Embeddings\"<br/>19.15 - Avon Huxor - TBD<br/>20:00 - Wrap up and head to a nearby pub</p> <p>Talks:</p> <p>Dan Cook - \"Explainable Word Embeddings\"<br/>After talking about what word embeddings are and why they’re important, particularly with regard to text classification tasks, we’ll cover a history of what text enrichment before neural nets looked like and then a general overview of how word2vec works.</p> <p>My research has focussed on combining the old with the new. How can you form a low dimensional representation to represent a word, that locates synonymous words close together, but attaches human readable labels to each dimension of the vector (unlike a neural net generated word embedding!).</p> <p>I’ll then discuss how the concept can be applied to recommendation engines, think shopping cart, to explain why certain items have been shown to us.</p> <p>Bio:</p> <p>Dan is working in the MLOps space for Rovco, deploying machine learning at scale on Kubernetes. His background includes the technical leadership of large Hadoop deployments, building a single view of a customer through knowledge graphs and degrees in both Computer Science and Data Science.</p> <p>-----<br/>Avon Huxor - TBD</p> <p>Bio:</p> <p>After some twenty years working as a research astronomer, I moved into data science and machine learning. I currently work on analysis of texts from medical documents at the University of Bristol.</p> <p>-----</p> <p>Please note the talks will be filmed.</p> <p>The Bristol ML meet-up is defined by its community. If you have ideas for speakers, venues or suggestions for how we can in anyway improve please don't hesitate to contact one of the organisers.</p> <p>This is a going to be a really great set of talks, hope to see you there!</p> <p>All attendees, speakers, sponsors, organizers and volunteers at this meetup are required to agree with the following code of conduct. We expect cooperation from all participants to help ensure a safe environment for everybody.</p> <p>Our meetups are dedicated to provide a safe and harassment-free experience for everyone, regardless of gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), or technology choices.<br/>We do not tolerate harassment of participants in any form. Weapons or any other items used for the purpose of causing injury or harm to others are forbidden at the venue.</p> <p>Harassment includes offensive verbal comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.</p> <p>Participants asked to stop any harmful behaviour are expected to comply immediately. If a participant engages in harmful behaviour, the organizers may take any action they deem appropriate, including warning the offender or expulsion from the event with no refund.<br/>If you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact an organiser immediately.</p> ",
    "end_time": 1579723200,
    "link": "https://www.meetup.com/Bristol-Machine-Learning/events/266941531/",
    "location": {
        "address": "Broad Plain",
        "city": "City of Bristol",
        "country": "gb",
        "latitude": 51.45429992675781,
        "longitude": -2.5827720165252686,
        "name": "Broad Plain"
    },
    "org": "bristol-bachine-learning",
    "start_time": 1579716000,
    "title": "Bristol Machine Learning #11"
}