{
    "description": "<p>We're very pleased to announce that our next meet-up is going to be hosted by Candide at their Bristol offices - <a href=\"https://candidegardening.com/\" class=\"linkified\">https://candidegardening.com/</a></p> <p>Schedule:</p> <p>18:00 - Doors/Food/Drinks/Networking<br/>18:30 - Opening Introduction/Community Messages<br/>18:40 - Brian Flynn - Understanding quantum physics with machine learning<br/>19.15 - Janina Hoffmann - On deciding how to decide: Implications from a mixtures-of-expert approach<br/>20:00 - Wrap up and head to a nearby pub</p> <p>Talks:</p> <p>Brian Flynn - \"Understanding quantum physics with machine learning\"<br/>An isolated system of interacting quantum particles is described by a Hamiltonian operator. Hamiltonian models underpin the study and analysis of physical and chemical processes throughout science and industry, so it is crucial they are faithful to the system they represent. However, formulating and testing Hamiltonian models of quantum systems from experimental data is difficult because it is impossible to directly observe which interactions the quantum system is subject to. Here, we propose and demonstrate an approach to retrieving a Hamiltonian model from experiments, using unsupervised machine learning. We test our methods experimentally on an electron spin in a nitrogen-vacancy interacting with its spin bath environment, and numerically, finding success rates up to 86%. By building agents capable of learning science, which recover meaningful representations, we can gain further insight on the physics of quantum systems.</p> <p>Bio:<br/>Brian is a PhD candidate in Quantum Engineering at the University of Bristol.</p> <p>-----<br/>Janina Hoffmann – “On deciding how to decide: Implications from a mixtures-of-expert approach“<br/>Data science often treats machine learning algorithms as a black box, ignoring how the model reached its conclusion. In contrast, cognitive science has a longstanding history of drawing inferences about (human) decision processes by using the very same algorithms as models of the mind. As such, these models can provide important insights into why people fail to make the “right” choice or engage in risky behaviour.<br/>In this talk, I will first provide a brief overview about how humans reach decisions and adapt their decision strategies to the task at hand. Using strategy selection as an example, I will then highlight how instantiating psychological theory within machine learning models allows to draw conclusions about human decision processes. Finally, I will outline implications for the broader community.</p> <p>Bio:<br/>Janina works as a Lecturer in Decision Science at the University of Bath. Trained as a cognitive scientist, she uses model-based reinforcement learning to explain human decision making.</p> <p>-----</p> <p>The Bristol ML meet-up is defined by its community. If you have ideas for speakers, venues or suggestions for how we can in anyway improve please don't hesitate to contact one of the organisers.</p> <p>All attendees, speakers, sponsors, organisers and volunteers at this meetup are required to agree with the following code of conduct. We expect cooperation from all participants to help ensure a safe environment for everybody.</p> <p>Our meetups are dedicated to provide a safe and harassment-free experience for everyone, regardless of gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), or technology choices.<br/>We do not tolerate harassment of participants in any form. Weapons or any other items used for the purpose of causing injury or harm to others are forbidden at the venue.</p> <p>Harassment includes offensive verbal comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.</p> ",
    "end_time": 1584561600,
    "link": "https://www.meetup.com/Bristol-Machine-Learning/events/268881402/",
    "location": {
        "address": "40 Queen Square",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.44968795776367,
        "longitude": -2.5954511165618896,
        "name": "Candide Limited"
    },
    "org": "bristol-bachine-learning",
    "start_time": 1584554400,
    "title": "Bristol Machine Learning #13 - Talks"
}