{
    "cancelled": false,
    "description": "<p>Our next online meet-up is going to be a presentation from Henry Charlesworth.</p> <p>Henry is a Machine Learning Scientist at Rowden Technologies. He is also a visiting research fellow at Warwick University specialising in Deep Reinforcement Learning.</p> <p>His talk is titled: \"Solving Dexterous Manipulation Tasks with Trajectory Optimisation and Reinforcement Learning\"</p> <p>Here's a summary of the talk:</p> <p>\"A majority of robots in industry today are only able to use simple parallel jaw grippers for object manipulation. Whilst this is largely fine when operating in highly structured environments (e.g. most factories), to develop more autonomous robots that can perform a wider variety of tasks in more complex/unstructured environments it will be necessary for them to be able to use considerably more sophisticated manipulators.</p> <p>By far the most versatile and sophisticated manipulator we know of is the human hand, which motivates trying to build robotic hands that can mimic its capabilities and perform similarly complicated manipulation tasks.</p> <p>However, working with these kinds of robotic hand poses considerable challenges for traditional robotic control methods because of the complex, discontinuous contact patterns that arise between the hand and the object being manipulated (as well as the inherent difficulty in requiring the precise coordination of numerous joints). This motivates the use of methods such as reinforcement learning and gradient-free trajectory optimisation that can learn directly through interactions without requiring an accurate physics model of the hand-object system.</p> <p>In this talk I will give an overview of the work that has been done so far in applying these techniques to solving dexterous manipulation tasks. I will then summarise some of the research I did as a postdoc whilst at the University of Warwick which looked at applying these techniques to training a simulated robotic hand to perform tasks such as throwing and catching various different objects, as well as learning to spin a long pen between its fingers.</p> <p>This work was recently accepted at ICML 2021.\"</p> <p>Here are the details of the zoom call:</p> <p><a href=\"https://cookpad.zoom.us/j/98492292451?pwd=b2pCQ1d2UkhBdzBKd2UzSHlaOHBtQT09\" class=\"linkified\">https://cookpad.zoom.us/j/98492292451?pwd=b2pCQ1d2UkhBdzBKd2UzSHlaOHBtQT09</a></p> <p>Passcode:[masked]</p> <p>Look forward to seeing you there!</p> ",
    "end_time": 1624624200,
    "link": "https://www.meetup.com/bristol-machine-learning/events/278894469/",
    "location": null,
    "org": "bristol-bachine-learning",
    "start_time": 1624620600,
    "title": "Bristol Machine Learning #15 - Online Talk"
}