{
    "cancelled": false,
    "description": "<p>The first meetup since the re-boot and we have excellent talks and plenty of swag from our lovely sponsors! Come join us and eat NACHOS!</p> <p><b>--- TALK 1 ---<br/></b></p> <p><b>Topic: </b>Jaimal Chohan - The life of a thousand orders, a story about distributed .NET</p> <p><b>Description: </b>Building a distributed system for delivering something as simple as takeaway food <br/>presents interesting questions, like why would you do that?! And, how are you still employed?! <br/>I'll be answering both and much more while exploring the mechanisms we use to scale a start-up to a global leader.</p> <p><b>Bio: </b>Jaimal likes building scalable and available distributed systems which can be delivered continuously. He's made a lot of mistakes and hopes that one day he'll get this right. Meanwhile he'll keep on making mistakes for for now he does that at JUST EAT.</p> <p><b>--- TALK 2 ---</b></p> <p><b>Topic:</b> Peter Major - Native mobile cross-platform with Xamarin.Forms and C#</p> <p><b>Description: </b>Using Xamarin on a project can reduce time to market by writing shared code in C# once rather than Java and Objective-C for Android and iOS. Until recently, when developing an application with Xamarin you still used native UI tools for each mobile OS on top of your shared C# code. For some types of applications, shared code is minimal and the UIs are the biggest part of the application. Since the release of Xamarin Forms, shared UI code across platforms is now possible.</p> <p><b>Bio: </b>Peter has been developing software since 1996, using technologies such as VB, Delphi, C#, Azure, AngularJS and, most recently, Xamarin. He believes in challenging the use of entrenched tools as new tools arrive that promise increased productivity and value. Peter currently builds cool stuff for JUST EAT with AWS and Xamarin.</p> ",
    "end_time": 1429734600,
    "link": "https://www.meetup.com/dotnetsouthwest/events/221392318/",
    "location": null,
    "org": "dotnetsouthwest",
    "start_time": 1429725600,
    "title": "Jaimal Chohan - Distributed .NET / Peter Major - Cross-platform Mobile Xamarin"
}