{
    "date": 1435255200,
    "description": "<p>It's time for another wonderful geek-out. This time we are breaking out the big-guns and looking at Akka.NET (seriously cool actor framework for clustered systems) and looking into how Microsoft is releasing some amazing tooling for deploying software into production!</p> <p>As always there will be plenty of pizza and beer (and soft drinks) as well as swag from our lovely sponsors! Who knows what you could win!! So, tell your friends and work collegues, get the news out, it's your community and the more people we get involved the better it can be!</p> <p><b>--- TALK 1 --- </b></p> <p><b>Topic:</b> Anthony Brown - A lap around Akka.Net</p> <p><b>Description:</b> The actor model has really started to pick up steam in the world of .Net, first with Akka.Net, then Orleans and now Service Fabric. This talk aims to provide an introduction to exactly what the actor model is and why we need this 40 year old design in modern codebases. We'll look at how Akka.Net lets you easily build applications which are elastic, fault-tolerant but most importantly responsive. We'll look at what Akka.Net is and how it implements the actor model and we'll look at how the blocks fit together to help make building complex applications easier.</p> <p><b>Bio:</b> Anthony's an F# and C# developer whose main interests are the cloud, games and the Internet of Things. He is currently a Masters student at the University of Southampton where he researches scalable web service solutions for the Internet of Things.</p> <p><b>--- TALK 2 ---</b></p> <p><b>Topic:</b> Matteo Emili - Dealing with the Release in the Microsoft world</p> <p><b>Description:</b> We often hear from others how cool is to release a number of times a day, to have a release pipeline in place, to replace our microservices in a fingers' snap - forgetting the dreaded Friday evening deployment window.It is cool, but we come back at our daily situation where even an XCopy is hard. Starting from the ground up, how can we achieve what others do without messing up with the existing process in the company, and without interfering (too much) with others' work? Is it going to be an enormous burden to setup and maintain? Can we do that in the background with a minimal footprint?Well, let's have a look!</p> <p><b>Bio:</b> Matteo Emili is a Microsoft MVP for Visual Studio ALM since 2010. Former Microsoft Student Partner (youngest ever in Italy and the first ever in being both MSP and MVP, in 2010 at the age of 19), his experience spreads from Universities, going through small businesses to the largest worldwide enterprises. His focus on software engineering tied with business processes led him to have a deep knowledge of different topics and technologies, from development to virtualization, in particular covering areas of integration between Developer teams and other entities like Developer Operations teams and PMOs.He currently works for Dell Software as an Application Lifecycle Management expert.</p> ",
    "link": "https://www.meetup.com/dotnetsouthwest/events/222317428/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUSTEAT Technology"
    },
    "org": "dotnetsouthwest",
    "title": "Anthony Brown -  Akka.Net / Matteo Emili - Release in the Microsoft world"
}