{
    "description": "<p>It's only AUGUST! The sun is out, the cider is flowing and we have 2 fantastic talks to make your Wednesday even better!</p> <p>As always there will be plenty of pizza and beer (and soft drinks) as well as swag from our lovely sponsors! Who knows what you could win!! So, tell your friends and work colleagues, get the news out, it's your community and the more people we get involved the better it can be!</p> <p><b>--- TALK 1 --- </b></p> <p><b>Topic:</b> Owain Williams - Can you keep a Secret? </p> <p><b>Description:</b> For thousands of years we have been trying to find ways to keep information secret and work out what other people's secret information is. Today we have cryptographic algorithms that our own government's security and intelligence organisations claim they can't crack. However, security breaches, compromised passwords, stolen credit card details, etc. feature in the news regularly, and the perpetrators aren't government experts, they're amateurs.</p> <p>Can you keep a secret? The anecdotal evidence would suggest the answer is a resounding no! In this talk I'll introduce you to some cryptographic principles and show how you can make use of them in .NET and how they can be used correctly.</p> <p><b>Bio:</b> Owain Williams is the Technical Lead of Giftcloud, a product backed by the creators of Vouchercloud. He has been a professional software developer since 2001 and has worked on a wide range of projects and technology stacks, from small software houses to publicly listed international companies.<br/>He has experience of delivering software into a range of different environments including e-commerce websites, email marketing organisations, public sector customers and open source projects. He was part of the team that first started using the NHS data spine and helped shape the way encryption was used within it. He has also designed and implemented secure systems for several companies.</p> <p>Born in London, brought up in South Wales, now living with his wife in Bristol, Owain is a well-travelled man and enjoys weekend's away, cooking &amp; eating, loud shirts &amp; colourful trousers and is currently learning to fly light aircraft.</p> <p><b>--- TALK 2 ---</b></p> <p><b>Topic:</b> Marco De Bortoli - Deploying .NET with Vagrant &amp; Packer</p> <p><b>Description:</b> Little projects like JustBakeIt are what happens when you take an engineer who stopped working with Microsoft technologies back when ASP was at its version 3.0 and you put him in front of the 21st century reality of Windows 2012 r2 and the new Enterprise world of the cloud computing. Debo will take us in a tour through the tools he used to make is “new” life a bit easier than it was when he started the journey.</p> <p><b>Bio: </b>Marco aka Debo is currently working for Just Eat as Senior Software Engineer, he is a  Zend PHP Certified Engineer and has over 14 years experience in different sectors of the IT industry. Marco has also been involved in large-scale eCommerce implementations for Warner Music International, Kurt Geiger and the French fashion brand, Kookai. Marco is passionate about best practices that facilitate great software design and implementation. Based in London, Marco can be found attending interesting meetups around the city. If you don’t speak code, talk to me about my other hobbies: whisky, pool and bicycles just to mention a few.</p> ",
    "end_time": 1440018000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/224369860/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUSTEAT Technology"
    },
    "org": "dotnetsouthwest",
    "start_time": 1440007200,
    "title": "Owain Williams -  Can you keep a Secret? / Marco De Bortoli - Deploying .NET"
}