{
    "description": "<p>It's the witching month. Ghosts and Ghouls will be out in force within days. What better way to beat the evil spirits than with a delightful evening of geekery and community interest?!! Again, we have 2 cracking talks!</p> <p>As always there will be plenty of pizza and beer (and soft drinks) as well as swag from our lovely sponsors! Who knows what you could win!! So, tell your friends and work collegues, get the news out, it's your community and the more people we get involved the better it can be!</p> <p><b>--- TALK 1 --- </b></p> <p><b>Topic:</b> James Gaisford -  Penetration Test?! Oh god no! </p> <p><b>Description:</b> For once, your project is on time, on budget and all your stakeholders love you. Then they drop the bomb “We have a penetration test planned for 2 weeks time. KTHXBYE”. You repair to Visual Studio and begin crying. But you should be see it as an opportunity not a threat. Penetration tests are there to help. This talk will walk you through the common vulnerabilities a penetration test may expose in your <a href=\"http://asp.net/\">asp.net</a> application as well as how to fix them. Prepare to be scanned!</p> <p><b>Bio:</b> James is a veteran full stack developer, who has spent the last 10 years focusing on <a href=\"http://asp.net/\">asp.net</a> and javascript. Having been subjected to a number of security scans and surviving to tell the tale, James has started to focus on securing <a href=\"http://asp.net/\">asp.net</a> applications. Outside of work James has his hands full with two daughters and numerous failed carpentry projects. Contact him via Twitter @jamesgaisford.</p> <p><b>--- TALK 2 ---</b></p> <p>Topic: Richard Wilde - Testing Web UI</p> <p>Description: Unit testing helps us when writing any sort of application, however we often we end up writing unit tests for small pieces of logic that don't really matter and sometimes miss out on the bigger picture. We tend to shy away from Web UI testing as the feedback loop is just too slow. In this presentation we will look at a toolset that gives us both end-to-end testing that aims to give us far faster feedback.  </p> <p>Welcome to the CasperJS a navigation and testing utility written in JavaScript, which plays nicely alongside PhantomJs, a headless WebKit browser.</p> <p>Bio: Richard started programming during the home computing era with a ZX81. He has been running his own software company called <a href=\"http://wildesoft.net/\">wildesoft.net</a> since 2004 and has a lot of experience delivering Microsoft solutions for all aspects of businesses. He is also the co-founder of Smart Devs a user group based in Hereford.</p> ",
    "end_time": 1445547600,
    "link": "https://www.meetup.com/dotnetsouthwest/events/224399026/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUSTEAT Technology"
    },
    "org": "dotnetsouthwest",
    "start_time": 1445535000,
    "title": "James Gaisford -  Penetration Test?! Oh god no! / Richard Wilde - Testing Web UI"
}