{
    "cancelled": false,
    "description": "<p>Happy New Year! We have a special .NET meetup to welcome the brand new rotation of the earth around our lovely sun! Troy Hunt will be doing a meetup organised by the guys at JustEat!</p> <p>As always there will be plenty of pizza and beer (and soft drinks) as well as swag from our lovely sponsors! Who knows what you could win!! So, tell your friends and work colleagues, get the news out, it's your community and the more people we get involved the better it can be!</p> <p><b>--- TALK --- </b></p> <p><b>Topic:</b> Troy Hunt - What I've Learned from 220 Million Breached Records</p> <p><b>Description:</b> We can learn a huge amount about security by reviewing the failures of those who have come before us. In maintaining the data breach notification service \"Have I been pwned?\", I've dealt with literally hundreds of millions of breached records over time and have seen some fascinating things. In this talk we'll look at the patterns organisations who suffered data breaches were using, the types of data that were exposed and the things they could have done to protect themselves from malicious actors.</p> <p><b>Bio:</b> I'm Troy Hunt, an Australian <a href=\"http://mvp.microsoft.com/en-us/overview.aspx\">Microsoft Most Valuable Professional</a> for Developer Security. I don't work for Microsoft, but they're kind enough to recognise my community contributions by way of their MVP program which I've been an awardee of since 2011. I get to interact with some fantastic people building their best products and then share what I know about creating secure applications for the web with the broader community. <a href=\"http://www.troyhunt.com/p/about.html\">Read More!</a></p> ",
    "end_time": 1453932000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/226652888/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUSTEAT Technology"
    },
    "org": "dotnetsouthwest",
    "start_time": 1453921200,
    "title": "Troy Hunt - What I've Learned from 220 Million Breached Records"
}