{
    "cancelled": false,
    "description": "<p><b>Schedule: </b><br/>6:30-7:00 - Networking &amp; Refreshments <br/>7:00-7:15 - Lighting Talk <br/>7:15-8:15* - Featured Talk</p> <p><b>Lighting Talk: </b>What's F# all about, and how you can get involved by Stuart Lang</p> <p><b>About Stuart:</b><br/>Stuart has worked as a .NET developer for 6 years in the Southwest of England. He is currently working as a Senior Software Engineer at Just Eat. Stuart is passionate about good software practices, sharing knowledge within teams and developer communities, F# and all things .NET, web technologies, Modern JavaScript &amp; Typescript.</p> <p><b>Featured Talk:</b> Getting started with Aurelia by Sean Hunter</p> <p>We hear about a new JavaScript framework being created every other day. With the sheer volume of new tools to learn it can be difficult to decide what is worthwhile spending time on, what is a short lived fad, and how the new tools fit into our existing toolset.</p> <p>Over the past year we’ve seen a trend toward creating single page web applications as a collection of modular components. AngularJS was the first framework to really formalise this concept, with ReactJS taking the concept further to really make it a first class citizen. Aurelia provides a convenient set of conventions and tools, making it straight forward to build web applications in this way, while also providing a standard set of plugins for things like routing and validation that save us a lot of time when creating large scale applications.</p> <p>In this session, we’ll take a deep dive into what Aurelia is, where it fits into the SPA framework landscape, and why it might be a useful tool to add to your web development tool-belt.</p> <p>The session will cover the following topics:</p> <p>•  Getting started<br/>• Views and View Models<br/>• Configuration and Routing<br/>• Templates and Binding<br/>• Connecting to a backend data store or web service</p> <p><b>About Sean:<br/></b>I’m a software developer with a passion for learning and sharing what I know with the community. I’ve recently moved to the sunny Worcester after 6 years of web development in Melbourne Australia and am working as a software developer with PCA Predict on the Microsoft stack, specialising in all things JavaScript.</p> <p><b>Meeting Sponsors: Just Eat</b></p> <p><b>Don't forget to follow us on Twitter at <a href=\"https://twitter.com/dotnetsouthwest\">@dotnetsouthwest</a> for news and updates.<br/></b></p> ",
    "end_time": 1466107200,
    "link": "https://www.meetup.com/dotnetsouthwest/events/230763266/",
    "location": null,
    "org": "dotnetsouthwest",
    "start_time": 1466098200,
    "title": "Getting started with Aurelia by Sean Hunter"
}