{
    "description": "<p><b>Featured talk: Machine Learning for Muggles by Martin Kearn</b></p> <p>Artificial Intelligence is the latest hotness. Machine Learning sits behind artificial intelligence and on the surface it may seem like a deeply technical, scientific topic. We are here to tell you that it is more accessible than you think. We’ll look at some of the basics around the Azure Machine Learning service. We’ll also look some of the Microsoft Cognitive Services APIs which make it very easy to implement artificial intelligence ‘smarts’ into your application with simple, standard REST calls.</p> <p>If you enjoyed <a href=\"https://www.meetup.com/dotnetsouthwest/events/233414466/\">Ben Paul's recent talk on conversational bots</a> then this one should be of particular interest to you.</p> <p><b>About Martin Kearn:</b></p> <p>Martin is a technical evangelist for Microsoft based in the UK. In his role, Martin talks with customers, partners, start-ups and anyone who is willing to listen about developing applications on the Microsoft platform. This includes Windows, Office, Microsoft Azure and Web technologies including ASP.net and the Edge browser. Martin has been working with Microsoft development technologies since the late 90's and has been working for Microsoft directly since 2005.</p> <p><b>Lightning talk: Interesting Insights Into Ionic by Ross Scott</b></p> <p><b>About Ross Scott:</b></p> <p>Ross is a software consultant with 14 years years of experience in .Net and web based technologies. He is keen on Typescript, Azure and mobile apps which usually forms the basis of his talks. Ross is also one of the organisers on DDD South West which is now in its 7th year.</p> <p><b><br/></b></p> ",
    "end_time": 1484688600,
    "link": "https://www.meetup.com/dotnetsouthwest/events/236635453/",
    "location": {
        "address": "Broad Quay House, Broad Quay, Bristol, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUSTEAT Technology"
    },
    "org": "dotnetsouthwest",
    "start_time": 1484677800,
    "title": "Machine Learning for Muggles by Martin Kearn"
}