{
    "cancelled": false,
    "description": "<p>We'll be taking part in the .NET Tour UK 2020, a series of concurrent community meetup events with amazing .NET speakers. The Tour details can be found here: <a href=\"https://dotnettour.github.io/UKTour2020/\" class=\"linkified\">https://dotnettour.github.io/UKTour2020/</a>.</p> <p>⌚️ Doors open at 18:00, and we will be starting promptly at 18:20</p> <p>❗️ Please note this event will be hosted in the wonderful ALD Automotive office, not in our usual city centre locations.<br/>Parking is available onsite. Turn left after you come through the barrier and park in front of reception. ❗️</p> <p>👩‍💻 Speakers and Talks</p> <p>🎤 Dean Ward - Building Stack Overflow for Teams</p> <p>Principal developer on the Architecture Team at Stack Overflow working remotely out of Brighton, UK.</p> <p>Abstract:<br/>How we scaled Stack Overflow for extreme multi-tenancy. A whistle stop tour of tweaking code, infrastructure and everything else we could think of to make a 10 year old monolith play well in a new and operationally very different environment.</p> <p>⚡️ Stuart Lang - Lightning talk - MSBuild Structured Log Viewer</p> <p>🎤 Tim Seaward - Digging into the Bedrock framework</p> <p>By day works in a place that he can’t mention on electronic trading things he can’t talk about. By night a .NET open source contributor that loves all things networking and protocols . Based in UK.</p> <p>Abstract:<br/>After an abridged history of pipelines and Bedrock Framework, we will look at a basic implementation today. Then after getting our hands a little dirty looking at the internals we will discuss what the future holds for Bedrock and not only what Bedrock can do for you but what you can do for Bedrock.</p> ",
    "end_time": 1580245200,
    "link": "https://www.meetup.com/dotnetsouthwest/events/267936028/",
    "location": {
        "address": "Oakwood Drive Emersons Green",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.503170013427734,
        "longitude": -2.4721479415893555,
        "name": "ALD Automotive, Bristol (Head Office)"
    },
    "org": "dotnetsouthwest",
    "start_time": 1580234400,
    "title": ".NET Tour UK 2020 Special Event"
}