{
    "cancelled": false,
    "description": "<p>iO Associates are delighted to bring you the next in the series of our .Net Meetups – \"Developing for Windows AND Linux using Windows 10 and WSL\".</p> <p>Taking place - Thursday 9th July at 7pm.</p> <p>We will be joined by special guest speaker, Scott Hanselman, Partner Program Manager at Microsoft.</p> <p>Join Scott Hanselman as he walks us through the state of the art of Linux on Windows. He will be answering questions such as - can you really use Windows to develop Linux apps?How real is WSL (Windows Subsystem for Linux), and how close is it to reality?</p> <p>There will be plenty of live demos in this highly technical session to explain what’s possible, as well as what’s not.</p> <p>We will host a Q&amp;A with our special guest speaker and open the floor to you for questions.</p> <p>Agenda</p> <p>7:00 pm: Introduction by iO Associates and Speakers<br/>7:05 pm: Scott Hanselman - ‘Developing for Windows AND Linux using Windows 10 and WSL’<br/>8:00 pm: Q&amp;A – questions from the floor<br/>8:15 pm: Concluding comments and end</p> <p>Click for registrations:</p> <p><a href=\"https://us02web.zoom.us/meeting/register/tZApfuChrT4tGNbb8AZXaC_eB7MAanr0b2l9\" class=\"linkified\">https://us02web.zoom.us/meeting/register/tZApfuChrT4tGNbb8AZXaC_eB7MAanr0b2l9</a></p> <p>We hope you can join us and please get in touch at [masked] with any questions or suggestions on future virtual meetups.</p> <p>iO Associates, tech and digital recruitment specialists, have always been a very active member of multiple Meetup groups across the UK. It’s a challenging time for everyone and at iO we’re really keen to help keep our community positive and engaged hearing from the best speakers on the topics of your choice so encourage you to share this with your team and the wider community.</p> <p>In addition, if there’s anything we can help you with in regards to sourcing candidates or finding a new role please do also get in touch.</p> <p>Many thanks,</p> <p>Michael - iO Associates</p> ",
    "end_time": 1594323000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/271352466/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "dotnetsouthwest",
    "start_time": 1594317600,
    "title": "(Aff)Developing for Windows AND Linux using Windows 10 and WSL - Scott Hanselman"
}