{
    "cancelled": false,
    "description": "<p>We have a very exciting night of talks...</p> <p>Clifford Agius - Freelance DotNet developer and Microsoft MVP I work mostly in Mobile with Xamarin as well as IOT projects around tracking and data collection from remote sensors. When not working on development I am an Airline pilot flying the BOeing 787 around the world which is really just managing 1000 computers flying in close formation.</p> <p>Talking About - Brief introduction to the WIlderness Labs Meadow F7 board which is an IOT board that runs Dot Net. Yes you can write your C# and deploy to a 70mm x 20mm battery powered IOT board that has Wifi &amp; Bluetooth onboard. Using Net Std2.0 all your favourite Nugets can come along for the ride as well. This will be a hello world from Install to running.<br/>----------------------------------------------------------------------------------------------------<br/>Dan Clarke - Dan Clarke is an independant software developer specialising in .NET and Azure. He runs the .NET Oxford and Azure Oxford user-groups, blogs at danclarke.com, and is also a Microsoft MVP.</p> <p>Talking About - A lot of .NET devs have probably heard of the MediatR library, but never had the chance to use it, or understand what it's for. This lightning talk will show how to use it, but also more importantly, WHY you may want to use it and what benefits it can provide to your codebase.<br/>----------------------------------------------------------------------------------------------------<br/>Dushyant Priyadarshee - Software Engineer with passion for agile practices, DevOps, Microsoft technologies and all things Azure. Currently working as Senior Specialist Platform Engineer for NewDay London.</p> <p>Talking About - Xamarin &amp; Admob, monetizing an android app. The basics of how to get admob to show an advert on your android app. Intro into Google's policies and how to avoid some early policy violations.<br/>----------------------------------------------------------------------------------------------------<br/>Christos Matskas &amp; John Patrick Dandison - Product Managers in the Dev Advocacy team, helping devs do awesome things with Microsoft Identity. More to follow if we're selected</p> <p>Talking About - Introduction to the Microsoft Identity Platform<br/>----------------------------------------------------------------------------------------------------<br/>Stefan Pölz - My passion is to practice Clean Code and test-driven development in order to build maintainable software in an ever-evolving team, supported by tools from the .NET Ecosystem. I love to attend and speak at public developer events and author open source projects, complementing my expertise in professional software development.</p> <p>Talking About - What is mutation testing and how it can improve the effectiveness of test suites. Enumerate tools that enable mutation testing and showcase one which can be continuously integrated with Azure Pipelines/GitHub Actions.<br/>----------------------------------------------------------------------------------------------------<br/>Stuart Lang - Stuart is a Principal Engineer at Just Eat, and a Microsoft MVP. He loves all things .NET, and blogs at stu.dev</p> <p>Talking About - In this talk I'll introduce Playwright &amp; PlaywrightSharp. Playwright is a browser automation library. I'll be contrasting Playwright with existing libraries, and demonstrating how it differs.</p> ",
    "end_time": 1606338000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/273278637/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "dotnetsouthwest",
    "start_time": 1606330800,
    "title": "Virtual - Lightning Talks"
}