{
    "cancelled": false,
    "description": "<p>iO .Net Virtual Meetup - Scott Hunter, VP Director of Program Management at Microsoft - .Net 6 and Cloud Native</p> <p>iO Associates are excited to announce our next .Net Virtual Meetup will be on Monday 4th October at 7pm. We will be joined again by Scott Hunter, Director of Programme Management at Microsoft, who will be delivering a special talk with us.</p> <p>About the speaker:</p> <p>Scott Hunter is responsible for the Microsoft’s .NET platform, which includes the .NET Framework, .NET Core, ASP.NET, Entity Framework, .NET Tools, Web Tools and the managed languages (C#, F# and VB). Prior to leading the .NET Platform, Hunter helped the Azure Developer Experience team build the Azure SDK’s, App Service Tooling, Azure Redis Cache, Azure API Management, ASP.NET, Entity Framework and the Web Tooling. In his spare time he loves hiking mountains around the world. Scott grew up in Little Rock, AR and went to college in Fayetteville before heading to the West Coast for a startup and Microsoft.</p> <p>iO Associates, tech and digital recruitment specialists, have always been very active members of multiple Meetup groups across the UK. We’re really keen to help keep our community positive and engaged hearing from the best speakers on the topics of your choice so encourage you to share this with your team and the wider community.</p> <p>We hope you can join us and please get in touch at [masked] with any questions or suggestions on future virtual meetups.</p> <p>In addition, if there’s anything we can help you with in regards to sourcing candidates or finding a new role please do also get in touch.</p> <p>Thanks,</p> <p>Michael Collins - iO Associates</p> ",
    "end_time": 1633377600,
    "link": "https://www.meetup.com/dotnetsouthwest/events/280799845/",
    "location": null,
    "org": "dotnetsouthwest",
    "start_time": 1633370400,
    "title": "iO .Net Virtual Meetup - Scott Hunter (Aff) - .Net 6 and Cloud Native"
}