{
    "cancelled": false,
    "description": "<p>We are delighted to announce **.Net South West**'s first in-person Meet Up since before the pandemic. It has been a long time coming!</p> <p>The brilliant **Cliff Agius** will be giving his talk on **.NET MAUI What/How and Why**.</p> <p>Kick off will be 6:30pm with pizza and beers/refreshments and the talk will begin at 7pm. Thank you so much to our friends **BJSS**, who will be hosting at their offices on **Victoria Street, Bristol, BS1 6DP**</p> <p>**The Speaker:**</p> <p>Clifford Agius, Freelance .NET Developer and also blogs from time to time, is currently a two-time Developer Technologies MVP, specialising in Xamarin/.NET MAUI and IoT. By day, an airline pilot flying Boeing 787 aircraft around the world and when not doing that, Clifford freelances as a .NET developer. An active member of the .NET community, he is a regular speaker at conferences around the world.</p> <p>**The Talk:**</p> <p>You may have heard the Buzz about .NET MAUI or maybe you have heard of Xamarin and all the monkeys but in this session we will cover.</p> <p>**What -** What was Xamarin and now .NET MAUI and how can they help you develop Apps for your business/clients. And what the hell does MAUI stand for as it's not that nice sunny island we all want to go on holiday too...</p> <p>**How -** How you as a .NET developer can use your existing .NET C# skills to develop and build Apps that run not just on the desktop but also on mobile platforms like the phone in your hand.</p> <p>**Why -** There are 5 Billion mobiles in use around the world split between the App Stores of iOS and Android but do you want to learn Java/Kotlin for Android and then Swift/ObjectiveC for iOS? Do you really want 2 separate codebases? No of course you don't your a .NET Developer so lets use MAUI.</p> <p>The session will show how to build a Mobile app how all the parts come together and how to deploy the App to the device in your pocket.</p> <p>We will show how to get the tooling set-up and then how the Single Project is leveraged to run your C# code and using tools like Hot Reload we can live debug on actual Mobile Devices.</p> <p>A fun session playing with Mobile Apps and for added geekery Aircraft facts and Figures because why not...</p> <p>If you have any questions let us know, we're looking forward to seeing familiar faces from the community again as well as welcoming new ones!</p> ",
    "end_time": 1654630200,
    "link": "https://www.meetup.com/dotnetsouthwest/events/286011386/",
    "location": {
        "address": "90 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45127868652344,
        "longitude": -2.586751937866211,
        "name": "BJSS"
    },
    "org": "dotnetsouthwest",
    "start_time": 1654623000,
    "title": ".NET MAUI What/How and Why with Cliff Agius - *Face-to-face*"
}