{
    "cancelled": false,
    "description": "<p>.Net South West is back for another in-person Meet Up, with Dee Bolt, who is giving his talk 'What the JWT?! Securing your app with Microsoft Identity Web'.</p> <p>This will be on Tuesday 9th August at Huboo's office, 41 Corn Street, Bristol, BS1 1HT. We will look to get started on pizzas and beers/refreshments for 6:30pm and the talk starting at 7pm.</p> <p>**The talk:**</p> <p>Whether it's a desktop, mobile, or web application, it is likely that you've had to secure your application to authenticated users.</p> <p>Traditionally, this was left to identity experts who knew the ins and outs of Open ID Connect (OIDC), OAuth, SAML, and generally were excited for the next published RFC. However now it is easier than ever for developers to secure their systems with a few lines of code and some configuration.</p> <p>In this session, we will explore and demonstrate how easy Microsoft has made securing your application against Azure AD, and Azure AD B2C using the Microsoft Identity Web C# SDK.</p> <p>After this session, you'll be able to get started with your authentication journey and understand, in general, how authentication works.</p> <p>**The speaker:**</p> <p>#### External Identity &amp; IAM Consultant</p> <p>I have been in the External Identity and Access Management space since 2020, helping clients architect and implement their Identity solutions and keeping their application secure.</p> <p>Prior to the identity ecosystem, I was a development consultant in travel and tourism (mainly C#) and a software and database analyst for a training company. My main skillset is around system architecture, identity, C#, and SQL.</p> <p>Other community contributions include the Azure Technical Contributor Program and Microsoft sponsored Identity discord channel.</p> <p>**If you can't make the event anymore, please change your RSVP to no, and if you are attending RSVP as yes!**</p> <p>Any questions let us know.</p> ",
    "end_time": 1660073400,
    "link": "https://www.meetup.com/dotnetsouthwest/events/286896599/",
    "location": null,
    "org": "dotnetsouthwest",
    "start_time": 1660066200,
    "title": "What the JWT?! Securing your app with Microsoft Identity Web with Dee Bolt"
}