{
    "cancelled": false,
    "description": "<p>November sees a return of our online meetup events, which we will still have from time to time when tehre's a particularly good guest speaker who can't make it over, and this one is a great one - hope to see you there!</p> <p>**Description**: Who doesn't like options? When we build .NET applications, we have a ton of options to how we build, what dependencies we leverage, and finally where we put those applications. We need to think about what app component model we use, like MVC, Blazor or Web API, and depending on that choice, it may dictate what platform we look to host our apps on.</p> <p>Whether you are building apps hosted on IIS or Kestrel (if you are fancy), leveraging containers, building serverless event-driven applications, to microservices, there are just tons of options out there. AWS provides services that provide options for all these modalities. Whether you are or are not familiar with AWS, this session will provide insight into how AWS is a great option for hosting all types of .NET Apps.</p> <p>**About the Speaker**: Isaac Levin is a .NET Developer Advocate at Amazon Web Services as well as a Microsoft MVP. He has over 10 years of experience working as a developer for the web, mostly in the Microsoft Ecosystem. Outside of work, he hosts a podcast called Coffee and Open Source where he interviews folks from across the tech industry as well as builds open source projects like PresenceLight and GitHub Stat Tracker. He lives outside of Seattle Washington and likes to wind down from work with his wife Ariana and his 2 sons Isaac and Avery.</p> <p>As this will be an online event, we will publish the zoom link in meetup closer to the time of the event.</p> ",
    "end_time": 1667941200,
    "link": "https://www.meetup.com/dotnetsouthwest/events/288796504/",
    "location": null,
    "org": "dotnetsouthwest",
    "start_time": 1667934000,
    "title": "[🌐 Online] .NET on AWS - Choose Your Own Adventure"
}