{
    "cancelled": false,
    "description": "<p>In a slight change to the discussed schedule, we're doing a virtual meetup in May, and returning to our in-person talks in June. The Link to the meetup will be made available closer to the event dat</p> <p>[🌐 Online]</p> <p>This month we're welcoming a really interesting speaker with a fascinating subject - Zoltán Lehóczky will be speaking about HastLayer - accelerating .NET code by running it on FPGA Hardware.</p> <p>**About the talk**</p> <p>Software is flexible, specialized hardware is extremely fast. So why not write software, then turn it into a computer chip? This is what the open-source Hastlayer ([<a href=\"https://github.com/Lombiq/Hastlayer-SDK](https://github.com/Lombiq/Hastlayer-SDK\" class=\"linkified\">https://github.com/Lombiq/Hastlayer-SDK](https://github.com/Lombiq/Hastlayer-SDK</a>)) does by transforming .NET software into electronic circuits. The result is faster and uses less power while you simply keep on writing software. You may not be able to tell just by looking at it but behind some function calls now actually embedded hardware is working! (You wonder how? Check out what FPGAs are!) In this demo-packed session we'll get an overview of what Hastlayer is, why it is useful for developers like you and how to write Hastlayer-compatible software. You can use Hastlayer on-premises, in the cloud or even onboard of spacecraft!</p> <p>**About the speaker - Zoltán Lehóczky**</p> <p>I embrace the idea of global collaboration, open knowledge, and open-source and live it mainly through the Orchard (Core) ASP.NET (Core) MVC-based content-management framework: I'm one of its developers, released dozens of open-source modules to it and even do work with it. You can see my open-source projects under my GitHub profile: <a href=\"https://github.com/Piedone\" class=\"linkified\">https://github.com/Piedone</a></p> ",
    "end_time": 1684872000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/293271926/",
    "location": null,
    "org": "dotnetsouthwest",
    "start_time": 1684864800,
    "title": "Turning .NET Code into computer chips with Hastlayer"
}