{
    "cancelled": false,
    "description": "<p>This month we have a tantalizing trio or terrific tech-talks, three totally transformative tutorials! These three top-speakers will tell us all about ...</p> <p>**Async method chaining in C#** by Andrew Poole, lead software engineer at Clearbank</p> <p>What if there was a way to declaratively describe a chain or flow of async methods, which can be used when handling API requests or when handling Messages from a service bus queue (or in fact anywhere!) We have found a way to achieve this and the logical conclusion is that related flows can be described in one place, in a single piece of orchestration, which is extremely clear and easy to navigate and debug.</p> <p>**Sustainable Demand Shifting** by Paul Bevis, CTO of FSP working at the forefront of digital transformation and cybersecurity</p> <p>Sustainability is about meeting the needs of the present – without compromising the ability of future generations to meet their needs. As software engineers, we have a responsibility to ensure minimise the carbon footprint of the software we write and not treat resources like CPU and storage as an infinite commodity.</p> <p>**What’s Coming in C# 12 and Beyond** by Stuart Lang, Microsoft MVP and Principal Engineer at Just Eat</p> <p>.NET Conf usually heralds the announcement of the latest version of the language, but with previews already out, Stu will be taking us through what we can expect with C# 12, which will be released as part of .NET 8 in November</p> <p>The lovely folks a Clearbank will be hosting us and providing us with refreshments, we've had some great events in their office, it should be awesome! We will also have prizes available from our sponsors, iO and Jetbrains for those who attend in person.</p> ",
    "end_time": 1695843000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/295562160/",
    "location": {
        "address": "25 Marsh Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45246505737305,
        "longitude": -2.596095085144043,
        "name": "Clearbank Limited"
    },
    "org": "dotnetsouthwest",
    "start_time": 1695835800,
    "title": "September - .NET South West Meetup Triple-Header"
}