{
    "cancelled": false,
    "description": "<p>**March .NET South West**<br/>Hey folks, we all return in March for another excellent double-header. We have 2 talks from fantastic speakers - Nurhak Kaya and Kevlin Henney</p> <p>**Integrating Cloudflare CDN with Umbraco Websites**<br/>In February 2012, the multinational retailer Walmart analysed to understand how website page performance affects e-commerce conversion rates. The website did $7.7 billion in sales, hit billions of page requests, and hosted millions of active product SKUs (Stock Keeping Units) in 2012.</p> <p>This study revealed a shocking relationship between page load times and conversion rates and there was a sharp decline in conversion rates as load times increased from 1 to 4 seconds.</p> <p>Cloudflare CDN (Content Delivery Network)'s performance and security features can dramatically improve load times for users accessing your static and dynamic websites, which can increase customer satisfaction, and potentially drive conversation rates up.</p> <p>In this talk, I will give you the details about how CDNs work, together with setting up Cloudflare CDN for your websites, key features of Cloudflare, creating page rules for full-page caching, and consuming the Cloudflare API programmatically to purge the Cloudflare cache to reflect Umbraco CMS content changes on the Front-end website and display the most up-to-date content to your users.</p> <p>**Program with GUTs**<br/>One of the greatest shifts in modern programming practices has been how programmers across many different domains, languages and environments have embraced unit testing. Good unit testing, however, is more than waving NUnit at your C# source. Tests help to make long-term product development cost effective rather than a cost centre, they underpin the effective flow of CI/CD and reduce failure demand on a team.<br/>But the discussion of unit testing goes further than simply writing tests: what makes a good unit test? It is not enough to have tests; poor quality tests can hold back development just as good tests can streamline it. This session looks provides a perspective on what good unit tests (GUTs) can look like with a couple of examples.</p> <p>**Speakers :**</p> <p>**Nurhak Kaya**<br/>I am a Solution Architect at Wattle in Bristol, UK. I'm an Umbraco MVP, a Certified Umbraco Master and an Umbraco CMS Community Team member.</p> <p>I'm an active Umbraco community member since 2014 and passionate about contributing to Umbraco CMS by working on issues, answering Umbraco forum or StackOverflow questions, writing articles, speaking at events like Umbraco meetups, conferences, UmbraCoffee, or organising events like umBristol meetups.</p> <p>**Kevlin Henney**<br/>Kevlin is an independent consultant, trainer, coder, speaker and writer based in Bristol. He's interested in development practices, programming languages, software design and developer culture, as well as a bunch of other things you can ask him about over a drink. He's co-authored two volumes in the *Pattern-Oriented Software Architecture* series and edited and contributed to a number of O'Reilly's *97 Things* books.</p> ",
    "end_time": 1711485000,
    "link": "https://www.meetup.com/dotnetsouthwest/events/299766807/",
    "location": {
        "address": "Finzels Reach",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45358657836914,
        "longitude": -2.5879149436950684,
        "name": "Amdaris"
    },
    "org": "dotnetsouthwest",
    "start_time": 1711477800,
    "title": "March .NET South West Double Header"
}