{
    "description": "<p>Join us at Cookpad HQ in Bristol, this month for two great talks. Expect another Ruby packed evening with great conversations, beers and bites to eat.</p> <p>Schedule</p> <p>18:30 - 19:00 - Arrive, grab a drink, some delicious locally supplied food and have a chat with fellow attendees.</p> <p>19:00-20:00 Talks</p> <p>Dave Evans (FreeAgent)<br/>\"Gumption Traps\"<br/>In this talk Dave will review the concept of the Gumption Trap introduced by Robert Pirsig in \"Zen and the Art of Motorcycle Maintenance\" and how to avoid its enthusiasm sapping properties in software development.</p> <p>Dave Evans currently leads the FreeAgent Analytics team with a focus on customer research and experimentation, data products to improve business decision making and customer experience, and the democratisation of data within the business. Before joining FreeAgent in Edinburgh, Dave worked at the University of California, San Diego and CERN.</p> <p>Christian Bruckmayer (Cookpad) - Performance monitoring your Rails app with InfluxDB</p> <p>Follow Christian on his journey how he used InfluxDB, an open source time series database, to spot and fix performance bottlenecks in his Rails applications.</p> <p>Christian Bruckmayer from Nuremberg, Germany, is one of the newest additions to the Cookpad team. He just recently migrated from the region of castles and mountains to the south west of England. Since 2014 he is an avid open source contributor hacking for instance on JRuby or openSUSE Linux. If he's not hacking Ruby, he's out doing what 'young' people do: travelling the world ✈️, skiing in the alps ⛷ or going to concerts of his favourite bands 🎸</p> <p>Slack</p> <p>If you like to join us on Slack please join <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> <p>Notices</p> <p>Please let us know in the comments of the event if you have any specific food allergies, dietary or access requirements so we can be sure to best accommodate everyone!</p> ",
    "end_time": 1550608200,
    "link": "https://www.meetup.com/south-west-ruby/events/258319917/",
    "location": {
        "address": "3 Broad Plain, BS2 0JP",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45417404174805,
        "longitude": -2.582395076751709,
        "name": "Cookpad"
    },
    "org": "south-west-ruby",
    "start_time": 1550601000,
    "title": "South West Ruby #14"
}