{
    "cancelled": false,
    "description": "<p>Join us at Cookpad HQ in Bristol, this month for great talks and discussions. Expect another Ruby packed evening with great conversations, beers and bites to eat.</p> <p>Schedule</p> <p>18:30 - 19:00 - Arrive, grab a drink, some delicious locally supplied food and have a chat with fellow attendees.</p> <p>19:00-20:30 Talks</p> <p>1. Using Google Sheets To Optimize Seeding Your Database (and more!)</p> <p>About the speaker</p> <p>Julie is a software engineer originally from the States but on assignment in London. She works at Stitch Fix, a ML-assisted personal styling company as a full-stack engineer (RoR, Golang, React). Prior to Stitch Fix, she worked as a full-stack engineer at Bigger Pockets in Denver, Colorado. Always building side-projects either just for fun or to be the next big thing, Julie enjoys the ease of using Ruby to get MVP's up and running. In her free time, she enjoys reading, country music, American sports, and finding dogs to pet.</p> <p>2. Practical Use Cases for Pattern Matching in Ruby 2.7</p> <p>About the speaker</p> <p>Stefan is a Ruby developer at Mystery Applicant in Bath. Formerly a generalist and Machine Learning researcher, he switched to Ruby full-time in 2014 and hasn’t looked back. Outside of work his interests include psychology, maths and language learning.</p> <p>Slack</p> <p>If you like to join us on Slack please join <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> <p>Notices</p> <p>Please let us know in the comments of the event if you have any specific food allergies, dietary or access requirements so we can be sure to best accommodate everyone!</p> ",
    "end_time": 1566331200,
    "link": "https://www.meetup.com/south-west-ruby/events/263160073/",
    "location": null,
    "org": "south-west-ruby",
    "start_time": 1566322200,
    "title": "South West Ruby #19"
}