{
    "description": "<p>Everyone is welcome at Bristol's monthly Ruby meetup. Just started learning Ruby? Thinking about starting to learn? Been writing Ruby for years? Please come along! Meet each other, eat delicious food, and listen to talks about Ruby. Because Ruby really is great: <a href=\"https://blog.teamtreehouse.com/why-ruby-is-awesome\" class=\"linkified\">https://blog.teamtreehouse.com/why-ruby-is-awesome</a>.</p> <p>This month we're really excited to host Julian Cheal, performing his talk as seen at RubyConf 2019 in Tennessee, and Daniel Magliola, \"life-long coder, expert procrastinator, and occasional game programmer obsessed with code performance and weird Lego machinery\".</p> <p>== Disk is fast, memory is slow. Forget all you think you know, by Daniel Magliola ==</p> <p>Adding metrics to your code should effectively have no impact on performance.</p> <p>When we were recently tasked with doing that in multi-process Ruby servers, we ran into an interesting challenge: could we aggregate our numbers across processes without blowing our target of just one microsecond of overhead?</p> <p>The months of work that followed had us looking into C extensions, segfault dumps, memory maps, syscall timings, and pretty much everything we could think of to try and achieve our objective.</p> <p>In the process, we found some very counter-intuitive performance results that I'd like to share with you.</p> <p>== Cocktail Masterclass with Ruby and Friends, by Julian Cheal ==</p> <p>Have you ever wanted to try making a Tennessee Two Step Cocktail, an Old Fashioned, or a Citrus peach cooler for the non-drinkers? Well now you can!</p> <p>Introducing Ruby Mixologist the world's first (probably) Ruby cocktail maker. Ruby Mixologist is a cocktail robot tending to all your drink needs.</p> <p>In this talk, we will discover how you too can build your very own Ruby powered drinks robot.</p> <p>* * *</p> <p>Schedule</p> <p>Arrive any time from 5.30pm to meet and eat.</p> <p>Talks start at 6.50pm</p> <p>We'll wrap up around 8pm for more drinks and mingling</p> <p>* * *</p> <p>Slack</p> <p>If you have any questions or suggestions please join us on Slack. Go to <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> <p>Please let us know on Slack (or in the comments of the event) if you have any specific dietary or access requirements so we can be sure to best accommodate everyone.</p> <p>* * *</p> <p>Look forward to seeing you soon!</p> ",
    "end_time": 1582056000,
    "link": "https://www.meetup.com/south-west-ruby/events/268534444/",
    "location": {
        "address": "3 Broad Plain, BS2 0JP",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45417404174805,
        "longitude": -2.582395076751709,
        "name": "Cookpad"
    },
    "org": "south-west-ruby",
    "start_time": 1582048800,
    "title": "South West Ruby #25"
}