{
    "cancelled": false,
    "description": "<p>Our next meetup will be in September. It's another virtual meetup. Join us on zoom at 7pm. You'll get the link when you RSVP.</p> <p>We're delighted to have *two fantastic speakers* join us this month: Dan Moore from FusionAuth, and prolific open source contributor and maintainer Maciej Mensfeld.</p> <p>== Maciej Mensfeld ==</p> <p>** OSS Supply Chain Security for Ruby **</p> <p>Maciej is a software architect and engineer working with <a href=\"http://castle.io\" class=\"linkified\">http://castle.io</a>. He has experience with a wide variety of business applications built using multiple Ruby frameworks.</p> <p>He's particularly interested in code quality and Ruby-based applications security.</p> <p>He's an active OSS contributor and maintainer of various projects including Karafka, dry-rb libraries and Bundler-Security project.</p> <p>It's wonderful Maciej can share some of his experience, wisdom and knowledge with us this month, and there's a good chance you've used code Maciej has written, so it's also a chance to say thank you :).</p> <p>== Dan Moore ==</p> <p>** JWTs: what Rails developers need to know **</p> <p>Dan Moore is a developer advocate for FusionAuth. He's been using Ruby and Rails off and on since 2015. A former CTO, engineering manager and longtime developer, he's been writing software for (checks watch) over 20 years.</p> <p>What is a JSON Web Token (JWT) and why do you care? JWTs are a stateless, standardized way to represent user data. This talk will discuss why JWTs matter and the nuts and bolts of JWTs. We'll also briefly discuss how you might use a JWT in your Rails application.</p> <p>* * *</p> <p>** (Approximate) Schedule **</p> <p>7.00pm - Welcome</p> <p>7.05pm - Maciej Mensfeld, OSS Supply Chain Security for Ruby</p> <p>7.50pm - Dan Moore, JWTs: what Rails developers need to know</p> <p>* * *</p> <p>Look forward to seeing you soon!</p> ",
    "end_time": 1600200000,
    "link": "https://www.meetup.com/south-west-ruby/events/273003545/",
    "location": null,
    "org": "south-west-ruby",
    "start_time": 1600192800,
    "title": "South West Ruby #29 (ONLINE)"
}