{
    "cancelled": false,
    "description": "<p>Join us at Newtown Park Brewing Co in Bristol, this month for an in-person South West Ruby meetup.</p> <p>Schedule</p> <p>18:00 - Arrive, grab a drink, and have a chat with fellow attendees. Meet fellow Ruby and Rails users in the South West!<br/>19:00 - \"KEEPING DEVELOPERS HAPPY WITH A FAST CI\" by Christian Bruckmayer of Shopify<br/>20:00 - More chatting!</p> <p>The Talk</p> <p>\"KEEPING DEVELOPERS HAPPY WITH A FAST CI\" by Christian Bruckmayer of Shopify</p> <p>When talking about performance, most developers think application speed, faster algorithms or better data structures. But what about your test suite? CI time is developer waiting time!</p> <p>At Shopify we have more than 170,000 Ruby tests and we add 30,000 more annually. The sheer amount of tests and their growth requires some aggressive methods. We will illustrate some of our techniques including monitoring, test selection, timeouts and the 80/20 rule. If you have experience in writing tests and want to learn tricks on how to speed up your test suite, this talk is for you!</p> <p>Christian Bruckmayer originally from Nuremberg, Germany, but now lives in the South West of England. In his day job, he makes e-commerce better for everyone at Shopify. Since 2014 he is an avid open source contributor hacking for instance on JRuby, openSUSE Linux or various (Ruby) gems.</p> <p>Slack</p> <p>If you like to join us on Slack please join <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> ",
    "end_time": 1645043400,
    "link": "https://www.meetup.com/south-west-ruby/events/283546498/",
    "location": {
        "address": "Saint Philips Road",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45645523071289,
        "longitude": -2.571161985397339,
        "name": "Newtown Park Brewing Co"
    },
    "org": "south-west-ruby",
    "start_time": 1645036200,
    "title": "South West Ruby #35 In Person"
}