{
    "cancelled": false,
    "description": "<p>Join us at **Immersive Labs** in Bristol this month for an in-person South West Ruby meetup featuring:</p> <p>🍺 great food and drinks (sponsored by Immersive Labs)<br/>💬 talk by **Chris Seaton (Shopify)**</p> <p>**Schedule**</p> <p>18:00 - Arrive, grab a drink and some food, have a chat</p> <p>19:00 - **\"Finding Stability in an Unstable World\"**<br/>People who implement interpreters and compilers for highly dynamic languages such as Ruby want one thing - stability. They want your program to reach a 'stable' or 'steady' state where no new classes are defined and no methods are redefined, so that they can treat your program as if it was more static and use conventional compiler techniques to make it fast.</p> <p>Unfortunately some idiomatic Ruby patterns mean that we may never reach such a stable state. We'll show you what these patterns are, why they cause a problem, and what researchers at Shopify are doing to mean you won't have to care about it any more.</p> <p>This is joint work between Chris Seaton and Matthew Alp.</p> <p>Chris is a Researcher (Senior Staff Engineer) at Shopify, where he works on the Ruby programming Language, and a Visitor at the University of Manchester.</p> <p>He was formerly a Research Manager at the Oracle Labs Virtual Machine Research Group, where he led the TruffleRuby implementation of Ruby, and worked on other language and virtual machine projects. Before this he completed a PhD at Manchester where he researched programming languages and irregular parallelism, and an MEng at the University of Bristol on languages with mutable syntax and semantics.</p> <p>In his spare time he’s Squadron Leader of the Cheshire Yeomanry squadron of the Queen’s Own Yeomanry, Cheshire’s historic reserve light cavalry squadron.</p> <p>20:00 - More mingling</p> <p>**Slack**</p> <p>If you like to join us on Slack please join <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> ",
    "end_time": 1660248000,
    "link": "https://www.meetup.com/south-west-ruby/events/287301840/",
    "location": {
        "address": "All Saints' Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.456138610839844,
        "longitude": -2.5929958820343018,
        "name": "Immersive Labs"
    },
    "org": "south-west-ruby",
    "start_time": 1660237200,
    "title": "South West Ruby #39 In Person"
}