{
    "cancelled": false,
    "description": "<p>Join us at **Newtown Park Brewing Co** in Bristol this month for an in-person South West Ruby meetup featuring:</p> <p>🍺 drinks (sponsored by Cookpad)<br/>💬 talks by **Teja Sophista (Cookpad)** and **Richard Brooke**</p> <p>**Schedule**</p> <p>18:00 - Arrive, grab a drink and some food, have a chat</p> <p>19:00 - **\"ActiveRecord and Concurrency\" - Teja Sophista**</p> <p>\"I'll talk about my experience through the wonderful world of ̶P̶a̶r̶a̶l̶l̶e̶l̶ Concurrent Universe of ActiveRecord\"</p> <p>Teja is a Web Developer at Cookpad.</p> <p>19:30 - **\"Cypress\" - Richard Brooke**</p> <p>\"Cypress is an automated testing framework for the the front-end of web applications, particularly ones that use javascript. It uses tests written in javascript and has many similar concepts to rspec. Where it excels is in ease of debugging through its ‘Time Travel’ feature; its live interaction with the application under test and its handling of timeouts and promises. It’s also much easier to set up than Selenium, Poltergeist and so on. This talk will provide an introduction to Cypress and show how it can be used to test a Rails application.\"</p> <p>Richard Brooke is a software engineer with over 30 years experience. His early career involved loading half-inch tape reels onto backup drives and his latter career has involved much the same, but with Ruby and some other programming languages thrown in. Luckily the tar command still works.</p> <p>20:00 - 21:00 - More mingling</p> <p>**Slack**</p> <p>If you'd like to join us on Slack please join <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> ",
    "end_time": 1666814400,
    "link": "https://www.meetup.com/south-west-ruby/events/289064495/",
    "location": null,
    "org": "south-west-ruby",
    "start_time": 1666803600,
    "title": "South West Ruby #41 In Person"
}