{
    "cancelled": false,
    "description": "<p>Join us in central Bristol this month for a special festive edition in-person South West Ruby meetup featuring:</p> <p>🍕🥧🍺 food (including mince pies of course) and drinks<br/>💬 talks by **Rosa Gutiérrez (37signals)** and **Maciej Mensfeld (Diffend)**</p> <p>We're very excited to have two outstanding Rubyists visit Bristol from Spain and Poland respectively to share their knowledge and stories with us. RSVPs will be essential for this no-doubt well attended edition of South West Ruby.</p> <p>**Schedule**</p> <p>18:00 - Arrive, grab a drink and some food, have a chat</p> <p>18:45 - **\"50 languages in (almost) 50 days\" - Rosa Gutiérrez**</p> <p>\"For some of us, programming is not just our job but also a hobby. Some people apply this hobby to work on productive stuff, like useful side projects or contributing to open source. Others, however, apply this hobby to absurd and useless, yet super fun, challenges. I'm part of that latter group. In this talk, I'll tell the story of one of such challenges, how I ended up doing it and hoping that'll inspire others to embark on similar useless and fun adventures.\"</p> <p>Rosa is a lead programmer at 37signals, in the Security, Infrastructure and Performance (SIP) team. She works in Basecamp as well as in HEY, our mail service that launched in 2020, and thanks to which she developed a love-hate-PTSD with everything email-related. Before that, she worked at Plex, BeBanjo and Tuenti. She loves maths, theoretical computer science, useless and absurd programming challenges and learning new languages, both for humans and computers.</p> <p>19:30 - **Talk TBC - Maciej Mensfeld**</p> <p>Maciej Mensfeld is a Software Architect with experience in a wide variety of business applications built using multiple Ruby frameworks. He is a member of the Ruby gems security team, an active OSS contributor and maintainer of various projects including Karafka and mend.</p> <p>20:00 - 21:00 - More mingling</p> <p>The venue is to be confirmed but it will be in central Bristol at one of our usual venues. Please check back here closer to the date for the final details.</p> <p>**Slack**</p> <p>If you'd like to join us on Slack please join <a href=\"https://bathruby-for-slackers.herokuapp.com\" class=\"linkified\">https://bathruby-for-slackers.herokuapp.com</a> and find us in the #south-west-ruby channel</p> ",
    "end_time": 1671051600,
    "link": "https://www.meetup.com/south-west-ruby/events/289766503/",
    "location": {
        "address": null,
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45451354980469,
        "longitude": -2.5879099369049072,
        "name": "Bristol"
    },
    "org": "south-west-ruby",
    "start_time": 1671040800,
    "title": "🎄 South West Ruby #42 In Person"
}