{
    "description": "<p>Here’s our second session, and this week we’ve got talks on two technologies that won’t have passed any of you by, Mobile Apps and JavaScript:</p> <p><a href=\"http://briste.ch/speakers/colin-eberhardt.html\">Colin Eberhardt</a>: Cross Platform Mobile – looking beyond the HTML5 Hype The fragmented smartphone market is a very real challenge for mobile application developers. In order to reach end users you have to create applications that will run on a range of platforms. Creating a native version of your application for each platform is often not an option, due to cost constraints. As a result, developers are looking towards cross-platform solutions, such as HTML5, in order to increase the reach of their applications. However, many have genuine concerns about HTML5, which has been much-hyped. With the biggest concern being around visuals - can it really deliver a first-class user experience?</p> <p>Backed by practical examples and demonstrations on a range of devices, this talk will take a practical look at the options available for cross-platform development, which includes not just HTML5 but also technologies such as Titanium, Xamarin and Adobe AIR.</p> <p>This talk will take a critical look at the developer tooling, code sharing, and most importantly end-user experience that can be achieved by a number of popular frameworks, allowing you to make a more informed choice.</p> <p><a href=\"http://briste.ch/speakers/tim-perry.html\">Tim Perry</a>: The Many Ways to Build Modular JavaScript JavaScript has its fans, but few would say it encourages organisation or encapsulation. In this talk, Tim Perry will wade through some of the problems this causes, introduce some of the range of potential solutions that have been built on top of JavaScript to overcome them, and take a look at how the rest of the modern JavaScript ecosystem is moving forwards in this direction.</p> ",
    "end_time": 1380834000,
    "link": "https://www.meetup.com/bristech/events/130980282/",
    "location": {
        "address": "Nelson Street, Bristol, BS1 2LE. ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45669937133789,
        "longitude": -2.5932130813598633,
        "name": "The Island"
    },
    "org": "bristech",
    "start_time": 1380823200,
    "title": "Cross Platform Mobile / Building Modular JavaScript"
}