{
    "cancelled": false,
    "description": "<p>CoffeeScript: the good parts re-brewed or just screwed? / Bomber Command: how to write a computer game in 30 minutes</p> <p>Our guest speakers this month are Dave Tonge and Dave Taylor.</p> <p>CoffeeScript: the good parts re-brewed or just screwed? (Dave Tonge)<br/>How a little \"thought experiment about how nice JavaScript could be with an alternative syntax\" has shaken up the JS World. We'll explore the language, address the FUD and dive into some beautiful code. The talk isn't only for JS developers, but will aim to provoke deeper questions about why we choose our programming languages, why having less features can be better and how functional programming brings happiness.</p> <p>Bomber Command: How to write a game in 30 minutes<br/>\"There was this old bomber game I used to play when I was a little kid where a plane flies across the top of the screen and drops a bomb to blow up a ship below. I think it would be pretty fun to build it in a live coding session...ideal for people who have never seen how a simple game is pieced together.\"</p> <p>Dave Taylor is a creative developer. He's a sucker for a challenge and loves anything interactive which engages a community. Currently Dave is freelancing for Pogo Kid and training people with a passion for building things with code. Mumblings on coding and the enjoyment of being a developer regularly crop up on <a href=\"http://davetayls.me\" class=\"linkified\">http://davetayls.me</a>.</p> <p>Join us for both 30 minute talks and food/beverage too in the old police cells, TheIsland, Bristol.</p> ",
    "end_time": 1389303000,
    "link": "https://www.meetup.com/bristech/events/153965522/",
    "location": {
        "address": "Nelson Street, Bristol, BS1 2LE. ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45659255981445,
        "longitude": -2.593208074569702,
        "name": "The Island"
    },
    "org": "bristech",
    "start_time": 1389294000,
    "title": "CoffeeScript: the \"Good Parts\" re-brewed? / How to write a game in 30 minutes"
}