{
    "cancelled": false,
    "description": "<p>The first of our speakers for April has been announced, and our second will be announced soon:</p> <p><b>Ric Hill: \"Are we nearly there yet?  Practical tracking on Agile projects\"</b></p> <p><b>Ric</b> has been in the software development industry for around 10 years, starting off as a hands-on developer before focusing on Agile project management. He now runs Softwire's Bristol office, but still finds himself doing bits of technical and \"Agile transformation\" consultancy.</p> <p><b>Phil Hall: \"Applied/experimental/academic A.I. in corporate, educational and socio-cultural configurations\"</b></p> <p>Artificial Intelligence is probably the biggest smoke and mirrors experience since the Y2K fiasco, potentially the most important infrastructure experience since the roll out of non-animal powered public transportation. Misunderstanding and user-expectation is so rampantly rife one would think that the whole market has lost its relevance or viability in the world we live in.</p> <p>This market has been out of control since Alan Turing set the bar for a, debatably, irrelevant and unhelpful definition of what the human computer interface should be … there are a few voices of pragmatic reason. This talk will attempt to move though a brief <i>relevant</i> history of A.I. and focus on the practical engineering requirements to create a ‘human reined’ layer between digital information and human beings. </p> <p>It’s hard to take on such an activity without referencing privacy abuses, advertising overload, technological imperialism and the impact on the nascent Internet of the greatest minds in the world trying to force people to click-a-banner-ad.</p> <p>Experiences from customer service, technical support, education and games will be offered up mainly for information &amp; example though undoubtedly for discussion. Context from mechanical and electrical engineering and social science will be blended in, a clear picture through the murk will be **attempted**.</p> <p>This talk will be a view from a strange, Turk filled Chinese-room like corner of the Internet that will NOT go away, and will NOT be of real use until the balance between what is mathematics heading towards gambling and what is storytelling heading to a notion of ‘consciousness’ meet in a place where humans are still relevant.</p> <p><b>Phil</b> is MD &amp; Founder of Elzware Ltd, a company set up in 2002 with the specific objectives of opening up a conversational system marketplace in line with: available bandwidth, digital consumer devices and the general public’s desire to communicate with computers in natural language. </p> <p><b>Meetup Details</b></p> <p>As ever there will be food and drink a-plenty, so pop along, usual time, usual place.</p> ",
    "end_time": 1396558800,
    "link": "https://www.meetup.com/bristech/events/169969712/",
    "location": {
        "address": "Nelson Street, Bristol, BS1 2LE. ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45659255981445,
        "longitude": -2.593208074569702,
        "name": "The Island"
    },
    "org": "bristech",
    "start_time": 1396548000,
    "title": "Agile Project Tracking (Ric Hill) / Applied AI (Phil Hall)"
}