{
    "cancelled": false,
    "description": "<p>**Rescheduled due to unforeseen diary clash @ EngineShed**</p> <p>Agile is not (always) the answer - Thom Leggett</p> <p>Your software engineering process is important. As important as having brilliant people, a challenging vision, a working business model and disciplined engineering. These days we are told that an agile process such as scrum is what we should all be using. But this advice is as wrong and dogmatic as the waterfall process that it replaced. In this talk I will examine three different ways in which you can evaluate which kind of process is appropriate for *your* team working towards *your* vision against *your* business model using *your* practices.</p> <p>Seven years ago Thom gave up a programming job he loved in order to help software teams fix their broken management and engineering systems. Today he is working for an awesome team at HP on an OpenStack based cloud product. When he's not doing this he can be found playing lego with his children, running in knee-deep mud, listening to music or tinkering with open source software.</p> <p>\"Choose Your Words Wisely\" - UX Writing with Dave Simons</p> <p>A lot of the work we do as an industry involves writing websites and other applications to put in front of non-technical people - and we have to design everything accordingly. A lot of thought has already gone in to the images, colours and locations of items on a page. Despite this, we’re still a little behind the times whilst thinking about the words that we use. In this talk, I’ll discuss some of the ways that our words can influence people, and how we can leverage that in our work to make our software work for both our end-users, and ultimately, ourselves.</p> <p>David is a technical lead for Softwire, working with teams to deliver the needs of a range of clients (including the BBC and Microsoft) by choosing and developing with the right tools for the job. Since he started coding professionally, he has worked extensively on full-stack systems, thinking deeply about everything from how to store data, to the pixel-perfect placement of images. When not writing code, David enjoys thinking and talking about inclusivity, statistics and beer.</p> ",
    "end_time": 1423778400,
    "link": "https://www.meetup.com/bristech/events/219209227/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1423767600,
    "title": "Thom Leggett: Agile is not (always) the answer, Dave Simons: UX Writing"
}