{
    "cancelled": false,
    "description": "<p>JON JAGGER - Cyber-Dojo - Deliberate Programming Practice</p> <p>KAI DAVENPORT - Extending Docker with Powerstrip</p> <p>// Cyber-Dojo - Deliberate Programming Practice</p> <p>A dojo is a place where martial artists practice their martial art. Cyber-Dojo is where programmers practice programming. It isn't an individual development environment - rather it's a browser-based shared learning environment with a strong focus on review. It's powered by Docker.</p> <p>Jon Jagger - <a href=\"http://jonjagger.blogspot.co.uk/\"><a href=\"http://jonjagger.blogspot.co.uk/\" class=\"linkified\">http://jonjagger.blogspot.co.uk/</a></a></p> <p>// Extending Docker with Powerstrip</p> <p>Powerstrip is a tool for prototyping Docker extensions. It's a Docker API proxy which allows multiple adapters to hook into the same Docker daemon.</p> <p>It enables the creation of extensions that are:<br/>* composable - it's vital that the variety of tools being developed to extend docker are able to work together.<br/>* late-bound - docker a compiled golang binary - extensions need to run outside the main docker process and to be authored in any language.<br/>* optional - extensions that solve particular problems should be replaceable with other solutions for the same problem.</p> <p>Because Powerstrip presents a standard docker HTTP proxy, it can communicate with the standard Docker client.  This means the wide range of orchestration tools can be made to work with Powerstrip adapters out of the box. There are several Powerstrip adapters currently being developed - one for Weave and one for Flocker.  We hope to see a wide range of adapters being developed by the docker community in the coming months. </p> <p>Kai Davenport handles developer relations for ClusterHQ, the makers of docker data management tool, Flocker. </p> <p>He has been developing database driven websites since 1998 and has been hacking on a variety of Docker based projects under his github profile, binocarlos. </p> <p>Previously working in the education sector, he most recently authored a Powerstrip adapter for Weave - a virtual overlay network for containers. <br/>Kai develops in node/io.js and was working on a proxy server for multiple Docker servers before working on Powerstrip.</p> ",
    "end_time": 1428008400,
    "link": "https://www.meetup.com/bristech/events/221052213/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1427997600,
    "title": "Cyber-Dojo - Deliberate Programming Practice / Extending Docker with Powerstrip"
}