{
    "description": "<p>SIMON HOWARD - Responsive Game Design</p> <p>ADAM BUTLER - Open source all the things! </p> <p><b>// Responsive Game Design: Bringing your game to the living room</b></p> <p>So what are the things that you need to think about when bringing a mobile game to the living room? This is an interactive session where Simon will walk through that via a handy little game on his Amazon Fire TV. Beware: there will be some coding on the fly and he hopes a demo or two at the end of that. But you never can tell…</p> <p>Simon Howard</p> <p>Simon is a Developer Evangelist in the App Store team at Amazon. He is based in the UK and works with developers across Europe. In this role, Simon speaks at meet ups and conferences, blogs on the Amazon developer portal (developer.amazon.com), writes samples and helps developers with issues from time to time. Prior to joining Amazon, Simon worked in the Developer Relations team at BlackBerry as a Developer Evangelist. As such, he spoke at various events and meet ups across Europe about BlackBerry 10 and supported enterprise and consumer focused developers who were creating apps or games for BlackBerry 10. Prior to BlackBerry, Simon worked in the Windows Phone team in Microsoft UK as a Technical Specialist and engaged with all the UK based Mobile Operators and OEMs.</p> <p><b>// Open source all the things!</b></p> <p>Until recently I had been working on a single project in my spare time for two years, I love it but I also hate it a little… ok, a lot I guess. So I made a change, I open-sourced it and released it, hopefully for the better at least it seems that way so far. I decided to do the same with everything else I’ve ever built (or at least the bits I have the code for) and everything that has come since. I want to talk about this change, why I made it and the good &amp; bad that have followed.</p> <p>Adam Butler</p> <p>Adam Butler is a Full-stack Web Developer at Simpleweb, in his spare time he runs BristolJS, enjoys hacking with hardware, building robots and skydiving.</p> ",
    "end_time": 1431032400,
    "link": "https://www.meetup.com/bristech/events/221052390/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1431021600,
    "title": "Simon Howard - Responsive Game Design / Adam Butler - Open source all the things"
}