{
    "description": "<p>Sean O'Neill: Soft Skills</p> <p>This talk is for anyone interested in the non-technical side of being a software engineer. Sean is a beginner at soft skills so the talk is aimed at other beginners. It should give anyone a basic grounding in the area and some basic tools to get started. Sean will be going through the current models of how people think and behave. This should help us understand :</p> <p>• why people are motivated<br/>• how people get into arguments<br/>• how to resolve conflicts<br/>• how people learn<br/>• how people can be more productive.</p> <p>About Sean: </p> <p>Sean is a developer at Scott Logic. In his spare time he tries to develop games. He has recently taken an interest in soft skills and the non-technical aspects of software engineering after becoming a consultant. </p> <p>Lukas Roper &amp; Dan Page: Virtual Reality - A new world with new development challenges</p> <p>Dan Page will introduce the session with a round-up of the virtual reality market as it stands at the time of the meeting. Lukas Roper will follow-up with an in-depth look at some of the challenges presented by the medium and how he and the Opposable Games team have made efforts to overcome them. </p> <p>Both Dan and Lukas will then take a wider look at some of the challenges still waiting to be solved and the steps beginning to be taken by developers to start tackling them. Likely subjects will include the sim-sickness, potential widespread adoption, fragmentation, locomotion in first person games and hardware limitations.</p> <p>Dan and Lukas will then move on to look a little further into the future at where the virtual reality market might go, with a look at predictions in mobile, console and desktop VR.</p> <p>About Lukas:</p> <p>Lukas Roper is the lead developer at the award-winning Opposable Games studio, responsible for the development team behind <a href=\"http://salvagedgame.com/\">Salvaged</a>, <a href=\"http://opposablegames.com/onetouchconnect/\">OneTouchConnect</a>, and many mobile, VR and PC games delivered for Opposable Games clients. Lukas is well known in the South West games development scene, having developed his own independent games, providing input onto a number of hardware projects, as well as giving development talks at the Bristol Games Hub, the University of West of England, the Untied Conference and the British Computing Society.</p> <p>About Dan:</p> <p>Dan Page organises the SouthWest VR Conference and acts as Marketing Manager and VR Consultant for Opposable Games. Dan has talked VR on the Guardian's Tech Weekly podcast and website, and is regularly called upon for quotes and interviews with media outlets on the subject. As an enthusiast and well-connected professional working within the VR industry, Dan goes to great lengths to make sure nothing on the subject passes him by.</p> ",
    "end_time": 1435870800,
    "link": "https://www.meetup.com/bristech/events/223200894/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1435860000,
    "title": "Sean O'Neill:Soft Skills/Lukas Roper Dan Page:VR A new world with new challenges"
}