{
    "cancelled": false,
    "description": "<p>// User adoption - modelling, measuring and planning for success</p> <p>How can we track the progress of people from first contact to qualified user of a product? In Open Source our users can be almost invisible. Using models for diffusion of innovation and stages of commitment I'll talk about how to understand how to model the User Adoption of a product and apply this to real data that you already have such as Google Analytics. We'll then look at actionable steps to provide tailored support for users based on the current stage of your users through the adoption process.</p> <p>// About Alice</p> <p>Alice Sowerby is a UX professional with over 8 years' experience of working on a range of B2B and B2C applications. She started her UX career at Sophos Plc and then worked at Applied Card Technologies Ltd where she brought UX to a portfolio of mature and greenfield projects including public-facing government portals, business mobile apps and system dashboards. Alice held varied positions at ACT including Head of UCD, Scrum Master and Product Owner for cloud services. She currently works for Silicon Valley-funded startup, ClusterHQ, based out of Bristol, where she is closing the loop on understanding how engineering decisions and marketing activities affect User Experience and User Adoption.</p> <p>// Big Data Analytics</p> <p>“Where is big data going?”</p> <p>The first generation of tools enabled projects of a scale never before seen - hadoop and related technologies kicked off this field. Some projects have succeeded, many have failed. The tools are powerful but complex, and the skills required for them are in short supply, especially Data Scientists. Mike Barlow talks about \"The Last Mile of Analytics” (via O’Reilly) and the new tools that are coming along to succeed where the complex platforms haven’t quite delivered, what are these new tools (Apache Spark, Kafka, data-mining tools)? And where are they going and are we really moving from platforms to tools.</p> <p>// About Andrew</p> <p>Andrew has worked on Big Data from an early point in his career having worked on CDR processing for Nortel Networks long before the term Big Data became popular. He has since managed software teams and projects doing big data at Airbus, Citigroup, Goldman Sachs and is now CEO of Claritize which does Data Mining on big data.</p> ",
    "end_time": 1446760800,
    "link": "https://www.meetup.com/bristech/events/224763360/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1446750000,
    "title": "Alice Sowerby - User Adoption / Andrew Carr - Big Data Analytics"
}