{
    "description": "<p>// Note - We have 5 tickets (each worth £180!) to raffle on the night for the forthcoming VoxxedDays conference (Thurs 25th February) (see <a href=\"https://voxxeddays.com/bristol16/)\"><a href=\"https://voxxeddays.com/bristol16/\" class=\"linkified\">https://voxxeddays.com/bristol16/</a> for more info)</a>.</p> <p>To enter the competition, simply email <a href=\"mailto:[masked]\">[masked]</a> with Bristech as the email subject and your name (and company, as applicable) as the email message. We will then draw names at random for a chance to win a ticket.</p> <p>// Benjamin Byford - Ethics and algorithms</p> <p>Elon Musk (Tesla, SpaceX, Paypal), describes the potential of Artificial Intelligence as our “biggest existential threat”. Stephen Hawking, amongst other eminent thinkers, has signed open letters to world leaders demanding legislation against the development of autonomous machine agents and soldier robots. The first fully automated vehicle has been given a road license in the US with tests already going ahead in China, UK, and Japan. We’ve also invited AI into our homes and offices. Capable of automatically ordering goods, locking us and intruders in/out of our homes, altering heating, lighting, and recording our every movement, algorithms are deployed all around us with increasing amounts of autonomy. The future is now but our general understanding of it is foggy. Machines Ethics is about how machines should feel about us? What are the ethical issues with giving machines more autonomy, whether there are strategies to limit or control this autonomy, and the inherent difficulties in giving anything ethics.</p> <p>// About Ben:</p> <p>I am a freelance web designer (hire me) working in Bristol and London. I have worked on large scale projects such as Virgin.com (providing point of contact for technology and design decisions) and medium scale projects with clients including BFI, CEH, Virgin and Virgin unite.</p> <p>I am a design and front-end guy, with extensive knowledge of other tech and development languages and have previously worked as a mediator between dev teams and clients, as I can successfully cut through the jargon on both sides.</p> <p>My public speaking and lecturing blends my insights within HE research, entrepreneurship, social businesses, and web technologies; focusing on the usage of technology as a tool for innovation and creativity. </p> <p>// Dr Kerstin Eder - Whole Systems Energy Transparency (or: More Power to Software Developers!)</p> <p>Energy efficiency is now a major (if not the major) concern in electronic systems engineering. While hardware can be designed to save a modest amount of energy, the potential for savings are far greater at the higher levels of<br/>abstraction in the system stack. The greatest savings are expected from energy consumption-aware software. </p> <p>This talk emphasizes the importance of energy<br/>transparency from hardware to software as a foundation for energy-aware system design. Energy transparency enables a deeper understanding of how algorithms and coding impact on the energy consumption of a computation when executed on hardware. It is a key prerequisite for informed design space exploration and helps system designers to find the optimal tradeoff between performance, accuracy and energy consumption of a computation. </p> <p>Promoting energy efficiency to a first class software design goal is therefore an urgent research challenge. In this talk I will outline the first steps towards giving \"more power\" to software developers.</p> <p>This project has recently been in the news, see <a href=\"http://www.bris.ac.uk/news/2013/9597.html\"><a href=\"http://www.bris.ac.uk/news/2013/9597.html\" class=\"linkified\">http://www.bris.ac.uk/news/2013/9597.html</a></a></p> <p>// About Kerstin:</p> <p>Dr Kerstin Eder is a Reader in Design Automation and Verification at the University of Bristol. She set up the Energy Aware COmputing (EACO) initiative at the University of Bristol and leads the Verification and Validation for<br/>Safety in Robots research theme at the Bristol Robotics Laboratory. Kerstin has gained extensive experience of verifying complex microelectronic designs working with leading semiconductor design and Electronic Design Automation companies. She has co-authored over 50 internationally refereed publications, was awarded a Royal Academy of Engineering “Excellence in Engineering” prize<br/>and manages a portfolio of active research grants valued in excess of £2M.</p> <p>Kerstin is the Principal Investigator of the EC FP7 FET MINECC (Minimizing Energy Consumption of Computing to the Limit) collaborative research project ENTRA (Whole Systems Energy Transparency) which aims to promote energy efficiency to a first class software design goal. At the BRL she is the Principal Investigator of two EPSRC projects: RIVERAS (Robust Integrated Verification of Autonomous Systems) and ROBOSAFE (Trustworthy Robotic Assistants).</p> <p>Kerstin's favourite \"hobbies\" are her daughter Lena and her son Carl :)</p> <p>A full bio can be found here: <a href=\"http://www.cs.bris.ac.uk/~eder/\"><a href=\"http://www.cs.bris.ac.uk/~eder/\" class=\"linkified\">http://www.cs.bris.ac.uk/~eder/</a></a></p> ",
    "end_time": 1454623200,
    "link": "https://www.meetup.com/bristech/events/226881055/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1454612400,
    "title": "Benjamin Byford - Ethics and Algorithms /Kerstin Eder - More power to developers"
}