{
    "cancelled": false,
    "description": "<p>// James Phillpotts - Share All The Things<br/>When OAuth came along, it gave us an easy way to allow a user to authorize one application to act as us on another application. And lo and behold, a never-ending list of demo applications using the Twitter API were born.</p> <p>But still, you could only allow your application to use your user's access to the protected application as themselves. What about when you want a user to grant a different user the ability to access their resources - like Google Docs?</p> <p>User Managed Access is a new profile of OAuth 2 that extends the 2-application, 1 user standard to 3 applications and two users. Join James, Alice and Bob to find out how you can add this to your applications right now.</p> <p>// About James:</p> <p>From early beginnings transcribing BBC Basic source from The Micro User and Acorn User, to altering the QBasic ‘Gorillas’ source to turn a banana into a grenade, James has always been interested in programming. These days he is a Java engineer for ForgeRock with an interest in Scala, JavaScript, and anything that can be used in cool ways to make cool stuff.</p> <p>// Tom Spencer - No REST For the Whippet</p> <p>After years of fiddling around with RPCs and SOAP, RESTful APIs have won out to become the defacto standard for data exchange on the web. In this talk, I'll describe my process for designing such an API. After discussing the benefits of RESTful design, we'll continue with basic CRUD, authentication, error handling and more advanced actions. All using dogs as examples!</p> <p>// About Tom:<br/>Full-stack JavaScript Developer with 9 years experience building JS-based apps. Recently went freelance and currently working on the MEAN stack. Previously worked as head of web team at Mubaloo building hybrid mobile apps, and even more previously as the founder of a small start-up in Wales. Co-founder of SW Mobile meetup group and the Bristol arm of nodeschool.</p> ",
    "end_time": 1452204000,
    "link": "https://www.meetup.com/bristech/events/226881012/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1452193200,
    "title": "James Phillpotts - Share All The Things/Tom Spencer - No REST for the whippet"
}