{
    "description": "<p>// How to build a Recommendation Engine</p> <p>Companies are striving to make their content personalised to their users, by tailoring dynamic content based on users’ data and previous actions. If we can pre-empt what a customer is likely to interact with, then we can keep users interested in our services much longer. Traditionally, this has been tricky, needing complex models or self-learning neural networks</p> <p>Nowadays, recommendations don’t have to be hard. In this talk, we’ll look at some of the use cases and theory behind recommendation engines, and look at the technologies that can be used to unlock them. We’ll even show and develop code that backs recommendation engines in a live demonstration to show easy it can be!</p> <p>// About David Simons</p> <p>David is a technical lead for UK-based Softwire, which involves working with a range of clients helping them choose the right tool for their job, and then making it! Between this and his spare time hacking, he has an interest in assimilating technologies both old and new.</p> <p>His background is in research, specifically working on Statistics and Simulation at the University of Oxford. This has given him a passion for seeing data utilised correctly, and has taken the role of evangelising a range of database solutions – both SQL and NoSQL – in the software world.</p> <p>// Feeling without Touching</p> <p>Little is known about the sense of touch but it is essential for us to explore and interact in every day life. We will look into “what is touch?” and what Ultrahaptics are doing to bring the sense of touch to devices and games of the future.</p> <p>// About Tom Carter</p> <p>Tom started exploring ultrasound technology following a study in the final year of his Master’s degree in Computer Science at the University of Bristol. He further developed the initial concept to form the basis of his PhD studies during which time he published numerous papers and filed various patents. Recognising the technology’s commercial viability, Tom founded Ultrahaptics in November 2013. Tom now steers the technical direction of the company.</p> <p><a href=\"https://youtu.be/KRIrSw-Sb3g\" class=\"embedded\">https://youtu.be/KRIrSw-Sb3g</a></p> ",
    "end_time": 1462482000,
    "link": "https://www.meetup.com/bristech/events/228970926/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1462471200,
    "title": "Dave Simons - Recommendation Engines / Tom Carter - Feeling without touching"
}