{
    "description": "<p>// Daniel Drozdzewski - Unikernels</p> <p>Containers have been around for decades. The ascent of Docker in the last few years brought them into glory, yet it is still 10s to 100s of megabytes to run the simplest Java applications. As a result the arms race to create the smallest possible containers for a given technology has started. However, we still often end up running our containerised applications alongside code supporting ancient devices and file systems. Unikernels are (hopefully!) the next step in the direction taken by containers. The hype machine has started and we already call them Containers 2.0, Immutable Containers, Containers on Steroids. In this talk I will try to talk about the main advantages and biggest pains caused by Unikernels.</p> <p>// About Daniel</p> <p>Daniel Drozdzewski started his tech adventure in the late 80s and quickly swapped joystick for keyboard, writing Minesweeper in Commodore BASIC in the early 90s. The journey took him to Electronics College, and then further studies in Electronics, Software Engineering and finally Computing Science at Newcastle University. His dissertation was about Containment modelling in HP-UX which makes the talk at Bristech a nice roundtrip journey nearly a decade later. In the meantime Daniel worked as a software developer, ran one of the first XP/Agile clubs in the UK back in 2007 and 2008, worked on one of the first mobile chat clients in 2009 and 2010, worked for a big bookmaker and finally at a Big Data startup, before joining a software consultancy.</p> <p>// Luke Kreczko - Analysing Particle Collision Data</p> <p>In this talk I will give an overview of the Large Hadron Collider (LHC), the Compact Muon Solenoid (CMS) experiment and Bristol's involvement. Next I will explain our data sources and the questions we are trying to answer with the data. Finally I will give brief examples of three analysis types (rate determination &amp; shape analysis and searches) to explain the analysis techniques.</p> <p>// About Luke</p> <p>Dr Luke Kreczko is a Research Associate in Particle Physics at the University of Bristol. His work includes programming in various languages, analysing data, in particular data containing top quarks, and provisioning of computing resources. His interests are data science, machine learning and how to make science easier. </p> ",
    "end_time": 1464901200,
    "link": "https://www.meetup.com/bristech/events/229037053/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1464890400,
    "title": "Daniel Drozdzewski - Unikernels / Luke Kreczko Analysing Particle Collision Data"
}