{
    "description": "<p>// Rich Knight - Introduction to Event Sourcing and CQRS</p> <p>Event sourcing is an idea that is hundreds of years old. In this talk I will explain how we can use it, along with the CQRS architecture, to build software in 2016.</p> <p>Storing data as a series of events may feel alien at first, but has many interesting consequences. I will show how to take advantage of these to produce more flexible, scalable and reliable apps.</p> <p>// About Rich</p> <p>Rich is a developer based in Chippenham, UK. He currently spends his days producing software for the pharmaceutical industry as lead developer at Cognisant (<a href=\"http://cognisantresearch.com/\"><a href=\"http://cognisantresearch.com\" class=\"linkified\">http://cognisantresearch.com</a></a>). Outside the world of tech he is enthusiastic about photography, film, comics, and coffee.</p> <p>// Toby Jackson - Sensu and System Monitoring</p> <p>Most people treat monitoring like flossing - we know it's good for you, but it's a hassle, and only mentioned when someone asks difficult questions. In this talk, I try to highlight what to focus monitoring on, where you can quickly deliver business value and provide a deep dive into one particular tool, Sensu, which has empowered the development team at Future PLC to begin to truly take ownership and responsibility for their work.</p> <p>// About Toby</p> <p>Toby started as a PHP/Java software developer working at a PCI level 1 payment provider, moving through quality assurance, build and release management, advocating scrum/agile and he is now delivering innovation and 1st line support in a Senior Operations role at Future PLC.</p> <p>He has experience in all phases of complex macro and microservice software platforms, which has given plenty of opportunity to fail, learn from those failures and he now wants to share these experiences with others.</p> <p>Outside the office Toby can be found with soldering irons, cameras, gamepads, geocaches, beers or simply relaxing with jazz and cats.</p> ",
    "end_time": 1472763600,
    "link": "https://www.meetup.com/bristech/events/231392662/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1472752800,
    "title": "Rich Knight - Event Sourcing & CQRS / Toby Jackson - Sensu & System Monitoring"
}