{
    "cancelled": false,
    "description": "<p>// Tom Kealy - Machine Learning</p> <p>Modern Ai's show impressive performance, and are fun to play with. I will explain some of the ideas and give demonstrations behind modern AI's such as AlphaGo: namely Q-learning with neural nets and Monte Carlo Tree Search.</p> <p>// About Tom:</p> <p>Tom has just completed his PhD in statistical signal processing - working on dimensionality reduction techiniques to accurately sense wideband spectra, and is now working on Natural Language Processing problems for UKHO.</p> <p>// Julien Nioche - StormCrawler</p> <p>In this talk I will introduce Storm-Crawler, an open source collection of resources, mostly implemented in Java, for building low-latency, large scale web crawlers on Apache Storm. After an introduction to web crawling and an overview of the Apache Storm framework, we will go into more details of what StormCrawler provides and how it compares with similar projects like Apache Nutch . We will also see how it can be combined with ElasticSearch for storing the status of the URLs and indexing web pages but can also leverage Kibana for monitoring the crawl topology itself. Finally I will present a few use cases, including CameraForensics who are based at the EngineShed in Bristol.</p> <p>// About Julien</p> <p>I run DigitalPebble Ltd, a consultancy based in Bristol and specialising in open source solutions for text engineering. My expertise covers web crawling, natural language processing, machine learning and search. I am committer on Apache Nutch and am also involved in several other open source projects, including StormCrawler and Behemoth. Prior to that, I worked as a researcher in NLP for the University of Sheffield.</p> ",
    "end_time": 1475787600,
    "link": "https://www.meetup.com/bristech/events/232642380/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1475776800,
    "title": "Tom Kealy - Teaching computers to play games / Julien Nioche - StormCrawler"
}