{
    "description": "<p>// Dan Cook - Visualising Geospatial Big Data</p> <p>A talk showing how you can connect the Hadoop Ecosystem to Elasticsearch and visualise geospatial Big Data with Kibana. From data set to world heat maps and other cool visualisations.</p> <p>Getting your raw data logs into Hadoop, performing joins with interesting reference data and getting everything into Elasticsearch to visualise with Kibana. We want processing times in minutes not days.</p> <p>We will also cover why the geohash makes your geospatial queries amazing and its utilisation in Kibana and Elasticsearch.</p> <p>// About Dan<br/>Dan doesn't know whether to describe himself as a dev, architect or team lead and has been doing a blend of all 3 roles on Big Data projects over the past few years. Although he did have a short break last year to have fun building a web app! When he's not coding, he can either be found in the pub or crawling very slowly up a hill on a bicycle.</p> <p>// Andrew Grimes - Design mortality - negotiating a longer life for digital ideas</p> <p>It isn’t really that difficult to come up with a design idea or even to bring it to life. The difficult part is launching that life into the world and then sustaining it. Design ideas die in translation, or because of changes (in the context of use, in technologies or the competitive landscape) and for a million other reasons. Our work is often obsolete within years or perhaps months. As implementors, the best we can hope for is to negotiate as long a life as possible for our digital creations. In this talk, we’ll examine where the quality of ‘aliveness’ comes from. We’ll look at ways we can seek it out and how to nurture it. We’ll examine the special role that *negotiation* plays in delivering longer-lasting design ideas, and we’ll finish up with a set of practical negotiation techniques that you’ll be able to apply within your own digital projects.</p> <p>// About Andrew<br/>Andrew Grimes (<a href=\"http://apgrimes.co.uk/\" class=\"linkified\">http://apgrimes.co.uk/</a>) is a Principal Experience Designer at Nationwide, Bristol (<a href=\"http://www.nationwide.co.uk/\" class=\"linkified\">http://www.nationwide.co.uk/</a>). He has also led research, design and strategy projects for the NHS, Liberty Global, the National Trust and Cambridge University Press amongst many others.</p> <p>Say hello at @andrew_grimes (<a href=\"https://twitter.com/Andrew_Grimes\" class=\"linkified\">https://twitter.com/Andrew_Grimes</a>)</p> ",
    "end_time": 1480629600,
    "link": "https://www.meetup.com/bristech/events/234086468/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1480618800,
    "title": "Dan Cook - Visualising Geospatial Big Data / Andrew Grimes - Design mortality"
}