{
    "cancelled": false,
    "description": "<p>// Ben Gourley - How to enjoy modern JavaScript (avoiding bloat and fatigue)</p> <p>Keeping with the times in JavaScript these days often seems like an insurmountable task. We're overwhelmed with frameworks and tools claiming to solve all of our problems, and there's a perpetual sense of having to keep up or risk falling behind. I'll share my views on the JavaScript ecosystem (with a focus on npm) and the approach I take in order to enjoy adopting modern JavaScript features.</p> <p>// About Ben</p> <p>I'm a developer who specialises in and loves working with JavaScript. I'm currently Senior Product Architect at Cloudfind, a small startup in Bath. Previously I worked at a digital agency called Clock. Away from the computer my favourite things are tennis and good coffee.</p> <p>// Fionnuala Costello - Proving the provenance and authenticity of objects of desire</p> <p>Objects of desire and innovative products will always be a target for counterfeiters. Did you know that more Manuka honey is sold in the UK alone, than New Zealand actually produce? Scottish whiskey is often “stretched” with industrial alcohol and locally produced alcohol when sold abroad. UK supermarkets now have hefty budgets for testing the authenticity of the foods they sell following the horse meat scandal.</p> <p>Counterfeits add cost to all products, so new technologies for proving and tracking the provenance and authenticity of products across global supply chains are needed now more than ever. This talk will cover some examples of blatant counterfeiting, the challenges facing companies and some of the potential solutions, including serialization, distributed ledger (blockchain) and track &amp; trace.</p> <p>// About Fionnuala</p> <p>A mechanical engineer by training, I’m responsible for the open scope programmes at Innovate UK (the UK’s Innovation Agency) which, at present, amounts to £55m per year of funding in competitions where companies from any sector and any technology can apply. I’m interested in identifying 'what it is that we aren't doing' e.g. where there’s a need in the marketplace that UK businesses can fill, with a little support or encouragement.</p> ",
    "end_time": 1488488400,
    "link": "https://www.meetup.com/bristech/events/237518970/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1488481200,
    "title": "Ben Gourley - Enjoy modern JavaScript / Fionnuala Costello - anti-counterfeiting"
}