{
    "cancelled": false,
    "description": "<p>// Martin White - What is this Internet thing anyway?</p> <p>A (high level) overview of IP network routing, Internet infrastructure and some of the organizations that make it all possible.</p> <p>// About Martin</p> <p>Martin is a Network &amp; Security consultant with over 15 years experience working with clients across sectors from manufacturing and media to telecoms, networking vendors and ISPs.</p> <p>He is the lead author of the Center for Internet Security secure configuration benchmark for Juniper JUNOS devices and has been involved with numerous other \"good of the Internet\" organizations.</p> <p>A keen attendee of Bristech, Martin lives in South Wales but works UK and EU wide.</p> <p>// Margriet Groenendijk - Data science and machine learning from your browser</p> <p>Data is available from an incredible number of sources in an endless number of formats. Data Science deals with the extraction of valuable insights from all sorts of data. Machine Learning is one of the tools to use to extract these insights and make predictions. Some of the essential packages for data scientists are numpy, pandas, matplotlib, pyspark and scikit-learn. All of which are supported by PixieDust (<a href=\"https://ibm-cds-labs.github.io/pixiedust/index.html\"><a href=\"https://ibm-cds-labs.github.io/pixiedust/index.html\" class=\"linkified\">https://ibm-cds-labs.github.io/pixiedust/index.html</a></a>), a package that makes the visualisation of data simpler with only on 'display()' API. In this talk I will show examples of Data Science and Machine Learning from a browser, using Python notebooks with UK Crime Data (<a href=\"https://data.police.uk/data/\"><a href=\"https://data.police.uk/data/\" class=\"linkified\">https://data.police.uk/data/</a></a>) and NYPD Motor Vehicle collision Data (<a href=\"https://data.cityofnewyork.us/Public-Safety/NYPD-Motor-Vehicle-Collisions/h9gi-nx95\"><a href=\"https://data.cityofnewyork.us/Public-Safety/NYPD-Motor-Vehicle-Collisions/h9gi-nx95\" class=\"linkified\">https://data.cityofnewyork.us/Public-Safety/NYPD-Motor-Vehicle-Collisions/h9gi-nx95</a></a>) and more. All examples will be on Github after the talk.</p> <p>// About Margriet</p> <p>Margriet is a Data Scientist and Developer Advocate for the IBM Watson Data Platform. She has a background in Climate Science where she explored large observational datasets of carbon uptake by forests and global scale weather and climate models. Now she uses this knowledge to create clear plots and models from diverse data sets using cloud databases, data warehouses, Spark, and Python notebooks.</p> ",
    "end_time": 1496347200,
    "link": "https://www.meetup.com/bristech/events/239099206/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1496340000,
    "title": "M White - What's this Internet thing? / M Groenendijk - Data + ML in the browser"
}