{
    "cancelled": false,
    "description": "<p>// Frank Kelly - Madness in the Dust: Is dementia prevalence related to air quality?</p> <p>In this talk Frank will explore the results from a short, collaborative ‘hack’ project with a focus on using Python-based visualisation and machine learning tools with open data from three different countries. The aim is to find out whether open data shows evidence linking increased traffic-related emissions (PM2.5) in certain residential areas with a greater likelihood of diagnosis of dementia amongst the long-term residents of those areas.</p> <p>// About Frank</p> <p>As an experienced engineer and data scientist Frank is working for HAL24K, an Anglo-Dutch-American company in the smart cities domain. There he manages a team of data scientists helping clients with city infrastructure related optimisation challenges and predictive modelling / analysis. Frank is very much involved in the Data Science and Python community, and he has been an active speaker at Python conferences including Py Data London. He uses Python as the main language for his machine learning code, making extensive use of Numpy-based packages in particular (e.g. scikit-learn and Pandas) to crunch, munge, and analyse data. He also enjoys squash and snowboarding.</p> <p>// Adam Butler - Rewired Learning</p> <p>Coders have incredibly rewarding jobs, we get to build products that change the world and improve the quality of peoples' lives. However it is also one of the most mentally challenging careers - As developers we're expected to build something from nothing, that works across a increasingly diverse range of platforms in a constantly evolving landscape, all too often with very limited resource. In this talk I'll cover these challenges as well as playful mechanics that you can use to tackle these issues, whilst developing yourself personally. We'll look at some strategies to ensure that you continue to test your assumptions, experiment often and stay motivated, including some fun hardware hacks that have taught me some genuine skills that I actually use in my job. Expect to see Eugene, the IoT taxidermy ship it squirrel, mini missile launchers, drones and plenty of other stuff that are almost certainly applicable to building real shit, you know for banks and stuff.</p> <p>// About Adam</p> <p>Ahoy!<br/>I’m Adam &amp; I’m a Bristol based Full-stack Developer &amp; technical lead of Nexmo Developer Portal &amp; previously a developer at Simpleweb.<br/>I’m the organiser of Bristol JS, a Ruby &amp; JavaScript developer, creative coder, speaker, photographer &amp; Hardware Hacker. Find out more at lab.io</p> ",
    "end_time": 1499371200,
    "link": "https://www.meetup.com/bristech/events/239997815/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1499364000,
    "title": "Frank Kelly - Big Data and Smart Cities / Adam Butler - Rewired Learning"
}