{
    "description": "<p>/ SIMON CROSSLEY - SERVERLESS COMPUTING</p> <p>Imagine if your code could be available globally 24x7, could scale automatically to meet any demand, and be totally resilient and secure; for this service you only pay for what you use, and it’s all achieved with a single command. This is Serverless computing – the latest iteration of cloud compute resources that is easier to use than ever before. Cloud providers like AWS, Google and Azure, have evolved from Infrastructure as a Service, through Platform as a Service and are now able to offer Functions as a Service.</p> <p>Streamlining DevOps towards NoOps! Serverless deployment enables many new services that were previously unfeasible, as well as promoting more distributed, event driven, web based solutions backed by an expanding eco system of developer focussed, cloud based services.</p> <p>We’ll try to get through the overview slides quite quickly, as well as the obligatory chat bot example, so we can cover some examples relevant to more typical API consumers and providers.</p> <p>/ ABOUT SIMON CROSSLEY</p> <p>The first programming languages I learned were Sinclair basic and Z80A assembler – I think that dates me pretty accurately! I now develop mainly server and web based systems, mainly using Java, but with an increasing amount of Javascript. I’ve been incredibly fortunate to have a career that I enjoy, creating a diverse range of systems, constantly evolving my skills and being challenged by new problems. So, I take one hour a week to teach coding at my local primary school, because it’s brilliant when you find kids with the promise of a similar vocation.</p> <p>My current role is Director of Engineering at MyLife Digital in Bath. We’re creating a secure platform for the storage and management of personal data; putting individuals in control of how their data is used and helping organisations develop trusted systems to handle it. We’re usually hiring.</p> <p>/ SAM HOGARTH - GRAPHQL</p> <p>An Introduction to GraphQLIn this session we’ll take a look at GraphQL – the language-agnostic server-side library from Facebook. It provides an alternative to REST-based APIs, making your data queryable. We will implement a GraphQL schema in NodeJS and demonstrate the awesome interactivity that a GraphQL endpoint opens up!</p> <p>/ ABOUT SAM HOGARTH</p> <p>I am a Senior Developer at Scott Logic, where I lead a team building an FX application for small businesses, with JavaScript and Java. I’m interested in new technologies, improving developer productivity and communicating new ideas to the developer community.</p> ",
    "end_time": 1504818000,
    "link": "https://www.meetup.com/bristech/events/241266348/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1504807200,
    "title": "Simon Crossley - Serverless Computing / Sam Hogarth - GraphQL"
}