{
    "cancelled": false,
    "description": "<p>/ Nick Hills: Alexa, spin the wheel?</p> <p>It’s that time in the morning, the office tea round. But who ‘wins’ the honour of making the round? We could patiently wait for someone to buckle and give in, or we could ask one of our digital sidekicks to spin the wheel of tea fortune. Cloud computing at its full potential? Possibly not, but let us explore the technologies, skills and challenges involved in building your own Alexa skill.</p> <p>/ About Nick</p> <p>Nick is a principal developer and Sitecore MVP working at True Clarity. At the moment most days are spent ensuring the AWS infrastructure powering easyJet’s website keeps people flying. His background is mainly web and .net focused however rather enjoys getting stuck in with all kinds of different toys and technologies.</p> <p>/ Matt Heath: Kubernetes in Context</p> <p>The rise of containerisation, orchestration, and microservices, are often rightly described as the future of computing, however they aren’t without their problems. In this talk we’ll look at some of the real world complexities and challenges we’ve faced deploying and using Kubernetes at Monzo, along with the advantages this now gives us as we rapidly develop our product and grow our company.</p> <p>/ About Matt</p> <p>Matt Heath is a Platform Engineer at Monzo, a new digital bank, and has spent the last two and a half years focusing on building the backend systems and platform which underpin the Monzo experience. Prior to this he led the development of Hailo’s global ride-sharing platform, which nurtured his love for scaling modern distributed systems in fast paced startup environments.</p> ",
    "end_time": 1509660000,
    "link": "https://www.meetup.com/bristech/events/243203541/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1509649200,
    "title": "[50th event] Nick Hills - Alexa / Matt Heath - Kubernetes"
}