{
    "cancelled": false,
    "description": "<p>/ Tim Kindberg - Blockchain for sceptics</p> <p>Lately, as a former scholar of distributed systems, including consensus protocols, I’ve become fascinated by the debate surrounding digital currency Bitcoin and other blockchain-based systems such as Ethereum. In this talk I will explain why I'm sceptical about the technologies that underlie them, summarise the case against the hype, and look at what needs to be done.</p> <p>/ About Tim</p> <p>Dr. Tim Kindberg (<a href=\"http://champignon.net\" class=\"linkified\">http://champignon.net</a>) is a computer scientist and founder of digital technology company matter II media (<a href=\"http://matter2media.com\" class=\"linkified\">http://matter2media.com</a>) whose products include social video platforms Vorb (<a href=\"http://vorb.me\" class=\"linkified\">http://vorb.me</a>) and Nth Screen (<a href=\"http://nthscreen.tv\" class=\"linkified\">http://nthscreen.tv</a>). He is based in Bristol's Pervasive Media Studio. He is co-author of the textbook Distributed Systems - Concepts and Design (<a href=\"http://cdk5.net\" class=\"linkified\">http://cdk5.net</a>) and has been visiting professor at the University of Bath and ITU Copenhagen. He has many years of experience of industrial R&amp;D in distributed, mobile and pervasive computing, and was a senior researcher at HP Labs in Palo Alto and Bristol for ten years.</p> <p>/ John Hardy - What is money and why is Bitcoin so revolutionary?</p> <p>92% of the world’s money is now held as digital records as opposed to physical cash. Since Bitcoin is also a digital record - what makes it different? <br/>For something so deeply ingrained in society, we rarely question what money even is. To understand Bitcoin we need not only understand how it works as a technology, we must also answer the deeper social question of what money is and what gives it its value. This talk will attempt to establish just that.</p> <p>/ About John</p> <p>John Hardy has been a self-confessed Bitcoin fanatic since 2011. A background in both finance and software development puts him in the unique position of being able to recognise the value of Bitcoin from both a technical and economic perspective. He has been committed to advocating Bitcoin through his blog SeeBitcoin.com, and also to developing new ideas to help Bitcoin realise its potential.</p> ",
    "end_time": 1512684000,
    "link": "https://www.meetup.com/bristech/events/244121171/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1512673200,
    "title": "Tim Kindberg - Blockchain for sceptics / John Hardy - Bitcoin is revolutionary"
}