{
    "description": "<p>/ Nello Cristianini - The Relation between Media and Artificial Intelligence</p> <p>The combination of machine learning with big data has enabled us to create a new generation of Artificial Intelligence and now we interact with its applications every day. The strategic position occupied by AI agents within our global information infrastructure means that they are in the position to observe a large portion of our activities, learning from them, but also creates new types of risk, including the possibility of surveillance and manipulation of user behaviour.</p> <p>Based on the details of how AI has emerged from the combination of machine learning and this unified data infrastructure, we can understand recent reports that have raised concerns, from fake news to psychometric election targeting, from criminal justice applications to dynamic pricing in insurance based on social media content. We discuss both sides of this relation: analysing the contents of media with AI tools, as well as studying how the contents of media can affect modern AI, and vice versa.</p> <p>/ About Nello</p> <p>Nello Cristianini is Professor of Artificial Intelligence (AI) at the University of Bristol. His current research covers the large-scale analysis of media content (news and social media), using various AI methods, the design of new AI methods, their application to digital humanities and computational social science, and the social impact of Big Data and AI technologies. Cristianini is the co-author of two widely known books in machine learning, An Introduction to Support Vector Machines and Kernel Methods for Pattern Analysis, as well as a book in bioinformatics, Introduction to Computational Genomics. He is also a recipient of the Royal Society Wolfson Research Merit Award and a current holder of a European Research Council Advanced Grant. In 2014, Thomson-Reuters included him in a list of the most influential computer scientists of the decade. Before joining the University of Bristol, he has been a professor of statistics at the University of California, Davis. Currently he is working on social and ethical implications of AI.</p> <p>/ Simon Crossley - Developing Appropriate Respect for Personal Data</p> <p>Do you store or process users' personal data? Do you take sufficient care of their data to deserve their trust? This session will summarise the regulatory and ethical obligations of those who handle personal data. We'll explore architecture and design considerations to meet those obligations, and the cultural changes and operational processes to maintain them as systems evolve.</p> <p>Data privacy howlers! There are plenty of recent examples of privacy breaches that we can all learn from. Securing personal data. Techniques to protect and encrypt data. Designing for privacy. Know your data, and be accountable to users. UX design. Capturing consent and progressive disclosure.<br/>Development Processes. Designing and maintaining systems. Compliance. Impact of GDPR. Finding a pragmatic route to compliance for data controllers and data processors. Emerging Standards. Extensions to OAuth2. The Nordic model of user-centric data. Interoperability and Portability.</p> <p>/ About Simon</p> <p>The first programming languages I learned were Sinclair basic and Z80A assembler – I think that dates me pretty accurately! I now develop mainly server and web based systems, mainly using Java, but with an increasing amount of Javascript. I’ve been incredibly fortunate to have a career that I enjoy, creating a diverse range of systems, constantly evolving my skills and being challenged by new problems. So, I take one hour a week to teach coding at my local primary school, because it’s brilliant when you find kids with the promise of a similar vocation.</p> <p>My current role is Director of Engineering at MyLife Digital in Bath. We’re creating a secure platform for the storage and management of personal data; putting individuals in control of how their data is used and helping organisations develop trusted systems to handle it.</p> ",
    "end_time": 1519939800,
    "link": "https://www.meetup.com/bristech/events/246745783/",
    "location": null,
    "org": "bristech",
    "start_time": 1519930800,
    "title": "*CANCELLED* Nello Cristianini - Media and AI / Simon Crossley - GDPR"
}