{
    "cancelled": false,
    "description": "<p>// Katy Anton - How to implement Digital Identity the right way</p> <p>When talking about digital identity, we refer to a unique representation of a user who engages in an online transaction. This needs to take into account both digital authentication and session management. Digital authentication is the process of verifying that an individual or entity is who they claim to be. Session management is a process by which a server maintains the state of the user's authentication so that the user may continue to use the system without re-authenticating.</p> <p>To securely implement digital identity in applications is hard. To prove that someone is who they claim to be, remotely, via digital services, and that this identity is preserved throughout the entire transaction, is full of opportunities for attackers to successfully impersonate someone's digital identity.</p> <p>This presentation will discuss the different types of applications and the appropriate levels of digital identity suitable for each of them. For each level, we will explore how to securely implement digital identity in software applications.</p> <p>// About Katy</p> <p>Katy Anton is a security professional with a background in software development.</p> <p>In her previous roles she led software development teams and implemented security best practices in the software development life cycle. As part of her work she got involved in the OWASP Top Ten Proactive Controls project where she joined as project leader.</p> <p>In her current role as Principal Application Security Consultant at Veracode, Katy works with security teams and software developers around the world and helps them secure their software.</p> <p>// David McGoran - New design tools for a new robotic industry</p> <p>Robotics is hard: Managing the integration of kinetic and sensing technology with complex behaviour and intelligent systems is challenging enough in itself. Attempting to also ground the work in clear design thinking and holding it accountable to an artistic vision is extremely ambitious.</p> <p>Through spectacular failures, surprising successes and heard learnt lessons the Squids have had to go back to first principles and take a serious look at the tools and processes we were using.</p> <p>// About David</p> <p>David McGoran is creative and managing director of Rusty Squid, a Bristol based studio pioneering the application of robotic technology with in the creative industries. With his roots in the performing, and visual arts as well as in robotic engineering and design he has been leading a small team for the past 5 years to lay the foundations for a potentially new creative industry.</p> <p>David is a graduate of the National Theatre School of Canada and has a Bsc in Robotics from the University of the West of England, trained classically in dance and has studied movement analysis, and puppetry. He trained as a robotic engineer with the specific goal of bringing contemporary control and sensor technology along with artificial intelligence systems back to the creative industries.</p> <p>Drawing on aspects of kinaesthetic empathy, emergent behaviour and somatic experience Rusty Squid explores robotics ability to trigger almost involuntary emotional reflexes from the general public. The studio interrogates the ongoing co-evolution between technology, humanity and nature, and invites the public to a profoundly new cultural experience. Rusty Squid is dedicated to developing an integrated working practice for its team of artists, designers and engineers.</p> <p>Strongly influenced by his background in dance, movement analysis, and puppetry, David goes back to first principles of how movement is generated by designing new actuators, mechanisms and algorithms to sculpts the physical and emotional space between body and machine.</p> ",
    "end_time": 1525377600,
    "link": "https://www.meetup.com/bristech/events/248532338/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1525370400,
    "title": "48. Katy Anton - Digital Identity / David McGoran - Robotic Design Tools"
}