{
    "cancelled": false,
    "description": "<p>// DR DAVID BERNHARD - ZERO KNOWLEDGE PROOFS (ZKP)<br/>One of the worst ways to do authentication is for a client to send over its secret credential every time it logs in, which the server then compares to a copy of the credential that it stores in plain text. This talk will explain the cryptographer’s view of the best way to do authentication (PhD in cryptography NOT required), known as zero-knowledge proofs. Protocols of this kind underlie digital signatures such as DSA/ECDSA/EdDSA which are used among other things in FIDO authentication, which you can already use to log in to services such as github and gmail; and are required for compliance with the highest levels of NIST authentication standards.</p> <p>// ABOUT DAVID<br/>Dr. David Bernhard is a Teaching Fellow in the Department of Computer Science at the University of Bristol. David holds a PhD in cryptography and has worked as a software developer (Java EE applications) and as a consultant for electronic voting projects.</p> <p>// NICK SOPER - OCCUPATIONAL BURNOUT<br/>The tech industry is full of motivated, passionate people. We are proud of our work and we are prepared to go the extra mile to achieve our goals.</p> <p>These are brilliant qualities, right? Any entrepreneur needs motivation and drive if they're going to make their business work... The model employee is dedicated and hard working...</p> <p>But life as a driven, dedicated person can have a more insidious side. Working hard can eat away at other aspects of your life - your family and friends can be affected. It's very easy to fall into a vicious spiral and get BURNT.</p> <p>I'll be talking about my experience of burning out and what I'm doing to address it.</p> <p>This is an all too common problem in our industry, so hopefully my little talk will help start some conversations...</p> <p>// ABOUT NICK<br/>I've been a professional geek since 2005 when I graduated from Exeter University with a degree in Computer Science.</p> <p>I started my career as a logistics analyst at the MOD, creating and using analytical tools with WinForms. I then moved to the Higher education sector writing the backed C# for administrative web apps. I spent a few years in fintech consultancy with Scott Logic - where I learned to tame the beast that is JavaScript! And now I'm at Rocketmakers, working with innovative startups and honing my cross platform mobile skills.</p> ",
    "end_time": 1533240000,
    "link": "https://www.meetup.com/bristech/events/251877320/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1533232800,
    "title": "#51 - DR DAVID BERNHARD - ZK PROOFS (ZKP) / NICK SOPER - OCCUPATONAL BURNOUT"
}