{
    "cancelled": false,
    "description": "<p>// TONY BUTTERFIELD - Resource Oriented Computing with NetKernel</p> <p>We’ll take a deep dive into resource oriented computing (ROC) and see what happens when you take “everything is a resource” to the extreme. We’ll see how you can compose software with microservices at the small scale as well as the large.</p> <p>First I’ll give you an introduction to the motivations and concepts behind ROC, and what that means in practice.</p> <p>Then we’ll look at NetKernel's model for caching, looking at it’s 3 aspects: identity, scope, and validity. We’ll see how this leads to a general way to cache computation across programming languages.</p> <p>Finally we’ll see what happens when scope exists in the middleware outside of the programming language. This leads to some interesting new design patterns and simplifies microservice interactions.</p> <p>If you’re interested in microservices, or just love computer science, then this talk with give you food for thought.</p> <p>// About Tony<br/>Tony started programming as a kid on 8-bit computers where he released his first commercial game at 15. He honed his skills poring over Z80 data sheets and hand crafting machine code. After learning to do it “properly” at university he entered the boring world of business computing. Never satisfied with the status quo though, he always looked to find better ways to do things by understanding the principles and origins of computing. He stumbled upon what has become resource oriented computing 16 years ago, and has been exploring that rabbit hole ever since. Tony is cofounder and CTO of NetKernel.</p> <p>Other interests include trekking off the beaten track with his trusty stick carrying companion, and attempting to build the world's smartest smart home featuring over 140 sensors at last counting, including a geiger counter, traffic speed radar, and an aquarium with a lighting rig more complex than most pop concerts.</p> <p>// ALEX OGILVIE - Automated dependency tracking using Network Theory</p> <p>In engineering, designing complex systems is a huge task made up of large teams of design engineers managing hundreds of components, thousands of files and hundreds of thousands of dependencies. One of the main challenges within these projects is tracking the dependencies between files and monitoring the effect of change in the system. Design Structure Matrices (DSMs) have been used in systems engineering and project management to model the structure of complex systems as a dependency network; perform system analysis; and aid project planning and organisational design since the 1960s, but this is traditionally a laborious task resulting in outdated analysis. This talk will explain how a simplistic artificial intelligence has been developed to automate DSM creation, enabling real time dependency tracking and analysis to alleviate these issues within engineering and beyond.</p> <p>// About Alex Ogilvie, Will Worrall, Charlie Bickerton</p> <p>Alex, Will and Charlie are Engineering Mathematics graduates from the University of Bristol. Since graduating they have founded Miminal, a data science consultancy providing bespoke data science services to companies looking to leverage the power of data science, artificial intelligence and machine learning but lack the in-house capacity and/or expertise. The trio have recently been accepted into the Oracle Scaleup Ecosystem and included in Business Insider’s Southwest 42 Under 42, which profiles 42 young entrepreneurs and business leaders who should be on your radar.</p> ",
    "end_time": 1536264000,
    "link": "https://www.meetup.com/bristech/events/251951191/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1536256800,
    "title": "#52 - TONY BUTTERFIELD - ROC / ALEX OGILVIE - AI + Dependencies + Network Theory"
}