{
    "description": "<p>// MATT MCGOWAN - MODULAR MONOLITHS WITH THE ACTOR MODEL</p> <p>Microservices allow you to scale your application and organisation as your product grows. Now your method calls are replaced with http layers, system testing involves a suite of applications, in-app refactorings become breaking changes between services, and you introduce orchestration complexity. At scale these may actually be solutions to problems, but for a small team at the beginning of a project the extra complexity could spell disaster.</p> <p>This talk presents a method for building a modular monolith using Akka, an implementation of the actor model for the JVM and .NET, and how to scale out to microservices if and when it's right for your business.</p> <p>// ABOUT MATT</p> <p>With experience working in a successful FinTech startup, Matthew McGowan now works in the R&amp;D department at Jisc, architecting and building new products for the academic research sector. He loves talking about tech and sailing, or anything else if it's over a pint.</p> <p>// KENNY GRAY &amp; BEN CUBBON - DIGITAL ACCESSIBILITY: WHAT IS IT AND WHAT CAN I DO ABOUT IT?</p> <p>How did you check what the weather would be this morning before you left the house?</p> <p>Did you see a cloud icon?<br/>Was it read out to you?<br/>Did you look for the temperature and see blue as an indication for cold?</p> <p>There are multiple ways to find out the same information that ensures everyone can benefit from knowing that they will need their umbrella today. This is accessibility.</p> <p>“This is for everyone” the famous words from Tim Berners-Lee that lit up the London Olympic games, it’s a sentiment that is hard to disagree with, in fact it’s impossible to disagree that the web is for everyone. In accepting this we need to remind ourselves that everyone is different, we all have different abilities, different ways of digesting information and different access needs. Therefore accessibility should be at the heart of everything we do.</p> <p>In this talk we’ll be looking at what accessibility is, why we should care about it and what we can start doing to make sure our web applications are as accessible as possible.</p> <p>You should walk away with a better understanding of the different access needs people have and be ready to start making your part of the web a more accessible place.</p> <p>// ABOUT KENNY</p> <p>Kenny Gray is a Full Stack JavaScript Developer working for OVO Energy and has specialised in Front End Development working with React. With a keen interest in providing accessible experiences he helps co-lead OVO's Accessibility Community of Purpose and has created an open source library (react-aria-accordion) that combines his interest in accessibility and React.</p> <p>Kenny also enjoys playing board games, Dominion being his favourite.</p> <p>// ABOUT BEN</p> <p>User Research Practice Lead at OVO Energy, understanding emerging user needs in a world of increasingly complex energy choices, electric vehicles, and connected devices.</p> <p>Ensuring that everyone has access to clean and abundant energy by co-leading OVO’s Accessibility Community of Purpose.</p> <p>Previously in Government at HM Courts and Tribunals Service, understanding the needs of all users to inform the design of a Reformed Justice System, and at the Office for National Statistics.</p> <p>Tin-Tin look-a-like, apparently.</p> ",
    "end_time": 1547154000,
    "link": "https://www.meetup.com/bristech/events/255446901/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1547146800,
    "title": "#55 - M MCGOWAN - AKKA / K GRAY & B CUBBON - DIGITAL ACCESSIBILITY"
}