{
    "description": "<p>// STEPH LOCKE &amp; SARAH WILLIAMS - THE INSIDE OF NIGHTINGALE: BUILDING A STARTUP</p> <p>We're building a startup called Nightingale HQ and we're still working out the best way to tell you what it does! Come along to this talk to see into an early-stage startup and see what the business stuff is like and what the tech stack behind us is. Learn about what it takes, what resources are available to you, and how you approach building for rapid change and for scale.</p> <p>// ABOUT STEPH AND SARAH</p> <p>Steph's a data science consultant with a black belt in educating people in better uses of their data. Sarah is a tech extraordinaire who helps startups achieve a tech stack and approach that supports the business strategy. Together, they head up Nightingale HQ. When they're not CEO and CTO-ing it up, Steph spends her time globetrotting to conferences and Sarah goes nuts for Eurovision. Follow them on twitter at @theStephLocke and @ff0brickcode for the trials and tribulations of tech, startups, and most importantly, having doggo overlords.</p> <p>// LIDA GHAHREMANLOU - AUTOML ON AZURE</p> <p>In this talk, I will briefly review AI and Machine Learning concepts. I will then particularly demonstrate Automated Machine Learning capabilities, known as AutoML, in Microsoft Azure Cloud. In an inspiration of International Women Day, I will also provide the audience with some of my personal experience and insights a female in different Tech environments for over a decade.</p> <p>// ABOUT LIDA</p> <p>Dr Lida Ghahremanlou will give a talk on Machine Learning in TechHer event on 30th Oct. Since completing her PhD degree in Computer Science from RMIT University in 2014, Lida has pursued postdoctoral work at RMIT and IBM-Research in Australia, and Coventry and Birmingham City universities in the UK, on different Data Science and Machine Learning projects. Her collaborative research and work have resulted in several patents and journal publications.</p> <p>Lida has joined Microsoft UK as an Advanced Analytics &amp; AI Solutions Professional in 2018, and her current focus is on applying Machine Learning and Deep Learning techniques in Azure Cloud Computing environment. Lida also work as a fiction writer and translator in her spare time. Computer is her career while Literature is her passion.</p> ",
    "end_time": 1551992400,
    "link": "https://www.meetup.com/bristech/events/258791864/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1551985200,
    "title": "#57 S. LOCKE / S. WILLIAMS: BUILD A STARTUP / L. GHAHREMANLOU - AUTOML ON AZURE"
}