{
    "cancelled": false,
    "description": "<p>**IMPORTANT NOTE** - there has been a speaker change at this event.</p> <p>Sash Rigby is no longer able to make it due to ankle surgery.</p> <p>// Dan Shien &amp; Simon Lock - A modern approach to teaching software engineering<br/>In this talk we will present our innovative 2nd year software engineering project unit at the University of Bristol. In contrast to traditional software engineering programs our students work in consultancy style on projects for real clients.</p> <p>We will present the learning goals, and the syllabus that we deliver, talk about our experience and illustrate the advantages and challenges associated with examples of past projects.</p> <p>// About Dan Schien and Simon Lock<br/>This presentation is a double act by Dr Dan Schien and Dr Simon Lock from the University of Bristol. Dan is a Lecturer in Computer Science and Simon is a Senior Teaching Fellow at the University of Bristol where they teach, among others, software engineering and cloud computing.</p> <p><a href=\"http://www.bristol.ac.uk/engineering/people/daniel-schien/\" class=\"linkified\">http://www.bristol.ac.uk/engineering/people/daniel-schien/</a><br/><a href=\"http://www.bristol.ac.uk/engineering/people/simon-lock/index.html\" class=\"linkified\">http://www.bristol.ac.uk/engineering/people/simon-lock/index.html</a></p> <p>// Alan Furlong - 7 Lessons From Science That Will Improve Team Collaboration</p> <p>What if there were some universal truths about how to develop a great team?<br/>What if those universal truths could be replicated in any team AND what if we had rock solid proof that these truths really do work?<br/>Today, because of science and psychology, we can answer those ‘what if’<br/>questions with confidence.<br/>This fascinating, engaging and humorous talk will share the seven most<br/>important insights we’ve gleaned in the last 15 years from social psychology, informatics, neuroscience and positive psychology into what makes a team truly thrive and why so many teams struggle with low engagement and motivation.<br/>So, if you lead a team, or if you’re a team member wondering how you could make things better for everyone, this talk is for you. Our time together will be focused on practical, actionable tactics, rather than scientific chest beating.<br/>You will walk away with at least two simple interventions that are proven to significantly impact you, or your team in a short space of time. They will improve collaboration, morale, quality of productivity and more.<br/>Intrigued? See you at the talk.</p> <p>// About Alan</p> <p>Alan Furlong (MBA, BA Hons, Cert Pos Psych) is the co-founder of Sherpa People Systems, a company that is focused on executing ‘people science’ interventions to improve all human aspects of Agile Leadership, Agile Teams and Agile culture. He has been a HR, Training, Sales<br/>and Marketing professional, Entrepreneur and Training Company founder.</p> <p>He has worked in Europe, Asia and Australia.</p> ",
    "end_time": 1559851200,
    "link": "https://www.meetup.com/bristech/events/260909094/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1559844000,
    "title": "#60 DAN SCHIEN - MODERN APPROACHES TO TEACHING SW ENG / ALAN FURLONG - TEAMWORK"
}