{
    "description": "<p>// Katie Koschland - Ready, Steady, Crash!</p> <p>This talk will cover the core concepts behind load testing.</p> <p>It will look at what it means to ‘load test’ your application, how to get started with writing your first script and provide you with a case study and an insight into the tools and techniques that we use at the FT to help identify performance issues.</p> <p>// About Katie</p> <p>Katie Koschland is a Junior Engineer at the Financial Times. She is currently working in the Internal Products team building tools for employees of the company.</p> <p>Prior to the FT, she attended the University of Leeds where she studied Actuarial Maths and attended a coding bootcamp called Makers Academy.</p> <p>She is passionate about problem solving and you can find her sharing her thoughts on Twitter at @KKoschland.</p> <p>// Mike Moate - Anatomy of a Go Microservice at Countingup</p> <p>Mike will demonstrate how Countingup build, package and document their Go based microservices. This will include a basic intro to Go, use of Docker (including multi stage builds) and API definition &amp; documentation using Swagger (using the go-swagger tooling and code generation).</p> <p>// About Mike</p> <p>Mike is currently CTO at Countingup, combining banking and accounting in one place for people running their own business in the UK. He started out in the embedded software space, working in C and ARM assembly, but has since been fortunate enough to work across a myriad of industries and with a huge variety of technology. Prior to Countingup, Mike was Head of Platform at Oliver Wyman Labs (who bring together management consulting and technology to help businesses make sense of their data) where he introduced Infrastructure as Code practices.</p> ",
    "end_time": 1562270400,
    "link": "https://www.meetup.com/bristech/events/261638295/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1562263200,
    "title": "#61 KATIE KOSCHLAND - LOAD TESTING / MIKE MOATE - GO MICROSERVICES"
}