{
    "cancelled": false,
    "description": "<p>// Severin Lemaignan - What does it take to bring robots to a school?</p> <p>The talk will take a broad perspective on robots for education: from small non-social mobile robots to very social artificial agents, where do we stand today in terms of technical challenges to build powerful new paradigms for robots for learning? I will build on results collected over the last few years in a dozen of different schools to also attempt to sketch future directions of research, from interactive machine-learning to data-driven social dynamics.</p> <p>// About Severin</p> <p>Dr Séverin Lemaignan is a Senior Researcher at the Bristol Robotics<br/>Laboratory, University of the West of England, Bristol. Previously, he<br/>obtained a joint PhD in Cognitive Robotics from the CNRS/LAAS (France)<br/>and the Technical University of Munich (Germany) for which he received<br/>the ‘Best PhD in Robotics 2012’ award from French CNRS. He then<br/>conducted his research as Research Fellow at EPFL (Switzerland) and<br/>Plymouth University (UK) where he was Lecturer in Robotics until 2018.</p> <p>His research interests primarily concern the socio-cognitive aspects of<br/>human-robot interaction, both from the perspective of the human<br/>cognition and the design of cognitive architectures for the robots.<br/>More recently, he has been focusing his experimental work on child-robot<br/>interactions in educative settings, exploring how robots can support<br/>teachers and therapists to develop effective and engaging novel learning<br/>paradigms.</p> <p>// Toby Harris - Taking stock: what made a maker business</p> <p>Kickstarter pitches are now part of maker culture, but when do you hear back from the other side?</p> <p>How did an Arduino hack turn into £50k in pre-orders? How do you get an assembly line going if all you have is a laptop? Four production runs and a retail partnership later, what were the final accounts?</p> <p>Join Toby Harris as he talks product and dissects a successful run of a maker business.</p> <p>// About Toby</p> <p>A product-focussed generalist with a soft spot for python and a CV that includes getting a robot to do stand-up comedy.</p> ",
    "end_time": 1567713600,
    "link": "https://www.meetup.com/bristech/events/261861553/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1567706400,
    "title": "#62 S LEMAIGNAN - ROBOTS + EDUCATION / T HARRIS - MAKING A MAKER BUSINESS"
}