{
    "cancelled": false,
    "description": "<p>// Andy Buckingham - Broadcasting in an IP world</p> <p>As we hurtle towards 2020, why is FM and DAB radio still important in our mobile-first IP-based world?</p> <p>Andy will explain his work in bridging the broadcast and technology worlds, discussing recent trends across radio and digital audio, and showcasing some of the technologies actively being developed.</p> <p>// About Andy</p> <p>Andy Buckingham has been a Creative Technologist within the radio industry for over ten years, working with the likes of BBC R&amp;D and the industry's Radioplayer. Previously Andy has worked in technology and content production roles for the UK's two largest commercial radio groups. He's also a co-founder of RadioDNS, the not-for-profit developing and standardising hybrid radio.</p> <p>// Ivan Pedrazas - Kubernetes, GitOps, Whatever<br/>This talk tries to explain why the industry has adopted Kubernetes and how come GitOps is gaining so much velocity. This talk is about Application lifecycle and business value. It is less about the How to do, and more about understanding what is Kubernetes, what's the value and why the speedy adoption. We will see how CI and CD are evolving and what to expect in the near future when adopting patterns like GitOps. This is a good talk to get a clear understanding of what is Kubernetes. Not very technical, but very insightful.</p> <p>// About Ivan<br/>Ivan has a background in development and architecture. He has been helping companies like the UK Home Office, State Street, Soho House, or currently at InfluxData to adopt Kubernetes and release better software, more often. He enjoys designing and building platforms on distributed systems. Ivan has been running Kubernetes in production for the last four years.</p> <p>Ivan is very involved in the community and he runs the Kubernetes London Meetup and, the London Production Workgroup also known as the secret meetup.</p> ",
    "end_time": 1575579600,
    "link": "https://www.meetup.com/bristech/events/264779282/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1575572400,
    "title": "#64 ANDY BUCKINGHAM - HYBRID RADIO / IVAN PEDRAZAS - K8S & GITOPS,"
}