{
    "description": "<p>// Jamie Cruickshank - Make Car Drive Self</p> <p>Self-driving cars are coming and the benefits will be huge. With this new tech just around the corner, it’s vital that the new breed of transport services will be available to everyone.</p> <p>People of every gender, race, age, ability and economic background must be able to use and benefit from a safe, accessible shared service.</p> <p>What can we do to make sure this happens? How can we find, celebrate and amplify the voices that need to be heard? How can we create a service for all of society? And how does it all work anyway?</p> <p>// About Jamie</p> <p>Jamie Cruickshank is a Software Engineer at FiveAI where he works on cutting-edge self-driving tech, in particular sensor registration, motion detection, and 3D reconstruction.</p> <p>By night he is a musician, having co-founded Breakfast Records. Find him on Spotify!</p> <p>// Rebecca Gray - Focusing teams on outcomes instead of outputs</p> <p>It’s really easy for teams to work super hard and deliver a bucket load of outputs that don’t necessarily deliver any value for customers.</p> <p>We all know that we should be focusing on outcomes instead of outputs but it’s more difficult to figure out how to practically do that.</p> <p>Rebecca will be helping us to unpack some really simple ways to help teams focus on outcomes.</p> <p>// About Rebecca</p> <p>Rebecca Gray is a Product Manager at OVO Energy whose mission is to support our customers on a journey to zero carbon. She has a range of experience working with many teams across different areas such as Finance, Fitness and Education.</p> <p>Outside of work, she is passionate about working with young children and loves organising summer camps for local children.</p> ",
    "end_time": 1578603600,
    "link": "https://www.meetup.com/bristech/events/265178133/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1578596400,
    "title": "#65 JAMIE CRUICKSHANK - MAKE CAR SELF DRIVE / REBECCA GRAY - FOCUS ON OUTCOMES"
}