{
    "description": "<p>// Matt Jarvis - KUDO: universal operators for K8S</p> <p>Kubernetes Operators are the next phase of the journey towards automating complex applications in containers. The KUDO project introduces an easy way to build Kubernetes operators using declarative YAML. Many Operators that exist today handle initial deployment, but they don’t provide automation for tasks like binary upgrades, configuration updates, and failure recovery. Implementing a production-grade controller for a complex workload typically requires thousands of lines of code and many months of development. As a result, the quality of operators that are available today varies. The KUDO project provides a universal operator to enable automated creation of operators for Kubernetes, in most cases just using YAML. In this talk, I’ll introduce the KUDO project, and demo the creation of a Kubernetes operator using KUDO.</p> <p>// About Matt</p> <p>Matt Jarvis is Senior Director of Community and Evangelism at D2iQ ( formerly Mesosphere). Matt has spent more than 15 years building products and services around open source software, on everything from embedded devices to large scale distributed systems. Most recently he has been focused on the open cloud infrastructure space, and in emerging patterns for cloud native applications.</p> <p>// Adam Jones - Teabags, muddy knees and imposter syndrome: Atypical careers in tech</p> <p>In a career spanning the factory floor, call centres, dev teams and board rooms, it's fair to say Adam has had some pretty varied life experience. In this talk he will share his personal reflections on what it means to navigate a career from an atypical path. He will discuss the value of experience which comes outside of typical education to work routes and how this cognitive diversity adds value, especially in technology. Ultimately, the session will provide insight on what this means for building great teams, and also getting the best out of ourselves.</p> <p>// About Adam</p> <p>Adam is the CTO of Redington, a fintech who are on a mission to help make 100 million people financially secure. He has worked in FinTech for a decade, ranging from some of the largest banks in the world to disruptive and innovative start-ups. He joined Redington as CTO in 2017 to deliver their next generation of technology tools.<br/>Before Redington, Adam was Head of Innovation for Altus Consulting where his areas of focus were Fintech, Wealth and Investment Management and the impact of Artificial Intelligence and emergent technologies on these sectors.<br/>In addition to his role as CTO of Redington, he is a trustee of RedSTART a financial education charity, a visiting lecturer<br/>at Henley Business School and sits on the advisory board for the Department of Accounting, Economics and Finance at UWE.</p> ",
    "end_time": 1581022800,
    "link": "https://www.meetup.com/bristech/events/265178068/",
    "location": {
        "address": "BS1 6QH",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.448997497558594,
        "longitude": -2.583498001098633,
        "name": "Bristol Engine Shed @ Temple Meads"
    },
    "org": "bristech",
    "start_time": 1581015600,
    "title": "#66 MATT JARVIS - K8S UNIVERSAL OPERATORS / ADAM JONES - ATYPICAL TECH CAREERS"
}