{
    "description": "<p>IMPORTANT NOTE - DUE TO THE ONGOING SITUATION CONCERNING CORONAVIRUS THIS EVENT WILL BE HELD **ONLINE**</p> <p>// Barbora Spacilova - Making our Junior Devs happy ;)</p> <p>In the times of growing IT skills gap hiring junior talent is no longer just an option. As such, the change from onboarding new senior team members to junior ones brings new challenges on several levels.</p> <p>What struggles do junior devs go through? How to understand the situation through a learning theory? How can you frame your experience as a senior for the benefit of the whole team?</p> <p>The talk is neither an exhaustive guide nor a one-size-fits-all solution. It is a set of real-life observations, from a years long journey in up-skilling junior talent and working with teams that hire them.</p> <p>// About Barbora</p> <p>Barbora studied political science at the University of Vienna, Austria. Her own life took a completely different direction when she re-skilled for advanced analytics. After getting experience in the field, she started passing the fun of data on. She has spent the past two years upskilling people of different backgrounds to IT: From one day intro workshops to full-blown, full-time 12-week-long courses. Various ages, different continents, as a volunteer and for business.</p> <p>// Warren Boult - Kubernetes-native Machine Learning pipelines with Argo and Seldon</p> <p>The task of taking machine learning models from prototype stage up to production can be a painful one for a whole host of reasons. Fortunately, tools such as Argo and Seldon can help make this process smoother, while also leveraging the computing power often required to build models today. My talk will give an overview of how these tools can make the life of machine learning engineers easier, along with a quick demo of the tools in action on an example machine learning pipeline.</p> <p>// About Warren</p> <p>My name is Warren Boult, and I'm a full stack engineer with Candide - a social app for gardening enthusiasts. I enjoy working right across the stack, but my real passion lies in the machine learning and big data side of things.</p> ",
    "end_time": 1585857600,
    "link": "https://www.meetup.com/bristech/events/268629370/",
    "location": {
        "address": "Hangout link to be supplied",
        "city": "Mobile",
        "country": "us",
        "latitude": 34.63056182861328,
        "longitude": -40.77935791015625,
        "name": "**ONLINE VIA VIDEOCONFERENCE**"
    },
    "org": "bristech",
    "start_time": 1585850400,
    "title": "#68 [ONLINE]: BARBORA S. - HAPPY JUNIOR DEVS  / WARREN B. - ML ARGO & SELDON"
}