{
    "cancelled": false,
    "description": "<p>// Matt Sinton-Hewitt - Scala 3: The best thing since Scala 2<br/>Scala 3 is expected to be released later this year. This is an overview of some of the changes that come with Scala 3 and my opinion on their impact. If you have never seen Scala code before this could be an interesting way to gain some insight into what its like to work with!</p> <p>// About Matt<br/>Matt Sinton-Hewitt is an enthusiastic functional programming geek, a proud Dad of two and a wannabe climber.</p> <p>// Jonathan Hendry - Satellite Imagery Analytics<br/>Space technology is providing a vast archive of images of the earth, which are updating very frequently. These images provide an objective, consistent and repeatable data source, that can be processed to understand the state of the planet. However, the nuances and complexity of the data presents a range of technical challenges. 4 Earth Intelligence focuses on utilising machine learning (and other data science approaches), to harness satellite images to answer a range of customer questions. This will be a whistle-stop tour of satellite imagery processing, focusing on several successful use cases.</p> <p>// About Jonathan<br/>Jonathan is a technical Project Manager with 4 Earth Intelligence. He enjoys all the running Bristol's endless green space has to offer. He enjoys database design architecture and management (PostgreSQL and Microsoft SQL) within the context of Geodata as well as full web stack development. Focuses specifically on handling large volumes of data to deliver satellite derived information within multiple concurrent international projects all from a comfortable Bristol base.</p> ",
    "end_time": 1591300800,
    "link": "https://www.meetup.com/bristech/events/269348460/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1591298100,
    "title": "BRISTECH: BYTESIZE #3 -  MATT SINTON-HEWITT - SCALA 3 / JONATHAN HENDRY"
}