{
    "cancelled": false,
    "description": "<p>// Malcolm Holmes - Introducing Tanka: From configuration as data to configuration as code</p> <p>There are various tools available for managing Kubernetes resources, whether they be Helm, Kustomize or others, all of which felt too limiting to us. In this presentation we will introduce Tanka, a tool developed at Grafana labs and available on GitHub. We will introduce the Jsonnet language, and demonstrate its power as a way of interacting with Kubernetes. We will then demonstrate some of the enhancements we have already made to Tanka, and then explain our roadmap for the tooling, and how we believe it is already the best of breed configuration management solution for Kubernetes.</p> <p>// About Malcolm<br/>Malcolm Holmes is a software engineer and SRE. A member of the Apache Software Foundation for 15 years, he now works at Grafana Labs on their Infrastructure team, where is helping to develop Tanka, and the ecosystem around it.</p> <p>// Sandhya Gopchandani - Kubeflow - leveraging Kubernetes - is transforming the way machine learning experiments are performed. This talk would be an overview of Kubeflow and Pipelines. We will discuss the problems it can solve and how it can help accelerating machine learning delivery in production.</p> <p>// About Sandhya<br/>Sandhya Gopchandani is a Machine Learning Engineer at iManage. She is part of a data science team responsible for developing cloud scalable machine learning infrastructure using Kubernetes and Kubeflow. She received an MS in computer science from the University of Vermont last year with a focus on data science and natural language processing.</p> ",
    "end_time": 1592510400,
    "link": "https://www.meetup.com/bristech/events/269991240/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1592507700,
    "title": "BRISTECH: BYTESIZE #4 - MALCOLM HOLMES - GRAFANA TANKA / SANDHYA GOPCHANDANI"
}