{
    "cancelled": false,
    "description": "<p>// Simon Smith - Detecting Financial Crime with Knowledge Graphs<br/>When large quantities of money are obtained illegally, the criminals need to make this money useful - typically through money laundering. Here money is moved about in complex manoeuvres with the goal of masking the link between the money and the original crime. Banks, therefore, are often unknowingly (and occasionally knowingly!) transforming this 'dark money' into clean, respectable money that can be used anywhere in the world.</p> <p>To counteract this, banks and many other companies are obliged under government regulations to prevent money laundering, fraud, bribery and corruption and many other financial crimes through a series of mandatory processes; transaction monitoring, screening new clients to the bank, monitoring behaviour and information about clients over time. Technically speaking, the issue is to find (rare) nefarious actors within a large population of innocent ones.</p> <p>Knowledge graphs represent information in a well-defined, machine-readable way - this allows data to be fused together producing an output that is more than the sum of the parts. It therefore offers an excellent choice of technology in terms of pulling together all the information needed to detect actors involved in financial crime.</p> <p>At Ripjar, we are working towards building the world's largest financial risk graph, a knowledge graph built up of many data sources – structured and unstructured - that allow the detection of actors likely to be involved in financial crime.</p> <p>This talk motivates the problem with a brief introduction into financial crime, before discussing knowledge graphs and how we have gone about building one for this particular purpose.</p> <p>// About Simon<br/>Simon Smith is the Head of Analytics at Ripjar Limited, a software company specialising in the detection of financial crime on behalf of banks and other corporations. Simon has a decades' worth of experience in building machine learning/analytic systems, in particular specialising in Natural Language Processing techniques (understanding human language with computers).</p> <p>// Panelist: Adrian Shedden<br/>As Co-founder at Lumio, Adrian’s helping the team build an app that is totally independent, sitting above the financial jungle, and is the simplest entry point into finance for young people to automatically save and invest money at the right time and the right place, every step of the way.</p> <p>// Panellist: Glenn Smith<br/>Founder and CEO at Roqqett</p> ",
    "end_time": 1593720900,
    "link": "https://www.meetup.com/bristech/events/270763024/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1593717300,
    "title": "BRISTECH: BYTESIZE #5 - SIMON SMITH - KNOWLEDGE GRAPHS / PLUS PANELLISTS"
}