{
    "cancelled": false,
    "description": "<p>// Michael Tinning - Data in the World of Wind Energy</p> <p>Since the installation of the first wind farm in 1980, Wind Energy has grown from a wacky idea pursued by hippies and idealists to a global market forecasted to be worth over $130B in 2023, with an installed capacity approaching 60GW (that's 125 million homes). This explosive growth has produced huge volumes of data and along with it some interesting technical challenges. This talk dives into this exciting world and reveals why it takes more than a fancy algorithm to get the most value out of a wind farm.</p> <p>// About Michael<br/>Michael is an experienced application software engineer and has spent his career building simulation and modelling platforms and user interfaces in the renewables and aerospace industries. Although a seasoned software professional, his engineering background allows him to quickly understand complex problems and provide innovative solutions. He is also an experienced consultant having led large teams to deliver high-profile projects to the financial services sector.</p> <p>Michael and Philip founded Simmovation Ltd in 2018 before joining with Staffan to found BitBloom in 2019.</p> <p>// Panel discussion with Laurence Watson and Robin Abraham</p> <p>//About Laurence<br/>Laurence is co-founder and CEO of Treebeard Technologies, a software company making tools for data scientists. He was previously a data scientist at Carbon Tracker, a financial think-tank and Sandbag, an NGO focused on carbon markets. He has a degree in physics from the University of Cambridge and an MSc in Energy Systems from UCL.</p> <p>//About Robin<br/>Robin leads product development for Kaluza’s Residential Flexibility (“Flex”) platform. Since joining OVO in 2017, Robin has been instrumental in transforming Kaluza Flex from its nascent state as a monolithic smart heat product. It is now a modular and scalable flexibility platform that serves the needs of energy suppliers and their end customers, system operators and manufacturers of a range of smart devices.</p> <p>Prior to OVO, Robin worked for eight years in financial trading as a quantitative developer and product manager, primarily at Goldman Sachs. He drove the development of Goldman's FX Algorithmic Execution product from its early days to its establishment as a leader within a highly competitive market. Robin holds a BSc in Applied Mathematics from the California Institute of Technology.</p> ",
    "end_time": 1599163200,
    "link": "https://www.meetup.com/bristech/events/271902369/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1599159600,
    "title": "BRISTECH: BYTESIZE #8 MICHAEL TINNING - DATA IN THE WORLD OF WIND ENERGY + PANEL"
}