{
    "cancelled": false,
    "description": "<p>Bristech + MLOps.community #31: Creating Beautiful Ambient Music with Google Brain’s Music Transformer</p> <p>** Register at <a href=\"https://go.mlops.community/register\" class=\"linkified\">https://go.mlops.community/register</a> **</p> <p>Key takeaways: Training a Music Transformer model in Pachyderm, creating songs with the model and using Human-In-The-Loop creativity to finish the song</p> <p>Abstract: We trained a Transformer neural net on ambient music to see if a machine can compose with the great masters.</p> <p>Ambient is a soft, flowing, ethereal genre of music that I’ve loved for decades. There are all kinds of ambient, from white noise, to tracks that mimic the murmur of soft summer rain in a sprawling forest, but I favor ambient that weaves together environmental sounds and dreamy, wave-like melodies into a single, lush tapestry.</p> <p>Can machine learning ever hope to craft something so seemingly simple yet intricate?</p> <p>The answer is yes and it’s getting better and better with each passing year. It won’t be long before artists are co-composing with AI, using software that helps them weave their own masterpieces of sound.</p> <p>In this article, we'll look at how we did it. Along the way we’ll listen to some more awesome samples that worked really well and some that didn’t work as well as we hoped. You can download the model to play around with yourself. I’ll also show you an end-to-end machine learning pipeline, with downloadable containers that you can string together with ease to train a masterful music-making machine learning model on your own.</p> <p>Bio:</p> <p>Dan Jeffries is Chief Technology Evangelist at Pachyderm. He’s also an author, engineer, futurist, pro blogger and he’s given talks all over the world on AI and cryptographic platforms. He’s spent more than two decades in IT as a consultant and at open source pioneer Red Hat.</p> <p>With more than 50K followers on Medium, his articles have held the number one writer's spot on Medium for Artificial Intelligence, Bitcoin, Cryptocurrency and Economics more than 25 times. His breakout AI tutorial series \"Learning AI If You Suck at Math\" along with his explosive pieces on cryptocurrency, \"Why Everyone Missed the Most Important Invention of the Last 500 Years” and \"Why Everyone Missed the Most Mind-Blowing Feature of Cryptocurrency,” are shared hundreds of times daily all over social media and been read by more than 5 million people worldwide.</p> <p>This will be a fireside chat where we dive into what went right and what went wrong while Dan was setting up this artistic machine!</p> ",
    "end_time": 1597856400,
    "link": "https://www.meetup.com/bristech/events/272643939/",
    "location": {
        "address": "0.0.0.0/0",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45451354980469,
        "longitude": -2.5879099369049072,
        "name": "**ONLINE VIA SUPPLIED LINK**"
    },
    "org": "bristech",
    "start_time": 1597852800,
    "title": "MLOps #32 Creating Beautiful Ambient Music with Google Brain’s Music Transformer"
}