{
    "cancelled": false,
    "description": "<p>**Streamed live from Floating Harbour Studio, Bristol**</p> <p>Bristech: MLOps is a one-day online event focused on the nascent and increasingly important field of MLOps.</p> <p>Please note that this is a ticketed event via <a href=\"https://mlops.bris.tech\" class=\"linkified\">https://mlops.bris.tech</a></p> <p>We will be featuring speakers and workshops to explore the challenges, best practices and tooling options for ML model infrastructure, including deployment into production environments and model observability.</p> <p>What? A virtual conference on MLOps featuring a full day of speakers and workshops<br/>Where? Online, broadcast live from a floating studio in Bristol, UK<br/>When? Thursday 24th September 2020<br/>Who? Featuring Luis Vaquero (GoCo Group), Aparna Dhinakaran (Arize AI), Clive Cox (Seldon), Dan Jeffries (Pachyderm)</p> <p><a href=\"https://mlops.bris.tech\" class=\"linkified\">https://mlops.bris.tech</a></p> <p>“Deploying machine learning systems is hard. The palette of options for tooling to help developing, training and deploying ML has exploded in the last few years. Which ones to use? Which ones will become the de facto standards and continue integrating more features? The reality is that nobody has completely nailed the journey end to end yet. Bristech MLOps will be the perfect event to hear about the latest tooling and have the opportunity to dig deeper through follow-up sessions where speakers will run demos, mini workshops and Q&amp;A sessions in small groups.” - Jose Navarro, ML Infrastructure Engineer, Cookpad, UK</p> <p>Follow @Bristech #BristechMLOps</p> <p><a href=\"https://mlops.bris.tech\" class=\"linkified\">https://mlops.bris.tech</a></p> ",
    "end_time": 1600963200,
    "link": "https://www.meetup.com/bristech/events/273033603/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1600934400,
    "title": "Bristech: MLOps - https://mlops.bris.tech"
}