{
    "cancelled": false,
    "description": "<p>For our 12th installation of the Bristech + data on k8s meetup, we will be talking with Principal Database Engineer Alexander Kukushkin from Zalando SE.</p> <p>// Register here:<br/><a href=\"https://go.dok.community/register\" class=\"linkified\">https://go.dok.community/register</a></p> <p>// Abstract:<br/>PostgreSQL is a powerful, open-source object-relational database system with over 30 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance, but an production-grade deployment requires many complementary technologies to the database core: high availability and automated failover, backup and recovery, monitoring and alerting, centralized access control and logging, connection pooling, and so on.</p> <p>Being not initially accustomed for running stateful workloads, Kubernetes with its infrastructure as a code paradigm, CustomResourceDefinition, and Operator pattern turned out to be extremely convenient for deploying and running PostgreSQL at scale.</p> <p>I will talk about a few open-source project developed and maintained by database team at Zalando which anybody could use to build own PgaaS:</p> <p>1. <a href=\"https://github.com/zalando/patroni\" class=\"linkified\">https://github.com/zalando/patroni</a> - Tool for PostgreSQL high availability and cluster management. Integrates with K8s API and makes PostgreSQL cloud-native.</p> <p>2. <a href=\"https://github.com/zalando/spilo\" class=\"linkified\">https://github.com/zalando/spilo</a> - The Docker image that packages Patroni, multiple versions of PostgreSQL, and tools for backup and recovery.</p> <p>3. <a href=\"https://github.com/zalando/postgres-operator\" class=\"linkified\">https://github.com/zalando/postgres-operator</a> - Implements Kubernetes operator pattern, orchestrates hundreds and thouthands deployments of Patroni/Spilo clusters</p> <p>Aforementioned projects would never get to the current state without an effort of dozens external contributors.</p> <p>// Alexander Kukushkin Bio:<br/>During his professional career, Alexander touched PostgreSQL from all possible sides: as a Web Developer, as System Administrator, and as a Database Engineer now. Five years ago he started working on Patroni project and achieved quite a big success with it. Nowadays Patroni is used in the heart of PostgreSQL-as-a-Service on Kubernetes at Zalando to run 1000+ PostgreSQL HA clusters. Besides that, Alexander periodically reports bugs and contributes patches to PostgreSQL and some other open-source projects (usually Postgres related).</p> <p>@cyberdemn on twitter</p> <p>// Final thoughts<br/>This will be a Fireside chat all audience can participate and ask questions and you can also join the conversation beforehand in our slack group:<br/><a href=\"https://go.dok.community/slack\" class=\"linkified\">https://go.dok.community/slack</a></p> <p>You can also check out some of our old meetups on youtube here:<br/><a href=\"https://www.youtube.com/channel/UCUnXJbHQ89R2uSfKsqQwGvQ\" class=\"embedded\">https://www.youtube.com/channel/UCUnXJbHQ89R2uSfKsqQwGvQ</a></p> ",
    "end_time": 1602003600,
    "link": "https://www.meetup.com/bristech/events/273666827/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1602000000,
    "title": "Doing data on k8s: PostgreSQL-as-a-Service on K8s at Zalando"
}