{
    "cancelled": false,
    "description": "<p># Marta Paes - The Streaming Mindset with Apache Flink</p> <p>An important (but often overlooked) step in the adoption of streaming is getting into the right “state of mind”.</p> <p>What changes, and what trade-offs are you forced to make? How do you get there?</p> <p>In this session, we’ll explore some challenges behind this transition, drawing on personal experience moving from a batch-heavy past to the future of streaming with Apache Flink.</p> <p>## About Marta<br/>Marta is a Developer Advocate at Ververica and a contributor to Apache Flink. Before finding her mojo in open source, she worked as a Data Warehouse Engineer at Zalando and Accenture. Follow her @morsapaes for all things data, bikes and beer.</p> <p># Panel discussion participants<br/>Andrew Carr - Head of Consultancy, Scott Logic<br/>Dan Cook - Data Scientist @ Moneyhub</p> <p>Dan is best described as a data junkie. He’s currently working at the intersection of stats and machine learning to deliver better finance management for individuals. An early creator and adopter of streaming frameworks, Dan brings a unique perspective of the challenges and benefits of technologies such as Apache Kafka, Spark and Flink in both the data engineering and data science domains.</p> <p>Bristech Meetup Sponsors 2021</p> <p>GoCo Group - <a href=\"https://www.gocogroupcareers.com/\" class=\"linkified\">https://www.gocogroupcareers.com/</a></p> <p>GoCo Group is a tech-led business operating multiple leading brands that are focused on innovation and disruption with a common mission to help consumers save time and money, sustainably. Our people help us achieve this through a culture that embraces individuality, innovation and creativity.</p> <p>Oracle Cloud Infrastructure - <a href=\"https://www.oracle.com/uk/cloud/\" class=\"linkified\">https://www.oracle.com/uk/cloud/</a></p> <p>Oracle Cloud Infrastructure (OCI) is an IaaS that delivers high-performance computing power to run cloud-native and enterprise company's IT workloads. OCI provides real-time elasticity for enterprise applications by combining Oracle's autonomous services, integrated security, and serverless computing. OCI has 30 regions worldwide and is also the only IaaS available in a company's private data centre.</p> <p>The OCI team in the UK build and run many core OCI services including API Gateway, Compute, Functions (FaaS), Container Engine for Kubernetes (OKE) Engine, Networking &amp; Storage.</p> <p>OVO Energy - <a href=\"https://www.ovoenergy.com/\" class=\"linkified\">https://www.ovoenergy.com/</a></p> <p>Storm Consultancy - <a href=\"https://stormconsultancy.co.uk/\" class=\"linkified\">https://stormconsultancy.co.uk/</a></p> <p>Storm works with startups, scale ups and corporate innovators to design and build world-class web apps, digital platforms and websites.<br/>Storm is here to see your digital business idea or project through from initial brainstorm to launch (and beyond!).</p> <p>We're your technology partner, your sounding board and your business confidant. We're fully invested. We build partnerships and enjoy nothing more than celebrating your success.</p> ",
    "end_time": 1611867600,
    "link": "https://www.meetup.com/bristech/events/274666384/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1611864000,
    "title": "**RESCHEDULED** BRISTECH BYTESIZE #11: MARTA PAES - STREAMING MINDSET & FLINK"
}