{
    "cancelled": false,
    "description": "<p># Kieran Billingham - Multi-cloud Machine Learning: why you don’t need a centralised data stack to extract value from your data.</p> <p>At GoCo, data is a group function. Historically, this allowed us to service multiple brands with a smaller team and a centralised data stack. However, as the organisation has grown through acquisitions keeping to one centralised stack has become much more difficult, forcing the data team to work across businesses and across multiple stacks.</p> <p>In this talk, we discuss how GoCompare.com's growth into a group has affected the way in which the data science team services the business, the journey from single cloud to multi-cloud machine learning production and the skills gap that needed bridging to achieve that.</p> <p>To describe the transition, the recent deployment of a B2B API service using Microsoft Azure and Amazon Web Services will be used as an example, but we will not delve into the nitty gritty of the architecture.</p> <p>## About Kieran<br/>Kieran is junior data scientist at the GoCo group, he has an MSc in data science and now works to build machine learning products for B2B partners using group data. Kieran is well versed in Azure services and is currently up-skilling across other cloud providers in order to deliver cross-cloud products. Previously, Kieran studied physics and provided business analytics for a FTSE 100 insurer and now works as an ambassador for STEM education.</p> <p># Panel discussion participants to follow</p> <p># Introducing our sponsors!</p> <p>GoCo Group - <a href=\"https://www.gocogroupcareers.com/\" class=\"linkified\">https://www.gocogroupcareers.com/</a></p> <p>GoCo Group is a tech-led business operating multiple leading brands that are focused on innovation and disruption with a common mission to help consumers save time and money, sustainably. Our people help us achieve this through a culture that embraces individuality, innovation and creativity.</p> <p>Storm Consultancy - <a href=\"https://stormconsultancy.co.uk/\" class=\"linkified\">https://stormconsultancy.co.uk/</a></p> <p>Storm works with startups, scale ups and corporate innovators to design and build world-class web apps, digital platforms and websites.<br/>Storm is here to see your digital business idea or project through from initial brainstorm to launch (and beyond!).</p> <p>We're your technology partner, your sounding board and your business confidant. We're fully invested. We build partnerships and enjoy nothing more than celebrating your success.</p> ",
    "end_time": 1611262800,
    "link": "https://www.meetup.com/bristech/events/275119562/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1611259200,
    "title": "BRISTECH BYTESIZE #12: KIERAN BILLINGHAM - MULTI-CLOUD MACHINE LEARNING + PANEL"
}