{
    "cancelled": false,
    "description": "<p># James Hughes - Jump-start your Egoless Tech Culture</p> <p>What’s the no 1 reason given when tech projects fail? Surprisingly it’s not due to the difficult technical challenges, failure of the tools and processes or lack energy and time put in - but the communication, leadership and culture behind it. Cultures where big egos dominate above all else.</p> <p>Egos create a toxic workplace environment where everyone is LHF (lying, hiding or faking) to make it through another day. You may recognise the symptoms, from a fear of raising or sharing uncomfortable truths, a pervasive “not my problem” mindset, low retention and high burnout. As leaders in the tech industry - how can we remove egos, prevent LHF, and create healthy “egoless” cultures?</p> <p>From recruitment to project management, from CEO level direction to daily scrums - this talk will give attendees the tools to jump-start and sustain their own egoless tech culture in their own team, project or business.</p> <p>## About James<br/>James Hughes will be sharing his own experiences and learnings creating this culture as Head of UK Engineering at Next Jump.</p> <p>Next Jump is a global e-commerce platform where “people” are the number 1 business strategy, and was recognised by Harvard Business Review as the future of workplace culture (in the 2016 book “An Everyone Culture”).</p> <p>Since they then have worked closely with senior leaders from military, government, education and finance industries to help change the world’ workplace culture.</p> <p># Panel discussion with...<br/>* Martin Hogg - Senior Development Director @ Oracle Cloud Infrastructure (OCI)</p> <p>Martin leads the OCI API Gateway &amp; Functions (FaaS) services &amp; is based in Bristol, UK. His team spans the UK, Czech Republic &amp; India. <a href=\"https://www.linkedin.com/in/martinahogg/\" class=\"linkified\">https://www.linkedin.com/in/martinahogg/</a></p> <p>* Kate Wardin<br/>Senior Engineering Manager, Target &amp; Founder, Developer First Leadership<br/><a href=\"https://www.linkedin.com/in/kate-wardin/\" class=\"linkified\">https://www.linkedin.com/in/kate-wardin/</a></p> <p>* James O'Halloran, Executive Coach,<br/><a href=\"https://www.linkedin.com/in/jamesohalloran/\" class=\"linkified\">https://www.linkedin.com/in/jamesohalloran/</a></p> <p>Bristech Meetup Sponsors 2021</p> <p>GoCo Group - <a href=\"https://www.gocogroupcareers.com/\" class=\"linkified\">https://www.gocogroupcareers.com/</a></p> <p>GoCo Group is a tech-led business operating multiple leading brands that are focused on innovation and disruption with a common mission to help consumers save time and money, sustainably. Our people help us achieve this through a culture that embraces individuality, innovation and creativity.</p> <p>Oracle Cloud Infrastructure - <a href=\"https://www.oracle.com/uk/cloud/\" class=\"linkified\">https://www.oracle.com/uk/cloud/</a></p> <p>Oracle Cloud Infrastructure (OCI) is an IaaS that delivers high-performance computing power to run cloud-native and enterprise company's IT workloads. OCI provides real-time elasticity for enterprise applications by combining Oracle's autonomous services, integrated security, and serverless computing. OCI has 30 regions worldwide and is also the only IaaS available in a company's private data centre.</p> <p>The OCI team in the UK build and run many core OCI services including API Gateway, Compute, Functions (FaaS), Container Engine for Kubernetes (OKE) Engine, Networking &amp; Storage.</p> <p>OVO Energy - <a href=\"https://www.ovoenergy.com/\" class=\"linkified\">https://www.ovoenergy.com/</a></p> <p>Storm Consultancy - <a href=\"https://stormconsultancy.co.uk/\" class=\"linkified\">https://stormconsultancy.co.uk/</a></p> <p>Storm works with startups, scale ups and corporate innovators to design and build world-class web apps, digital platforms and websites.<br/>Storm is here to see your digital business idea or project through from initial brainstorm to launch (and beyond!).</p> <p>We're your technology partner, your sounding board and your business confidant. We're fully invested. We build partnerships and enjoy nothing more than celebrating your success.</p> ",
    "end_time": 1612472400,
    "link": "https://www.meetup.com/bristech/events/275328010/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1612468800,
    "title": "BRISTECH BYTESIZE #13: JAMES HUGHES - EGOLESS TECH CULTURE + Q&A + PANEL"
}