{
    "cancelled": false,
    "description": "<p>Bristech &amp; MLOps collab #50! This coming Wednesday, we will be talking to David Aronchick, Michael Del Balso, and Willem Pienaar, about Two Tools To Get You From 0 to 90% Operational ML.</p> <p>// Register at:<br/><a href=\"https://go.mlops.community/register\" class=\"linkified\">https://go.mlops.community/register</a></p> <p>// Abstract:<br/>The MLOps tooling landscape is confusing. There’s a complicated patchwork of products and open-source software that each cover some subset of the infrastructure requirements to get ML to production. In this session - we’ll focus on the two most important platforms: model management platforms and feature stores. Model management platforms such as Kubeflow help you get models to production quickly and reliably. Feature stores help you easily build, use, and deploy features. Together, they cover requirements to get models and data to production - the two most important components of any ML project.</p> <p>In this panel discussion, we’ll be joined by David Aronchick (Co-Founder of Kubeflow), Mike Del Balso (Co-Founder of Tecton) and Willem Pienaar (Creator of Feast). These experts will share their perspective on the challenges of Operational ML and how to build the ideal infrastructure stack for MLOps. They’ll talk about the importance of managing models and data with the same engineering efficiency and best practices that we’ve been applying to application code. They’ll discuss the role of Kubeflow, Feast and Tecton, and share their views on the future of MLOps tooling</p> <p>// Bio:<br/>David Aronchick<br/>Program Manager, Azure Innovations</p> <p>David leads works in the Azure Innovation Office on Machine Learning. This means he spends most of my time helping humans to convince machines to be smarter. He is only moderately successful at this.</p> <p>Previously, he led product management for Kubernetes on behalf of Google, launched Google Kubernetes Engine, and co-founded the Kubeflow project. He has also worked at Microsoft, Amazon and Chef and co-founded three startups.</p> <p>When not spending too much time in service of electrons, he can be found on a mountain (on skis), travelling the world (via restaurants) or participating in kid activities, of which there are a lot more than he remembers than when he was that age.</p> <p>Michael Del Balso<br/>CEO &amp; Co-founder, Tecton</p> <p>Mike is the co-founder of Tecton, where he is focused on building next-generation data infrastructure for Operational ML. Before Tecton, Mike was the PM lead for the Uber Michelangelo ML platform. He was also a product manager at Google where he managed the core ML systems that power Google’s Search Ads business. Previous to that, he worked on Google Maps. He holds a BSc in Electrical and Computer Engineering summa cum laude from the University of Toronto.</p> <p>Willem Pienaar<br/>Co-creator, Feast</p> <p>Willem is currently a tech lead at Tecton where he leads the development of Feast, an open-source feature store for machine learning. Previously he led the ML platform team at Gojek, the Southeast Asian decacorn, which supports a wide variety of models and handles over 100 million orders every month. His main focus areas are building data and ML platforms, allowing organizations to scale machine learning and drive decision making. In a previous life, Willem founded and sold a networking startup.</p> <p>// Final thoughts<br/>Please feel free to drop some questions you may have beforehand into our slack channel (<a href=\"https://go.mlops.community/slack\" class=\"linkified\">https://go.mlops.community/slack</a>)<br/>Watch some old meetups on our youtube channel:<br/><a href=\"https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ\" class=\"embedded\">https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ</a></p> ",
    "end_time": 1612375200,
    "link": "https://www.meetup.com/bristech/events/276023569/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1612371600,
    "title": "Two Tools To Get You From 0 to 90% Operational ML"
}