{
    "cancelled": false,
    "description": "<p># Mark Smith - Convention over configuration: How we use Ruby on Rails to efficiently build award winning apps for our clients</p> <p>Since its introduction to the world in 2004, Ruby on Rails has helped many people’s ideas come to life.</p> <p>In this talk, Mark will be exploring the history of both the Ruby programming language and the Ruby on Rails web development framework.</p> <p>He will also show how they help developers build bespoke products and how the tech team at Storm make the most of technical conventions to collaborate efficiently on projects from a wide variety of clients.</p> <p>In true Bristech style, Storm are sending popcorn to attendees of the event to enjoy whilst you tune in.</p> <p>Please input your details into the form below by Monday March 1st to receive popcorn in the post (!) for munching at the event: <a href=\"https://docs.google.com/forms/d/1MLIpyaACxTzowq-juWOoDhth9zUsW5pEseJHMgai-pQ/edit\" class=\"linkified\">https://docs.google.com/forms/d/1MLIpyaACxTzowq-juWOoDhth9zUsW5pEseJHMgai-pQ/edit</a></p> <p>## About Mark<br/>Mark Smith joined the Storm team 4 years ago as a senior developer. He has 8 years of experience building apps with Ruby and Rails in both agency and product teams.</p> <p>## About Storm Consultancy<br/>Storm Consultancy was born 11 years ago from David Kelly and Adam Pope’s successful gap year. Creating digital technology for clients near and far, across many industries, Storm has built up quite the reputation.</p> <p># Q+A with questions from the audience...</p> <p># Panel discussion with...</p> <p>* Adam Butler<br/>Adam Butler is the founder of TechTalks and a contract Ruby &amp; JavaScript developer from Bristol. He has been building products with Ruby on Rails for 8 years. He likes hardware hacking, photography, making stuff and building communities.</p> <p>Bristech Meetup Sponsors 2021</p> <p>GoCo Group - <a href=\"https://www.gocogroupcareers.com/\" class=\"linkified\">https://www.gocogroupcareers.com/</a></p> <p>GoCo Group is a tech-led business operating multiple leading brands that are focused on innovation and disruption with a common mission to help consumers save time and money, sustainably. Our people help us achieve this through a culture that embraces individuality, innovation and creativity.</p> <p>Oracle Cloud Infrastructure - <a href=\"https://www.oracle.com/uk/cloud/\" class=\"linkified\">https://www.oracle.com/uk/cloud/</a></p> <p>Oracle Cloud Infrastructure (OCI) is an IaaS that delivers high-performance computing power to run cloud-native and enterprise company's IT workloads. OCI provides real-time elasticity for enterprise applications by combining Oracle's autonomous services, integrated security, and serverless computing. OCI has 30 regions worldwide and is also the only IaaS available in a company's private data centre.</p> <p>The OCI team in the UK build and run many core OCI services including API Gateway, Compute, Functions (FaaS), Container Engine for Kubernetes (OKE) Engine, Networking &amp; Storage.</p> <p>OVO Energy - <a href=\"https://www.ovoenergy.com/\" class=\"linkified\">https://www.ovoenergy.com/</a></p> <p>Storm Consultancy - <a href=\"https://stormconsultancy.co.uk/\" class=\"linkified\">https://stormconsultancy.co.uk/</a></p> <p>Storm works with startups, scale ups and corporate innovators to design and build world-class web apps, digital platforms and websites.<br/>Storm is here to see your digital business idea or project through from initial brainstorm to launch (and beyond!).</p> <p>We're your technology partner, your sounding board and your business confidant. We're fully invested. We build partnerships and enjoy nothing more than celebrating your success.</p> ",
    "end_time": 1614893400,
    "link": "https://www.meetup.com/bristech/events/276293176/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1614888000,
    "title": "**FREE POPCORN** MARK SMITH - CONVENTION OVER CONFIGURATION + Q&A + PANEL"
}