{
    "cancelled": false,
    "description": "<p>Bristech &amp; MLOps collab #58! On March 31, we will be talking to Ben Wilson, Practice Lead Resident Solutions Architect of Databricks, about Model Watching: Keeping Your Project in Production.</p> <p>// Register at:<br/><a href=\"https://go.mlops.community/register\" class=\"linkified\">https://go.mlops.community/register</a></p> <p>// Abstract:<br/>Understanding why attribution and performance monitoring is critical for long-term project success.</p> <p>Borrowing hypothesis testing, stratification for latent confounding variable minimization, and statistical significance estimation from other fields can help to explain the value of your project to a business.</p> <p>Unlike in street racing, drifting is not cool in ML, but it will happen. Being prepared to know when to intervene will help to keep your project running.</p> <p>// Bio:<br/>Ben Wilson has worked as a professional data scientist for more than ten years. He currently works as a resident solutions architect at Databricks, where he focuses on machine learning production architecture with companies ranging from 5-person startups to global Fortune 100. Ben is the creator and lead developer of the Databricks Labs AutoML project, a Scala-and Python-based toolkit that simplifies machine learning feature engineering, model tuning, and pipeline-enabled modeling. He's the author of Machine Learning Engineering in Action, a primer on building, maintaining, and extending production ML projects.</p> <p>//Other Links<br/><a href=\"https://www.youtube.com/watch?v=y2ouYNtWsjc\" class=\"embedded\">https://www.youtube.com/watch?v=y2ouYNtWsjc</a><br/><a href=\"https://www.youtube.com/watch?v=XIFZetgx96g\" class=\"embedded\">https://www.youtube.com/watch?v=XIFZetgx96g</a></p> <p>// Final thoughts<br/>Please feel free to drop some questions you may have beforehand into our slack channel (<a href=\"https://go.mlops.community/slack\" class=\"linkified\">https://go.mlops.community/slack</a>)<br/>Watch some old meetups on our youtube channel:<br/><a href=\"https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ\" class=\"embedded\">https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ</a></p> ",
    "end_time": 1617210000,
    "link": "https://www.meetup.com/bristech/events/276559908/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1617206400,
    "title": "Model Watching: Keeping Your Project in Production"
}