{
    "cancelled": false,
    "description": "<p>Bristech &amp; MLOps collab #68! On June 16, we will be talking to Veselina (\"Vesi\") Staneva, Co-founder &amp; Head of Product of TeachableHub, Korri Jones, Sr. Lead Machine Learning Engineer of Chick-fil-A, and Simarpal Khaira, Senior Product Manager of Intuit about Project/Product Management for MLOps.</p> <p>// Register at:<br/><a href=\"https://go.mlops.community/register\" class=\"linkified\">https://go.mlops.community/register</a></p> <p>// Abstract:<br/>Building, Designing, or even just casting the vision for MLOps for your company, whether a large corporation or an agile start-up up, shouldn't be a nigh-impossible task. Complex, but not an impossible mountain to climb, and today, I hope that we can talk about the steps necessary to unlock the potential of data science for your organization, regardless of size.</p> <p>// Bio:<br/>Veselina (\"Vesi\") Staneva<br/>Over the past few years, Vesi work at a product company called CloudStrap.io, where together with her team they are simplifying cloud technologies and crafting modern solutions that lay a solid foundation for digital transformation at scale. Vesi's main focus currently is their new product TeachableHub.com - an ML deployment and serving platform for teams, where she heads Product and Customer Development.</p> <p>In the past, Vesi had quite a diverse experience in managing projects for global enterprise companies such as telecommunications and internet service provider GTT and managed printing services giant HPInc, as well as deep-diving into e-commerce business development while running online stores on 7 Amazon markets as well as WordPress shops, where she managed to get from 0 to $30K MRR in less than a year without a dollar spent on paid advertising. In Vesi's free time, she enjoys spending the rest of her energy doing all kinds of sports, as well as participate in non-professional triathlons and mountain bike ultra races.</p> <p>Korri Jones<br/>Korri Jones is a Sr Lead Machine Learning Engineer and Innovation Coach at Chick-fil-A, Inc. in Atlanta, Georgia where he is focused on MLOps. Prior to his work at Chick-fil-A, he worked as a Business Analyst and product trainer for NavMD, Inc., was an adjunct professor at Roane State Community College, and instructor for the Project GRAD summer program at Pellissippi State Community College and the University of Tennessee, Knoxville.</p> <p>Korri's accolades are just as diverse, and he was in the inaugural 40 under 40 for the University of Tennessee in 2021, Volunteer of the year with the Urban League of Greater Atlanta with over 1000 hours in a single calendar year and has received the “Looking to the Future” award within his department at Chick-fil-A among many others, including best speaker awards in business case competitions. However, the best award he has received so far is being a loving husband to his wife Lydia.</p> <p>Simarpal Khaira<br/>Simarpal is the product manager driving product strategy for Feature Management and Machine Learning tools at Intuit. Prior to Intuit, he was at Ayasdi, a machine learning startup, leading product efforts for machine learning solutions in the financial services space. Before that, he worked at Adobe as a product manager for Audience Manager, a data management platform for digital marketing.</p> <p>// Final thoughts<br/>Please feel free to drop some questions you may have beforehand into our slack channel (<a href=\"https://go.mlops.community/slack\" class=\"linkified\">https://go.mlops.community/slack</a>)<br/>Watch some old meetups on our youtube channel:<br/><a href=\"https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ\" class=\"embedded\">https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ</a></p> ",
    "end_time": 1623862800,
    "link": "https://www.meetup.com/bristech/events/278425066/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1623859200,
    "title": "Project/Product Management for MLOps"
}