{
    "cancelled": false,
    "description": "<p># Antoni Baum - ML made simple with PyCaret</p> <p>The ever-increasing demand for data-centric solutions from businesses and academia is outpacing the number of data scientists, leading many organizations to embrace citizen data science as a way to supplement the experts.</p> <p>In this talk we will present PyCaret – an open source, low-code machine learning library in Python that simplifies and automates ML workflows.</p> <p>We will cover the ideas and concepts behind PyCaret, showcase its features and show how it can empower newcomers and citizen data scientists by providing an easy to use, end-to-end ML environment, while also being an attractive productivity booster for professionals.</p> <p>The talk with end with a live demo of PyCaret’s supervised module on an example data set.</p> <p>## About Antoni<br/>Antoni is a Software Engineering Intern @ Anyscale. He is passionate about open source, machine learning engineering and making ML more accessible to everyone.</p> <p>He is a maintainer of PyCaret and contributor to Ray.</p> <p><a href=\"https://www.linkedin.com/in/yard1/\" class=\"linkified\">https://www.linkedin.com/in/yard1/</a></p> <p># Panel discussion with...</p> <p>Taha Alfaqheri - Machine Learning Engineer, 4EarthIntelligence</p> <p>Taha is a Machine Learning engineer at 4 EarthIntelligence (4EI). He studied at the University of Technology in Baghdad, Iraq where he obtained a B.Sc. degree with Distinction in Electrical and Electronic Engineering in 2007 and a Master degree with Distinction in Communication Engineering in 2009. From 2009 to 2014 he worked in Higher education and electronic projects in Iraq. He received his PhD degree in Electronic and Computer Engineering from BrunelUniversity, London, in 2020. He worked at Brunel University for three years as a researcher in Digital Signal Processing and Big Data Analytics. His research interest is Remote Sensing, 2D/3D Signal Processing, Artificial intelligence, BigData Analytics, and Visual Data Compression and Transmission.</p> <p>Bristech Meetup Sponsors 2021</p> <p>Oracle Cloud Infrastructure - <a href=\"https://www.oracle.com/uk/cloud/\" class=\"linkified\">https://www.oracle.com/uk/cloud/</a></p> <p>Oracle Cloud Infrastructure (OCI) is an IaaS that delivers high-performance computing power to run cloud-native and enterprise company's IT workloads. OCI provides real-time elasticity for enterprise applications by combining Oracle's autonomous services, integrated security, and serverless computing. OCI has 30 regions worldwide and is also the only IaaS available in a company's private data centre.</p> <p>The OCI team in the UK build and run many core OCI services including API Gateway, Compute, Functions (FaaS), Container Engine for Kubernetes (OKE) Engine, Networking &amp; Storage.</p> <p>OVO Energy - <a href=\"https://www.ovoenergy.com/\" class=\"linkified\">https://www.ovoenergy.com/</a></p> <p>Storm Consultancy - <a href=\"https://stormconsultancy.co.uk/\" class=\"linkified\">https://stormconsultancy.co.uk/</a></p> <p>Storm works with startups, scale ups and corporate innovators to design and build world-class web apps, digital platforms and websites.<br/>Storm is here to see your digital business idea or project through from initial brainstorm to launch (and beyond!).</p> <p>We're your technology partner, your sounding board and your business confidant. We're fully invested. We build partnerships and enjoy nothing more than celebrating your success.</p> ",
    "end_time": 1625171400,
    "link": "https://www.meetup.com/bristech/events/278747232/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1625166000,
    "title": "BRISTECH BYTESIZE #15: ANTONI BAUM - ML made simple with PyCaret + Q&A + PANEL"
}