{
    "cancelled": false,
    "description": "<p>Bristech &amp; MLOps collab #72! On July 21, we will be talking to Aniruddha Choudhury, Senior Data Scientist of Publicis Sapient, about Building ML Blocks with Kubeflow Orchestration with Feature Store.</p> <p>// Register at:<br/><a href=\"https://go.mlops.community/register\" class=\"linkified\">https://go.mlops.community/register</a></p> <p>// Abstract:<br/>In this talk, Aniruddha is presenting the Kubeflow with feature store end-to-end training and serving the model, build the Lego blocks for online and offline data ingestion with spark and Kafka alongside Redis, monitor the metrics in Grafana and Prometheus, and the whole architecture building in GCP.</p> <p>// Bio:<br/>Aniruddha is a Senior data scientist with experience over 5 years across various industry experiences for AI/ML journey. He is experienced in building the MLOps domain across various multi-cloud solutions for various AI synergies.</p> <p>Aniruddha is a passionate AI researcher to transform the data into a machine learning end-to-end production journey to ease the life of Business users.</p> <p>// Takeaways<br/>How to set up Kubeflow in GCP and building Kubeflow pipeline. Alongside how to use feast feature store and for training and serving.</p> <p>// Final thoughts<br/>Please feel free to drop some questions you may have beforehand into our slack channel (<a href=\"https://go.mlops.community/slack\" class=\"linkified\">https://go.mlops.community/slack</a>)<br/>Watch some old meetups on our youtube channel:<br/><a href=\"https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ\" class=\"embedded\">https://www.youtube.com/channel/UCG6qpjVnBTTT8wLGBygANOQ</a></p> ",
    "end_time": 1626886800,
    "link": "https://www.meetup.com/bristech/events/279168625/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "bristech",
    "start_time": 1626883200,
    "title": "Building ML Blocks with Kubeflow Orchestration with Feature Store"
}