{
    "description": "<p>A little early this month (first Wednesday), before he heads back across the pond, <a href=\"https://twitter.com/philsturgeon\">Phil Sturgeon</a> will be giving us a run through of the API talk he's been touring recently, as seen at <a href=\"http://lanyrd.com/2014/phpjoburg14\">PHP South Africa</a>!</p> <p>- <b>API Pain-Points</b><br/>   <a href=\"https://twitter.com/philsturgeon\">Phil Sturgeon</a>, Englishman temporarily not in New York. PHP Town Crier. Charity Biker. Cider Drinker. Troll Slayer.</p> <p>I've been building APIs for a long time now and it is becoming ever more common for server-side developer thanks to the rise of front-end JavaScript frameworks, iPhone applications and generally API-centric architectures.</p> <p>On one hand you're just grabbing stuff from a data source and shoving it out as JSON, but creating useful conventions from the start, surviving changes in business logic, handling database schema updates, and managing the shifting landscape of features creation and deprecated can be insanely tough.</p> <p>This talk will outline some good the common pitfalls developers get trapped in when building APIs and give you some tools to make decisions about what you will do yourselves.</p> <p>- <b>Generating API documentation</b><br/>   <a href=\"http://www.meetup.com/php-sw/members/31030432\">Ade Slade</a>, PHP Developer at <a href=\"http://www.basekit.com/\">BaseKit</a></p> <p>Generate interactive API documentation from a Guzzle service description. Shameless promotion of an open source project.</p> <p><a href=\"http://service-docs.adeslade.co.uk/\"><a href=\"http://service-docs.adeslade.co.uk\" class=\"linkified\">http://service-docs.adeslade.co.uk</a></a></p> <p>--</p> <p>If you're interested in speaking at PHPSW (especially this month!), do <a href=\"https://twitter.com/phpsw\">get in touch with us on Twitter</a> or swing an email my way at <a href=\"mailto:[masked]\">[masked]</a>. We're looking for anyone wanting to do presentations or even just lightening talks, particularly on the topics of testing &amp; continuous integration (or anything really).</p> <p>--</p> <p>BaseKit have kindly sponsored the event again, providing their office as the venue, as well as beer and pizza! Don't forget to check them out- and if you're looking, they are hiring.</p> <p>Afterwards we'll probably go to the pub, The Apple if it's sunny!</p> ",
    "end_time": 1404334800,
    "link": "https://www.meetup.com/php-sw/events/190401062/",
    "location": {
        "address": "4th Floor, The Pithay, BS1 2ND ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45576858520508,
        "longitude": -2.592099905014038,
        "name": "BaseKit Office (Bristol)"
    },
    "org": "phpsw",
    "start_time": 1404324000,
    "title": "Building great APIs"
}