{
    "cancelled": false,
    "description": "<p>As we return to our normal slot of the second Wednesday of the month, in September we're hosting a night of talks on design patterns!</p> <p>- <b>Dependency injection the right way</b><br/>   <a href=\"http://www.meetup.com/php-sw/members/39370012\">Dan Ackroyd</a>, Independent C + PHP developer, Imagick maintainer. That guy with the beard</p> <p>How DI makes code easier to write, be more testable, more flexible and generally more awesome.</p> <p>- <b>CQRS &amp; Event Sourcing - The coolest design patterns you probably shouldn't be using</b><br/>   <a href=\"https://twitter.com/BillieAThompson\">Billie Thompson</a>, Contracting Software Developer, currently working with <a href=\"http://www.transformuk.com\">Transform UK</a> at the <a href=\"https://www.gov.uk/government/organisations/home-office\">Home Office</a></p> <p>This talk will take you through the Event Sourcing design pattern, then go through how you'd implement it. From there we'll move on to CQRS, starting with what it is, then moving onto why it works well with event sourcing and how you'd implement it. Finally we'll wrap up with why it's probably not appropriate for most projects, and give some examples where it is appropriate.</p> <p>- <b>Creating models<br/></b>    <a href=\"http://www.meetup.com/php-sw/members/56661222\">Rob Allen</a>, Software Engineer, ZF contributor and author of <a href=\"http://www.manning.com/allen\">Zend Framework in Action</a></p> <p>How are you supposed to organise your models in an MVC application? What goes where? What is a service class, a mapper or an entity? This talk will look at the components of the model layer and the options you have when creating your models. We’ll look at the different schools of thought in this area and compare and contrast their strengths and weaknesses with an eye to flexibility and testability. We'll discuss the terminology and also take a look at what a service layer is and see how you use service classes to provide the business logic for your application and hide your persistence code from your controllers. By the end of this session you will be equipped to create excellent, maintainable models in your projects.</p> <p>--</p> <p><a href=\"http://www.basekit.com\">BaseKit</a> have kindly offered to host the evening at their office, and as always there'll be beer and pizza. Don't forget to check them out- and if you're looking, they are hiring.</p> <p>Afterwards we'll head to the pub, <a href=\"http://applecider.co.uk\">The Apple</a> if it's sunny, <a href=\"http://www.hortsbristol.com\">Horts</a> if it's not!</p> <p>Also, do check out our <a href=\"http://phpsw.org.uk\">new website</a>, as well as <a href=\"http://phpsw.org.uk/sponsors\">our new sponsors</a>; <a href=\"http://www.ents24.com\">Ents24</a>, <a href=\"http://tech.just-eat.com\">Just Eat</a> and <a href=\"http://www.redrockconsulting.co.uk\">Redrock</a> without whom our events would not be possible.</p> ",
    "end_time": 1410382800,
    "link": "https://www.meetup.com/php-sw/events/201441732/",
    "location": {
        "address": "4th Floor, The Pithay, BS1 2ND ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45576858520508,
        "longitude": -2.592099905014038,
        "name": "BaseKit Office (Bristol)"
    },
    "org": "phpsw",
    "start_time": 1410372000,
    "title": "Design patterns"
}