{
    "cancelled": false,
    "description": "<p>In October we're hosting an evening of 5-10 minute lightning talks!</p> <p>We're still looking for submissions, and by speaking you earn yourself a chance to win 1 of 3 tickets to this year's fantastic <a href=\"http://allyourbaseconf.com/2015\">All Your Base conference</a> in London on the November 13th!</p> <p>Send your proposals through via the website, to <a href=\"mailto:[masked]\">[masked]</a>, or <a href=\"https://twitter.com/phpsw\">grab us on Twitter</a>, remember it can be as short as 5 minutes and we're open to talks on any topic be that fringe technologies, PHP or hacking your productivity.</p> <p>So far on the line up we have:</p> <p>- <b>Mirror, mirror on the wall</b><br/>  <a href=\"http://www.meetup.com/php-sw/members/99787762\">James Titcumb</a>, founder of <a href=\"http://phphants.co.uk\">PHP Hampshire</a>, Zend Certified Engineer and consultant developer for <a href=\"https://roave.com\">Roave</a></p> <p>Have you ever used PHP's built in reflection, only to find you can't do quite what you wanted? What about finding types for parameters or properties? What about reflecting on classes that aren't loaded, so that you can modify them directly? Better Reflection is an awesome new library that uses magical time-warp techniques* (*actual magic or time-warp not guaranteed) to improve on PHP's built-in reflection by providing additional functionality. In this talk we'll briefly explore the cool features of Better Reflection, and how you can use Better Reflection in your projects to maximise your reflection-fu.</p> <p>- <b>Building Static Sites with Sculpin</b><br/>  <a href=\"http://www.meetup.com/php-sw/members/137208052\">Oliver Davies</a>, Senior Developer at <a href=\"https://microserve.io/\">Microserve</a></p> <p>Sculpin is a static site generator written in PHP. It converts Markdown files, Twig templates and standard HTML into a static HTML site that can be easily deployed.<br/>This talk will cover a little of the background to Sculpin and what it is, and then will move into some demonstrations of how to build a Sculpin site and what it can do!</p> <p>- <b>Nobody likes you Jenkins</b><br/>  <a href=\"http://www.meetup.com/php-sw/members/17672291\">Andy Gale</a>, Devops Consultant at <a href=\"http://hellofutu.re/\">Hello Future</a></p> <p>Take the hassle out of CI by using online CI instead. Rid yourself of that high-maintenance chancer butler.</p> <p>- <b>PHP &amp; Beanstalk </b><br/> <a href=\"http://www.meetup.com/php-sw/members/47315872\">Doug Fitzmaurice</a>, Developer at <a href=\"http://www.ents24.com/\">Ents24</a> </p> <p>Beanstalk is a job queue, and you can use it to break apart PHP applications to handle long-running tasks and cope with scale.Learn how to use PHP for things it was never designed, without it all going wrong!</p> <p>- <b>Version Control Tips &amp; Tricks</b><br/> <a href=\"http://www.meetup.com/php-sw/members/184625634/\">Tess Barnes</a></p> <p>Nervous of version control? Don’t panic! you’re not on your own. I've put together a run down of some of my tricks and ‘good citizen’ techniques to avoid the worst kinds of conflicts and deal with the remaining ones as efficiently as possible. Branching policies, basic conflict resolution, proactive diffs can all ease the pain of a tricky integration.</p> <p>- <b>Code Review with Gerrit</b><br/> <a href=\"http://www.meetup.com/php-sw/members/104883962\">Dave Liddament</a>, Director and developer at <a href=\"http://www.lampbristol.com/\">Lamp Bristol</a>. </p> <p>Quick intro to integrating code review using Gerrit into your workflow.</p> <p>--</p> <p><a href=\"http://www.mixrad.io/\">MixRadio</a> have kindly offered to host the evening at their office, and provide drinks and pizza. Don't forget to check them out- and if you're looking, <a href=\"http://dev.mixrad.io/jobs\">they are hiring</a>.</p> <p>Afterwards we'll head to <a href=\"http://www.smallbarbristol.com\">Small Bar</a>!</p> <p>--</p> <p><a href=\"http://phpsw.uk/events/225148132-lightning-talks\">View on the PHPSW website</a></p> ",
    "end_time": 1444854600,
    "link": "https://www.meetup.com/php-sw/events/225148132/",
    "location": {
        "address": "Prudential Buildings, 11-19 Wine St., Bristol, BS1 2PH, Bristol",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45545196533203,
        "longitude": -2.592360019683838,
        "name": "MixRadio"
    },
    "org": "phpsw",
    "start_time": 1444843800,
    "title": "Lightning talks"
}