{
    "cancelled": false,
    "description": "<p>In March we're doing something a little different and taking a look at using projects which are built on PHP.</p> <p>- <b>Drupal For PHP Developers</b><br/>  <a href=\"https://twitter.com/rrbambrey\">Ross Bambrey</a>, Director and developer at <a href=\"http://www.lampbristol.com/\">Lamp Bristol</a> and <a href=\"https://twitter.com/ismithuk\">Ian Smith</a>, Director and developer at <a href=\"http://www.lampbristol.com/\">Lamp Bristol</a>.</p> <p>You're a  PHP developer and one day a Drupal project lands on your desk. This talk will show you how to start off on the right foot. From planning and setup, to building and maintaining a solid Drupal project. Ian and Ross have been building Drupal websites for over 6 years and look forward to sharing their trials and tribulations.</p> <p>- <b>Drupal 8, from prototype to product, no previous experience required</b><br/>  <a href=\"https://twitter.com/cwork_chris\">Chris Hall</a>, freelance and contract web and data developer, <a href=\"http://chris-david-hall.info/\">specialising in Drupal and PHP</a>.</p> <p>Now Drupal 8 has finally arrived with a new architecture and many common components and approaches \"proudly found elsewhere\" the legendary epic Drupal learning curve can be circumvented. Rapid and iterative prototyping of content architecture is possible through to enterprise level content management. Chris Hall has been using Drupal for over six years and demonstrates how the Revealjs HTML presentation framework was turned into a slideshow content management system over a weekend with a few strong cups of coffee (and a Whiskey or two).</p> <p>- <b>Word rest and play - A look at the WordPress REST API</b><br/>  <a href=\"http://www.meetup.com/php-sw/members/66068452\">Carl Hughes</a>, Freelance Web Developer</p> <p>--</p> <p><a href=\"http://www.siftdigital.com/\">Sift Digital</a> have kindly offered to host the evening at their office.</p> <p>Afterwards we'll head to the pub to continue the conversation, most likely <a href=\"http://www.smallbarbristol.com/\">Small Bar</a>! </p> <p>--</p> <p><a href=\"https://phpsw.uk/events/229183260-built-on-php\">View on the PHPSW website</a></p> ",
    "end_time": 1457559000,
    "link": "https://www.meetup.com/php-sw/events/229183260/",
    "location": null,
    "org": "phpsw",
    "start_time": 1457548200,
    "title": "Built On PHP"
}