{
    "cancelled": false,
    "description": "<p>In April we're hosting a night about Clean Code! We're at BaseKit's new office this month. </p> <p>- <b>Mission (Im)possible: Quality Decoupled Code with Drupal 7</b></p> <p><a href=\"https://twitter.com/super_marek\">Marek Matulka</a>, Software Engineer at <a href=\"https://sensiolabs.com/\">SensioLabsUK</a></p> <p>We're all excited about Drupal 8 coming up soon and we want to be ready for it! How can we make sure our code is ready for it? How can we build modules that are backwards compatible with D7 and future proofed for D8?</p> <p>Learn how to build code decoupled from your platform and use it with Drupal or any other framework.</p> <p>- <b>Interface segregation; the forgotten 'i' in SOLID</b><br/>  <a href=\"http://www.meetup.com/php-sw/members/39370012\">Dan Ackroyd</a>, Independent C + PHP developer, Imagick maintainer. That guy with the beard</p> <p>When people give talks on the \"S.O.L.I.D.\" design principles one ofthe letters that doesn't get enough attention is the \"i\" - the\"interface segregation principle\". This talk seeks to redress thatimbalance by going into a bit more in-depth into:</p> <p>• An introduction to interface segregation and an explanation of howit make your code easier to test.</p> <p>• Why in PHP we need to apply the principle more broadly, to maketypes be more specific, so that code is more reasonable.</p> <p>• Me babbling on about emotions, and how good code is boring. Which is good!</p> <p>--</p> <p><a href=\"http://www.mixrad.io/\">&lt;/a&gt;&lt;a href=\"http://www.basekit.com/\"&gt;BaseKit</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p><a href=\"http://phpsw.uk/events/229737809-clean-code\">View on the PHPSW website</a></p> ",
    "end_time": 1460579400,
    "link": "https://www.meetup.com/php-sw/events/229737809/",
    "location": {
        "address": "5th Floor, One Castlepark, Tower Hill",
        "city": "Bristol, BS2 0JA",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5848910808563232,
        "name": "BaseKit"
    },
    "org": "phpsw",
    "start_time": 1460568600,
    "title": "Clean Code"
}