{
    "description": "<p>In July we're hosting a night of talks which aren't specifically about writing code.</p> <p>Thanks to our sponsors for their continued support of PHPSW.</p> <p>- <b>Imposter Syndrome: Am I Faking It?</b><br/><a href=\"https://twitter.com/braddle\">Mark Bradley</a>, PHP and Golang software engineer at <a href=\"http://www.sainsburys.co.uk/\">Sainsburys</a></p> <p>Do you feel like you're faking it? like you don't feel good enough to do your job? Feeling like you've blagged your way through your career? Then like me and hundreds of others, you might be suffering from imposter syndrome.</p> <p>During my talk I am going to discuss what imposter syndrome is and how it feels. Then I'm going to talk you through why people suffer from it and how people overcome it.</p> <p>This talk is based on both my personal experiences and those of others. By the end of it I hope you can identify if you are suffering from imposter syndrome and also create a team environment that helps to combat the feeling within your team mates.</p> <p>- <b>Good or bad? - telling the difference is hard</b><br/><a href=\"http://www.meetup.com/php-sw/members/39370012\">Dan Ackroyd</a>, Independent C + PHP developer, Imagick maintainer. That guy with the beard<a href=\"http://www.sainsburys.co.uk/\">&lt;/a&gt;</p> <p>A large part of being a programmer is making choices, whether it's what framework to use, what libraries to use or just how to structure code. Every day when we're programming we try to take choices that are good, and avoid choices that are bad.</p> <p>But what if actually we're all terrible at telling the difference between good and bad? What if we're all just not very good at a fundamental skill needed by programmers?</p> <p>In this talk I'm going to try to demonstrate a couple of common epistemological mistakes that the majority of programmers make, how you can try to analyze what is good and what is bad a bit better, and how to limit the consequences that come inevitably when bad choices are made.</p> <p>--</p> <p>We're heading to &lt;a href=\"http://www.desklodge.com/\"&gt;Desklodge</a> this month. If you're looking for private offices, hot-desks or lounges to work in why not have a look round at the meetup.</p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p><a href=\"http://phpsw.uk/events/230654971-upgrades\">View on the PHPSW website</a></p> ",
    "end_time": 1468441800,
    "link": "https://www.meetup.com/php-sw/events/232342654/",
    "location": {
        "address": "Bristol",
        "city": "BS2 0BY",
        "country": "gb",
        "latitude": 51.453651428222656,
        "longitude": -2.5834341049194336,
        "name": "Desk Lodge, 5th Floor, 1 Temple Way"
    },
    "org": "phpsw",
    "start_time": 1468431000,
    "title": "It's Not All About Code"
}