{
    "cancelled": false,
    "description": "<p>In August we're hosting a night of DevOps related talks.</p> <p>If you've got a lightning talk you're interested in giving - let us know!</p> <p>Thanks to our sponsors for their continued support of PHPSW.</p> <p>- <b>Kickass Development Environments with Docker</b><br/><a href=\"https://twitter.com/rawkode\">David McKay</a>, Organiser of Docker Glasgow &amp; <a href=\"https://www.scotlandphp.co.uk/\">Scotland PHP</a></p> <p>Docker, the hottest technology around at the moment. It swept the Ops world by storm in 2014, became mainstream in 2015, and now it’s set to dominate the developer world, in 2016. Docker is a tool that allows you to package your application up into a single-runnable distributable binary - akin to the phar, but in Hulk mode. Docker allows you, a developer, to specify the exact environment your application needs to run, across development; test; staging; and production. In this talk I will cover the creation of this utopian distributable and show you how to can compose your entire production infrastructure locally with only a small YAML file and without installing a single thing. Lets say hello, to Docker.</p> <p>- <b>The realpath to a happy Opcache</b><br/> <a href=\"http://www.meetup.com/php-sw/members/39370012\">Tom Adam</a>,  Developer at <a href=\"http://www.instantiate.co.uk/\">Instantiate</a></p> <p>A look at Opcache and the realpath cache, the issues they cause during deployment and suggested solutions.</p> <p>--</p> <p><a href=\"http://www.brightpearl.com/\">Brightpearl</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p><a href=\"http://phpsw.uk/events/230654971-upgrades\">View on the PHPSW website</a></p> ",
    "end_time": 1470861000,
    "link": "https://www.meetup.com/php-sw/events/233043526/",
    "location": null,
    "org": "phpsw",
    "start_time": 1470850200,
    "title": "DevOps"
}