{
    "description": "<p>In October we're hosting a night of talks around the theme of Decoupling. This month we'll be at BrightPearl. </p> <p>We've got 2 talks lined up already (and if you want to do a talk (full or lightening) about AOP then it's not too late!).</p> <p>- <b>Solid Structure</b> <br/> <a href=\"http://www.meetup.com/php-sw/members/39370012\">Dan Ackroyd</a>, Independent C + PHP developer, Imagick maintainer. That guy with the beard.</p> <p>Dan is going to attempt to explain how to build modern testable application using a DIC container. </p> <p>He’ll also talk about the limits of what can be written as clean code that makes you happy and you should handle having horrible untestable code. </p> <p>- <b>An Eventful talk<br/></b><a href=\"http://www.meetup.com/php-sw/members/104883962\">Dave Liddament</a>, Director and developer at <a href=\"http://www.lampbristol.com/\">Lamp Bristol</a>.</p> <p>Dave is going given an introduction to events. We’ll look at some examples of how they are used and the benefits (and downsides) of using them and how they can lead to decoupled code. </p> <p>Finally we’ll look at how events are used frameworks like Symfony 3 and Laravel . </p> <p>--</p> <p><a href=\"http://www.brightpearl.com/\">Brightpearl</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p><a href=\"http://phpsw.uk/events/233853545-security\">View on the PHPSW website</a></p> ",
    "end_time": 1476304200,
    "link": "https://www.meetup.com/php-sw/events/234476250/",
    "location": {
        "address": "New Bond House, Bond Street, Bristol BS2 9AG",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.460060119628906,
        "longitude": -2.584520101547241,
        "name": "Brightpearl"
    },
    "org": "phpsw",
    "start_time": 1476293400,
    "title": "Decoupling"
}