{
    "description": "<p>In November the ever popular lightning talks return. If you want to talk then let us know!</p> <p>The speakers we've already got booked include.... </p> <p>- <b>Nigel talks CRAP for a bit</b><br/> <a href=\"http://www.meetup.com/php-sw/members/101607952/\">Nigel Dunn</a></p> <p>- <b>Memcache <br/></b> <a href=\"http://www.meetup.com/php-sw/members/9636681/\">Adrian Groves</a></p> <p>- <b>Mental Health</b><br/><a href=\"http://www.meetup.com/php-sw/members/23546531/\">Tom Robertshaw</a>, director of <a href=\"https://www.meanbee.com/\">Meanbee</a></p> <p>It's easier in the world of today, especially as developers, to push ourselves too hard.  Our community, like many, has seen an increasing number of stories about burnout and illnesses such as anxiety and depression.  During this talk, Tom is going to share a little of his own story and the methods of managing it that he has found useful. </p> <p>- <b>Bringing Functional PHP into the Fold</b><br/> <a href=\"http://www.meetup.com/members/214229101/\">Tom Harding</a></p> <p>Immutability, unit testability, even the humble array_map - it's clear to see that functional programming has put down roots in PHP. So, what comes next? Tom introduces the idea of monoid folds, explains how it can help us to produce more readable and extensible business logic, and probably ends up defending Haskell in a room full of hecklers.</p> <p>- <b>Modern Drupal Development with Composer</b><br/> <a href=\"https://twitter.com/opdavies\">Oliver Davies</a></p> <p>Building a Drupal application? You no longer need to download archives to add new modules or update core, or deal with Drupal specific tools to manage your codebase.With Drupal \"getting off the island\" there has been an increase in the adoption of common PHP tools within the Drupal ecosystem.In this lightning talk, I’ll show how to build a Drupal application using Composer for dependency management.</p> <p>- <b>How pen testing helped me as a Developer<br/></b> <a href=\"https://www.meetup.com/php-sw/members/191215665/\">Paul Marks</a></p> <p>- <b>A Junior’s Guide to Changing The World</b><br/> <a href=\"http://www.meetup.com/php-sw/members/201903363/\">Lucia Velasco</a></p> <p>Lucia's PHPSW debut will be a soft skills talk about the strategies she's picked up on using conversation to tackle problems and effect positive change in your working environment</p> <p>- <b>Mitigating DDOS Attacks With Terraform</b><br/> <a href=\"http://www.meetup.com/php-sw/members/17672291/\">Andy Gale</a></p> <p>--</p> <p><a href=\"http://www.basekit.com/\">BaseKit</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p><a href=\"http://phpsw.uk/events/235102426-lightning-talks\">View on the PHPSW website</a></p> ",
    "end_time": 1478727000,
    "link": "https://www.meetup.com/php-sw/events/235102426/",
    "location": {
        "address": "5th Floor, One Castlepark, Tower Hill",
        "city": "Bristol, BS2 0JA",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5848910808563232,
        "name": "BaseKit"
    },
    "org": "phpsw",
    "start_time": 1478716200,
    "title": "Lightning Talks"
}