{
    "description": "<p>In January we're hosting a night of talks on coding resolutions for the new year.</p> <p>We've got a couple of talks lined up so far, but if you're interested in giving a talk (any length), please let us know.</p> <p>We're at BaseKit this month. Arrival will be from 6:45pm (please don't turn up before then) with talks starting at 7:15pm.</p> <p>Our talks so far:</p> <p>- <b>Reviewing Code Reviews</b></p> <p> <a href=\"http://www.meetup.com/php-sw/members/31894252/\">Lee Stone</a>, Web Team Lead at <a href=\"https://www.gradwell.com/\">Gradwell</a></p> <p>We know that code reviews are considered a good thing and some of us even do them! Why are they beneficial though, what pitfalls are there and how could the process be improved? Lee talks about some of his experiences and what he'd like to improve this year.</p> <p><b>- Go Faster with Ansible<br/></b><a href=\"https://www.meetup.com/php-sw/members/13372662/\">Richard Donkin</a></p> <p>Deploy PHP apps faster in 2017. This talk focuses on how PHP developers can use simple Ansible scripts to rapidly configure new dev and production servers from scratch, and deploy their apps.  No more \"snowflake servers\"!</p> <p><b>- An introduction to the Symfony Console Component<br/></b><a href=\"https://www.meetup.com/php-sw/members/154425842/\">Mike Lovely</a>, developer at <a href=\"https://simpleweb.co.uk/\">SimpleWeb</a></p> <p>Automate a task by creating a simple command for it. An introduction to the Symfony Console Component and how it could save you time.</p> <p><b>- The science behind habits (and how to change them) <br/></b><a href=\"https://www.meetup.com/php-sw/members/35301922/\">Alex Jegtnes</a>, freelance developer.<a href=\"https://www.meanbee.com/\">&lt;/a&gt;</p> <p>I’ll be talking about the science behind habits, how they work, why changing them is h*ckin’ difficult, and how you can use this information to either pick up a new habit or get rid of a bad habit.</p> <p>--</p> <p>&lt;a href=\"http://www.basekit.com/\"&gt;BaseKit</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p><a href=\"http://www.basekit.com/\">&lt;/a&gt;As always, a big thanks to our meetup sponsors &lt;a href=\"http://www.ents24.com/\"&gt;Ents24</a>, <a href=\"http://www.brightpearl.com/\">Brightpearl</a>, <a href=\"https://www.meanbee.com/\">Meanbee</a> &amp; <a href=\"http://deepbluesky.com/\">Deep Blue Sky</a> without whom we wouldn't be able to put on our meetups. </p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p>View on the PHPSW website</p> ",
    "end_time": 1484171100,
    "link": "https://www.meetup.com/php-sw/events/236606412/",
    "location": {
        "address": "5th Floor, One Castlepark, Tower Hill",
        "city": "Bristol, BS2 0JA",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5848910808563232,
        "name": "BaseKit"
    },
    "org": "phpsw",
    "start_time": 1484160300,
    "title": "New Year Coding Resolutions"
}