{
    "cancelled": false,
    "description": "<p>In February we're hosting a night of talks on picking up new skills. We'll be at DeskLodge this month.</p> <p>Our talks this month:</p> <p><b>- Get GOing with a new language<br/></b><a href=\"https://www.meetup.com/php-sw/members/154425842/\">&lt;/a&gt;&lt;a href=\"https://twitter.com/kasiazien\"&gt;Kat Zien</a>, Keyboard wizard, currently busy writing Go and PHP at <a href=\"https://www.brightpearl.com/\">Brightpearl</a><a href=\"https://simpleweb.co.uk/\">&lt;/a&gt;</p> <p>Learning more than one programming language is key to becoming a better developer. It is like adding a new tool to your toolbox. The more tools you have, the easier and quicker you'll be able to tackle whatever job you need to do. You'll also be able to use the right tool for the job, and who doesn't like that?!</p> <p>I picked up Go (golang) about a year ago as it was becoming more popular among developers. Coming from a PHP background, I had no idea what channels or goroutines were or how is concurrency different from parallelism. I’ve got to say, it was a whole new world. Very different, but very cool. I was hooked!</p> <p>The goal of this talk is to give you a good idea of what Go is and how it compares with PHP. We'll look at the language itself as well as the tooling and communities around it. Even if you're not sold on Go by the end of it, I hope you'll leave inspired to go out there and learn whatever language you wanted to look into next.</p> <p><b>- Hard Core Soft Skills <br/></b>&lt;a href=\"https://www.meetup.com/php-sw/members/14618145/\"&gt;Luke Bailey</a>, developer at <a href=\"https://deepbluesky.com/\">Deep Blue Sky</a>.<a href=\"https://www.meanbee.com/\">&lt;/a&gt;</p> <p>As developers, our ability to write code is fundamental. It's only logical that when it comes to growing our skills this is where we allocate our resources; on the code. While these hard development skills are inarguably central to the role of a developer, is it possible that soft skills can be just as useful? This talk will very briefly look at soft skills in the context of being a developer and cover: what they are, why are they important and how we can start using them to better our careers and ourselves.</p> <p><b>- It started with a patch... <br/></b>&lt;a href=\"https://twitter.com/opdavies\"&gt;Oliver Davies</a>, senior developer at <a href=\"https://www.appnovation.com/\">Appnovation</a>.<a href=\"https://www.meanbee.com/\">&lt;/a&gt;</p> <p>A crash course in why and how to contribute to open source development.</p> <p>--</p> <p>As always, a big thanks to our meetup sponsors &lt;a href=\"http://www.ents24.com/\"&gt;Ents24</a>, <a href=\"http://www.brightpearl.com/\">Brightpearl</a>, <a href=\"https://www.meanbee.com/\">Meanbee</a> &amp; <a href=\"http://deepbluesky.com/\">Deep Blue Sky</a> without whom we wouldn't be able to put on our meetups. </p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p>View on the PHPSW website</p> ",
    "end_time": 1486590300,
    "link": "https://www.meetup.com/php-sw/events/237357254/",
    "location": {
        "address": "Bristol",
        "city": "BS2 0BY",
        "country": "gb",
        "latitude": 51.453651428222656,
        "longitude": -2.5834341049194336,
        "name": "Desk Lodge, 5th Floor, 1 Temple Way"
    },
    "org": "phpsw",
    "start_time": 1486579500,
    "title": "New Skills"
}