{
    "cancelled": false,
    "description": "<p>In April we're hosting a night of talks focussed around security.</p> <p>Thanks to BaseKit for kindly hosting us this month.</p> <p>Our talks this month:</p> <p><b>- OWASP Top 10 Proactive Controls<br/></b><a href=\"https://twitter.com/katyanton\">Katy Anton</a>,  Application Security Consultant at <a href=\"http://www.veracode.com/\">Veracode</a> and <a href=\"https://www.owasp.org/index.php/Bristol\">OWASP Bristol</a> Chapter Leader</p> <p>Cyber attacks are a real and growing threat to businesses and an increasing number of attacks take place at application layer. The best defence is to develop applications where security controls are incorporated as part of the software development cycle and used by developers while writing their code.</p> <p>OWASP Top 10 Proactive Controls considers security as part of development.</p> <p>This talk will present the proactive security controls that can be incorporated in development cycle and used while writing the software.  By the end of this presentation you will have a better understanding of  the recommended security controls that you can incorporate into your software projects. For each control, you will learn which OWASP Top 10 Risks can prevent.</p> <p><b>- Secure your web application with 2FA<br/></b><a href=\"https://www.meetup.com/php-sw/members/14618145/\">&lt;/a&gt;&lt;a href=\"https://twitter.com/akrabat\"&gt;Rob Allen</a>, runs <a href=\"https://19ft.com/\">Nineteen Feet</a> and is the author of <a href=\"http://www.manning.com/allen\">Zend Framework in Action</a>.<a href=\"http://www.instantiate.co.uk/\">&lt;/a&gt;</p> <p>Protecting your users' data with just a username and password is no longer satisfactory. Two-factor authentication (2FA) is the primary method of countering the effects of stolen passwords and is easy to implement in your web application. In this session we will discuss what two-factor authentication is, how it works and the challenges associated with it. We will then look how to integrate two-factor authentication into your PHP application's login workflow. We'll consider both YubiKey and Google Authenticator implementations, so you can make your users' accounts more secure.</p> <p>--</p> <p>&lt;a href=\"http://www.basekit.com/\"&gt;BaseKit</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>As always, a big thanks to our meetup sponsors <a href=\"http://www.ents24.com/\">Ents24</a>, <a href=\"http://www.brightpearl.com/\">Brightpearl</a>, <a href=\"https://www.meanbee.com/\">Meanbee</a> &amp; <a href=\"http://deepbluesky.com/\">Deep Blue Sky</a> without whom we wouldn't be able to put on our meetups. </p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p>View on the PHPSW website</p> ",
    "end_time": 1492029900,
    "link": "https://www.meetup.com/php-sw/events/238831685/",
    "location": {
        "address": "5th Floor, One Castlepark, Tower Hill",
        "city": "Bristol, BS2 0JA",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5848910808563232,
        "name": "BaseKit"
    },
    "org": "phpsw",
    "start_time": 1492019100,
    "title": "Security"
}