{
    "cancelled": false,
    "description": "<p>In August we're hosting a night of talks themed around building and deployment.</p> <p>Thanks to BaseKit for kindly hosting us this month.</p> <p>Our talks this month:</p> <p><b>- Deployment within a Traditional IT Environment<br/></b><a href=\"http://www.meetup.com/php-sw/members/201903363/\">&lt;/a&gt;&lt;a href=\"https://twitter.com/akrabat\"&gt;Rob Allen</a>, runs <a href=\"https://19ft.com/\">Nineteen Feet</a> and is the author of <a href=\"http://www.manning.com/allen\">Zend Framework in Action</a>.<a href=\"http://www.rocketmakers.com/\">&lt;/a&gt;</p> <p>Building line-of-business web applications for clients with traditional IT departments brings its own set of challenges when it comes to DevOps. In particular, the IT department adds additional constraints that you may not see in more forward-thinking companies. In this talk, I explore these complexities and shares some solutions we came up with in order to use modern development practices in nontraditional environments. I'll also cover the organizational and technical challenges encountered when IT departments are not used to developers having a say in the server environment and show you why it’s worth spending time getting them on board.</p> <p><b>- The Evolution of Agile<br/></b>&lt;a href=\"https://twitter.com/MPOram\"&gt;</a>Oliver Price, Product Manager at Brightpearl<a href=\"https://maydenacademy.co.uk/\">&lt;/a&gt;&lt;a href=\"http://www.instantiate.co.uk/\"&gt;</a></p> <p>We can probably all agree that project management has changed a lot. I will be sharing my observations and insights on the history of project management, current mechanisms, and how to adapt and improve things to your benefit.</p> <p>We live and work in a fast paced world so it is only fitting our processes change with them. Join me in discussing how pragmatism and a communication is the key to a good project regardless of the methodology you choose.</p> <p>--</p> <p><a href=\"http://www.basekit.com/\">BaseKit</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>As always, a big thanks to our meetup sponsors <a href=\"http://www.ents24.com/\">Ents24</a>, <a href=\"http://www.brightpearl.com/\">Brightpearl</a>, <a href=\"https://www.meanbee.com/\">Meanbee</a> &amp; <a href=\"http://deepbluesky.com/\">Deep Blue Sky</a> without whom we wouldn't be able to put on our meetups. </p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p>View on the PHPSW website</p> ",
    "end_time": 1502311500,
    "link": "https://www.meetup.com/php-sw/events/242086980/",
    "location": {
        "address": "5th Floor, One Castlepark, Tower Hill",
        "city": "Bristol, BS2 0JA",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5848910808563232,
        "name": "BaseKit"
    },
    "org": "phpsw",
    "start_time": 1502300700,
    "title": "Build & Deploy"
}