{
    "description": "<p>In September it's a PHP-NW preview show. We've got 2 devops related talks, and they are both conference talks.</p> <p>Thanks to BaseKit for kindly hosting us this month.</p> <p>Our talks this month:</p> <p><b>- Meet Terraform</b></p> <p><a href=\"http://www.meetup.com/php-sw/members/201903363/\">&lt;/a&gt;&lt;a href=\"https://twitter.com/mheap\"&gt;Michael Heap</a>, developer advocate at <a href=\"https://www.nexmo.com/\">Nexmo</a> and author of <a href=\"https://www.amazon.co.uk/dp/1484216601\">Ansible: Beginner to pro</a><a href=\"http://www.rocketmakers.com/\">&lt;/a&gt;</p> <p>We have a ton of options for provisioning machines once we have an SSH connection available, but how do we get those machines in the first place? </p> <p>Meet Terraform from Hashicorp, your infrastructure automation engine. Providing a declarative interface for your infrastructure, you can define what you need and let Terraform take care of the rest. </p> <p>In this talk, we'll take a look at what Terraform can do for you, walking through your first Terraform configuration all the way to writing your own modules to encapsulate your infrastructure across multiple deployments.</p> <p><b><br/></b></p> <p><b>- Deploying PHP Applications with Fabric<br/></b>&lt;a href=\"https://twitter.com/MPOram\"&gt;</a><a href=\"https://twitter.com/opdavies\">Oliver Davies</a>, Senior Developer at <a href=\"https://microserve.io/\">Microserve</a>.<a href=\"https://maydenacademy.co.uk/\">&lt;/a&gt;&lt;a href=\"http://www.instantiate.co.uk/\"&gt;</a></p> <p>You’ve built your application, and now you just need to deploy it. There are various ways that this could be done – from (S)FTP, to SCP and rsync, to running commands like “git pull” and “composer install” directly on the server (not recommended).</p> <p>My favourite deployment tool of late is <a href=\"http://www.fabfile.org/\">Fabric</a> – a Python based command line tool for running commands locally as well as on remote servers. It’s language and framework agnostic, and unopinionated so you define the steps and workflow that you need – from a basic few-step deployment to a full Capistrano style zero-downtime deployment.</p> <p>This talk will cover some introduction to Fabric and how to write your own fabfiles, and then look at some examples of different use case deployments for your PHP project.</p> <p>-- </p> <p><a href=\"http://www.basekit.com/\">BaseKit</a> have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>As always, a big thanks to our meetup sponsors <a href=\"http://www.ents24.com/\">Ents24</a>, <a href=\"http://www.brightpearl.com/\">Brightpearl</a>, <a href=\"https://www.meanbee.com/\">Meanbee</a> &amp; <a href=\"http://deepbluesky.com/\">Deep Blue Sky</a> without whom we wouldn't be able to put on our meetups. </p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> <p>View on the PHPSW website</p> ",
    "end_time": 1505335500,
    "link": "https://www.meetup.com/php-sw/events/242956550/",
    "location": {
        "address": "5th Floor, One Castlepark, Tower Hill",
        "city": "Bristol, BS2 0JA",
        "country": "gb",
        "latitude": 51.4552116394043,
        "longitude": -2.5848910808563232,
        "name": "BaseKit"
    },
    "org": "phpsw",
    "start_time": 1505324700,
    "title": "Devops (PHP-NW preview show)"
}