{
    "description": "<p>It's the ever popular lightning talks night. This time we have 7 amazing talks to bring you, however it's not just talks this month...</p> <p>This month we welcome a new sponsor <a href=\"https://equiniticybersecurity.com/\">Equiniti Cyber</a>, a UK leader in its field. They are about to open a new tech hub to support their exciting new cyber security product development. If you'd like to join them check out their <a href=\"https://equiniticybersecurity.com/careers/\">current vacancies</a>. See below for more details about our sponsor.</p> <p>And if all of the above wasn't enough we will be giving away free tickets to <a href=\"https://www.eventbrite.co.uk/e/phpem-unconference-2017-tickets-37937684636\">PHPem Unconference 2017</a>. </p> <p>Sign up quick before all the spaces go.</p> <p><b>Our talks this month:<br/></b></p> <p><a href=\"https://www.meetup.com/php-sw/members/101607952/\">Nigel Dunn</a> will be telling us how to refine MVC using the Action-Domain-Responder pattern.</p> <p>Is your Docker image too big asks <a href=\"https://twitter.com/pfwd\">Peter Fisher</a>? He'll show you how to put it on a diet. </p> <p><a href=\"https://twitter.com/jnthnjffris\">Jonathan Jefferies</a> begs us not to forget unit testing our CSS!</p> <p>Are you PHP apps running too fast? <a href=\"https://twitter.com/adeslade\">Ade Slade</a> will show us how to build a slow PHP app!</p> <p>Do you fear your services are not as secure as they should be? <a href=\"https://www.meetup.com/php-sw/members/225727796/\">Michael Bush</a> will show us Web Application Firewalls and other techniques to keep us protected. </p> <p>And <a href=\"https://twitter.com/kasiazien\">Kat Zien</a> will show us how to code like is 1995.</p> <p><b>Welcome to our new sponsor Equiniti Cyber:</b></p> <p><a href=\"https://equiniticybersecurity.com/\">Equiniti Cyber</a> handle sensitive data and intellectual properties, from global organisations, each and every day. With extensive experience of providing cyber security solutions to businesses of every size, Equiniti Cyber Security offers the ability to organisations to meet and defeat those attacks, head on. They are about to open a new tech hub to support their exciting new cyber security product development. If you'd like to join them check out their <a href=\"https://equiniticybersecurity.com/careers/\">current vacancies</a>. </p> <p>-- </p> <p>As always, a big thanks to our meetup sponsors  <a href=\"https://equiniticybersecurity.com/\">Equiniti Cyber</a>, <a href=\"http://www.ents24.com/\">Ents24</a>, <a href=\"http://www.brightpearl.com/\">Brightpearl</a>, <a href=\"https://www.meanbee.com/\">Meanbee</a> &amp; <a href=\"http://deepbluesky.com/\">Deep Blue Sky</a> without whom we wouldn't be able to put on our meetups. </p> <p>Afterwards we'll head to the pub, probably the <a href=\"http://volunteertavern.co.uk/real-ales\">Volunteer Tavern</a>!</p> <p>--</p> ",
    "end_time": 1507754700,
    "link": "https://www.meetup.com/php-sw/events/243917107/",
    "location": {
        "address": "New Bond House, Bond Street, Bristol BS2 9AG",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.460060119628906,
        "longitude": -2.584520101547241,
        "name": "Brightpearl"
    },
    "org": "phpsw",
    "start_time": 1507743900,
    "title": "Lightning talks"
}