{
    "description": "<p>In March we're holding a night of talks around the topic of Code Quality.</p> <p>Thanks to Brightpeal for kindly hosting us this month.</p> <p>Our talks this month:</p> <p>- Crafting Quality PHP Applications: an overview<br/>James Titcumb (<a href=\"http://twitter.com/asgrim\" class=\"linkified\">http://twitter.com/asgrim</a>), Conference speaker and developer with Roave (<a href=\"https://roave.com/\" class=\"linkified\">https://roave.com/</a>)</p> <p>This prototype works, but it's not pretty, and now it's in production. That legacy application really needs some TLC. Where do we start? When creating long lived applications, it's imperative to focus on good practices. The solution is to improve the whole development life cycle; from planning, better coding and testing, to automation, peer review and more. In this talk, we'll take a quick look into each of these areas, looking at how we can make positive, actionable change in our workflow.</p> <p>- Good or bad? - telling the difference is hard.<br/>Dan Ackroyd (<a href=\"https://twitter.com/mrdanack\" class=\"linkified\">https://twitter.com/mrdanack</a>)</p> <p>A large part of being a programmer is making choices, whether it's what framework to use, what libraries to use or just how to structure code. Every day when we're programming we try to take choices that are good, and avoid choices that are bad.</p> <p>But what if actually we're all terrible at telling the difference between good and bad? What if we're all just not very good at a fundamental skill needed to do our jobs?</p> <p>In this talk I'm going to try to demonstrate a couple of common epistemological mistakes that people make, how you can try to analyze what is good and what is bad a bit better, and how to limit the consequences that come inevitably when bad choices are made.</p> <p>--</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> ",
    "end_time": 1521061200,
    "link": "https://www.meetup.com/php-sw/events/248129528/",
    "location": {
        "address": "New Bond House, Bond Street, Bristol BS2 9AG",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.460060119628906,
        "longitude": -2.584520101547241,
        "name": "Brightpearl"
    },
    "org": "phpsw",
    "start_time": 1521053100,
    "title": "Code Quality"
}