{
    "cancelled": false,
    "description": "<p>At the end of April we're holding an extra meetup in Bath. Thanks to Mayden Academy (<a href=\"https://maydenacademy.co.uk/\" class=\"linkified\">https://maydenacademy.co.uk/</a>) for helping host us.</p> <p>We've got two talks lined up:</p> <p>- Effective Code Review<br/>Dave Liddament (<a href=\"https://twitter.com/daveliddament\" class=\"linkified\">https://twitter.com/daveliddament</a>), Director and developer at Lamp Bristol (<a href=\"http://www.lampbristol.com/\" class=\"linkified\">http://www.lampbristol.com/</a>).</p> <p>There are many benefits of code review---lower development costs, increased code quality, quick up-skilling and on-boarding of team members. Despite these benefits many teams don’t have code review as part of their process at all, while others don’t get the gains they should.</p> <p>This talk outlines the business case for code review and explores how to make code review effective, specifically looking at:</p> <p>* Expectations of what can be achieved with code review.<br/>* What should be covered by code review (including example code).<br/>* What should not be covered by code review.<br/>* How to write code that makes code review easy.<br/>* What makes good code review comments.<br/>* What makes good responses to code review comments.</p> <p>Finally, to wrap up, you'll be shown how to enable a code review with GitHub. Spoiler alert---it can be done it under five minutes!</p> <p>So if you are on a team that isn’t using code review, or isn’t using it effectively, then you should be at this talk.</p> <p>- Progressive Web Apps<br/>Mike Oram (<a href=\"https://twitter.com/MPOram\" class=\"linkified\">https://twitter.com/MPOram</a>), trainer at Mayden Academy (<a href=\"https://maydenacademy.co.uk/\" class=\"linkified\">https://maydenacademy.co.uk/</a>)</p> <p>There is a lot of talk about Progressive Web Apps at the moment. It is a hot topic in the JavaScript community.</p> <p>In this talk, we will briefly explore what a PWA is and how to build one. We will look at the benefits of PWA's and more importantly their limitations.</p> <p>We then look a bit deeper at the technologies behind PWA's such as Service Workers, in particular we will look at the mechanics behind Service Workers, and how they will affect your back-end builds.</p> <p>Finally, we will look at offline development, the offline first life-cycle and the tools and technologies needed to start building offline applications. Comparing offline storage mechanisms, and their limitations.</p> <p>This talk is great for anyone building web-based applications, in any language, or anyone wanting to learn more about PWA's and offline development</p> <p>--</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, we'll let you know where on the night!</p> ",
    "end_time": 1524686400,
    "link": "https://www.meetup.com/php-sw/events/249092248/",
    "location": null,
    "org": "phpsw",
    "start_time": 1524678300,
    "title": "Bath Edition: Code Review & PWAs"
}