{
    "cancelled": false,
    "description": "<p>In June join us at Desklodge where it is time for the future as we take a look at neural networks and why time zones are still a pain.</p> <p>SR2 – Socially Responsible Recruitment in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Time Zones and Calendars are a PITA<br/>Derick Rethans, Senior Engineer at MongoDB 7 Author of Xdebug (<a href=\"https://twitter.com/derickr\" class=\"linkified\">https://twitter.com/derickr</a>)</p> <p>Time Zones and Calendars are a PITA. Although they govern how we live and when we do what, handling them programmatically is not an easy feat.</p> <p>In this presentation we will look at how to deal with time zones, and two calendars: natural year, and ISO8601. We will see how it is hard to make assumptions on how they work, and explain how they came into existence. We’ll focus mostly on how to handle them from within PHP, as well as how we (should) store them in databases. We’ll also have a quick look at date manipulation when querying data.</p> <p>- Build your own Neural Network, with PHP!<br/>Vítor Brandão, FOSS Enthusiast &amp; Director at Noiselabs Consulting (<a href=\"https://twitter.com/noiselabs\" class=\"linkified\">https://twitter.com/noiselabs</a>)</p> <p>Curious about all the hype around Machine Learning and Artificial Intelligence? Heard of \"Neural Networks\" and \"Deep Learning\" but confused about what it really means?</p> <p>In this talk you'll see what Artificial Neural Networks (ANN) look like and how they can \"learn\". And along the way you'll discover how you can build your own ANN, with PHP of course!</p> <p>--<br/>SR2 – Socially Responsible Recruitment in Bristol have kindly offered to cover hosting costs for the evening, which is helping us have a larger venue! You may have noticed Nathaniel floating around at previous events - Nathaniel helps PHP Developers find jobs that fit their aspirations - whether you are a seasoned developer looking to take the next step in your career, or a junior about to embark on a career in development, with partnerships with some of Bristol’s most impressive companies Nathaniel will be able to help you. Grab a coffee or beer with him!</p> <p>You can find out more about SR2 at <a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a></p> <p>--</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> ",
    "end_time": 1528920000,
    "link": "https://www.meetup.com/php-sw/events/251000309/",
    "location": null,
    "org": "phpsw",
    "start_time": 1528911900,
    "title": "Time for the Future"
}