{
    "cancelled": false,
    "description": "<p>Need to get yourself out of a sticky situation? Wish your application was more performant? Good news! in July we present two talks which can help you out.</p> <p>Thanks to BaseKit for kindly hosting us this month.</p> <p>Our talks this month:</p> <p>- Get out of jail \"free\" cards - tips and quick fixes to get you out of sticky situations with servers, websites and APIs<br/>Chris Sherry, Developer at 3 Sided Cube &amp; Organiser of PHP Dorset (<a href=\"https://twitter.com/tweetingsherry\" class=\"linkified\">https://twitter.com/tweetingsherry</a>)<br/>Dave Hulbert, Engineering Director at Base &amp; Organiser of PHP Dorset (<a href=\"https://twitter.com/dave1010\" class=\"linkified\">https://twitter.com/dave1010</a>)</p> <p>There are lots of popular talks about the best practice and right way to build your software and infrastructure to ensure the most reliable, fault tolerant systems and optimised codebases, without which we would not know how to improve and better our processes.</p> <p>But in reality, projects exist in a multitude of states of imperfectness, sometimes due to commercial decisions or financial demands, scheduling pressures, or unfortunately some naivety or ignorance on our parts or those we inherited those projects from.</p> <p>Together Chris and Dave have years of experience working with and maintaining legacy PHP codebases, MVP monoliths and prototypes that got shipped to production. They have joined forces to share with you some of their favourite tips on getting through times of late night bug fixing, weekend patches and badly timed traffic spikes. The talk will help you survive your initial dilemma to keep things running and give ideas for some better long term resolutions.</p> <p>- Performance optimisation: how do I go about it?<br/>Kat Zien, Keyboard wizard (PHP and Go) at Brightpearl &amp; Organiser of PHPSW (<a href=\"https://twitter.com/kasiazien\" class=\"linkified\">https://twitter.com/kasiazien</a>)</p> <p>Every developer should be confident that their code is efficient and safe to run in production. But it can be hard to get started. What tools to use? What do the graphs mean? What to look at first? In this talk, we will analyse and optimise the performance of a simple PHP application. By demonstrating how to use some of the excellent open source projects such as xdebug, xhprof or meminfo I hope to give you a good idea of where to start with analysing and optimising your PHP code.<br/>--</p> <p>BaseKit (<a href=\"http://www.basekit.com/\" class=\"linkified\">http://www.basekit.com/</a>) have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. Don't forget to check them out - and if you're looking, they are hiring.</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> ",
    "end_time": 1531339200,
    "link": "https://www.meetup.com/php-sw/events/252140601/",
    "location": null,
    "org": "phpsw",
    "start_time": 1531331100,
    "title": "Unlock Performance"
}