{
    "cancelled": false,
    "description": "<p>What makes software development complex? How can we extract useful information out of our applications using machine learning techniques? Our August meetup helps answer both of those questions!</p> <p>Thanks to Real Time Consultants (<a href=\"https://www.realtimeconsultants.co.uk/\" class=\"linkified\">https://www.realtimeconsultants.co.uk/</a>) who are hosting us in their offices this month.</p> <p>Our talks this month:</p> <p>- Software Complexities<br/>Peter Fisher, Freelance Web Developer &amp; Mobile Developer and host of the How to code Well Youtube Channel (<a href=\"https://twitter.com/pfwd\" class=\"linkified\">https://twitter.com/pfwd</a>)</p> <p>During the life cycle of a system there can be vast amounts of internal and external influences that can lead to over complicated processes, infrastructure, design architectures, and ugly code. Decisions are sometimes made that can make software costly and difficult to maintain. The more complicated the software is the more time it takes to build, test and deploy.<br/>What are the key areas that make software so complicated and can we identify these before they get out of hand?</p> <p>Get Peter's initial thoughts here: <a href=\"https://youtu.be/khT3lxKIbIs\" class=\"embedded\">https://youtu.be/khT3lxKIbIs</a></p> <p>- Machine learning and trend analysis in PHP<br/>Michael Cullum, Backend software engineer, Symfony Security Lead, phpfig Core Committee &amp; SamKnows Principal Architect (<a href=\"https://twitter.com/michaelcullumuk\" class=\"linkified\">https://twitter.com/michaelcullumuk</a>)</p> <p>The world we live in is one where data is one of the most valuable assets. There are many different pieces of data we can analyze on all kinds of data from analytics of user behavior of your platform, user generated content, monitoring of exception rates, or when your core business model is to provide some kind of analytics platform. This talk will talk about how you can, in your PHP applications, perform utilize machine learning techniques to build models, analyze data to get useful information and spot anomalies.<br/>--</p> <p>Real Time Consultants (<a href=\"https://www.realtimeconsultants.co.uk/\" class=\"linkified\">https://www.realtimeconsultants.co.uk/</a>) have kindly offered to host the evening at their office, and as always we'll sort out some ales, lagers, soft drinks and snacks. They're an incredibly friendly team, so don't forget to check them out.</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, probably somewhere different to the Volunteer Tavern!</p> ",
    "end_time": 1533758400,
    "link": "https://www.meetup.com/php-sw/events/253335570/",
    "location": null,
    "org": "phpsw",
    "start_time": 1533750300,
    "title": "Learning About Complexities"
}