{
    "description": "<p>In September join us at Desklodge where we take an adventure into software development in the real world and the PHP community</p> <p>SR2 – Socially Responsible Recruitment in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Dungeons, Dragons &amp; Developers<br/>Matt Brunt (<a href=\"https://twitter.com/brunty\" class=\"linkified\">https://twitter.com/brunty</a>), Organiser or PHPEM and Senior Software Engineer with Viva IT (<a href=\"http://www.vivait.co.uk/\" class=\"linkified\">http://www.vivait.co.uk/</a>) where he leads and mentors a team of developers</p> <p>You enter the dungeon, as the echoes of your footsteps sound around you, something catches your eye - is that… oh, oh no.</p> <p>You grab your trusty sword and with your fellow adventurers, you seek to overcome the mighty challenge that lays ahead of you: building software.</p> <p>This talk is a look at some of the parallels between Dungeons and Dragons, and software development.</p> <p>We’ll see how lessons learned through delving into dungeons and fighting monsters with a party of adventurers can help teams of developers when building software in the real world.</p> <p>Are you ready to join me in a mighty quest for better software?</p> <p>- The Symfony Open-source Community<br/>Zan Baldwin (<a href=\"https://twitter.com/ZanBaldwin\" class=\"linkified\">https://twitter.com/ZanBaldwin</a>), developer of SaaS APIs</p> <p>The Symfony project is more than just a codebase; it is a community around what has become a professional standard within the PHP ecosystem. We’ll explore this community and its members, the direction its leadership is taking it in, different ways you can get involved beyond just making a pull request, and how community participation can benefit and enrich your life.</p> <p>--<br/>SR2 – Socially Responsible Recruitment in Bristol have kindly offered to cover hosting costs for the evening, which is helping us have a larger venue! You may have noticed Nathaniel floating around at previous events - Nathaniel helps PHP Developers find jobs that fit their aspirations - whether you are a seasoned developer looking to take the next step in your career, or a junior about to embark on a career in development, with partnerships with some of Bristol’s most impressive companies Nathaniel will be able to help you. Grab a coffee or beer with him!</p> <p>You can find out more about SR2 at <a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a></p> <p>--</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> ",
    "end_time": 1536782400,
    "link": "https://www.meetup.com/php-sw/events/253837277/",
    "location": {
        "address": "Bristol",
        "city": "BS2 0BY",
        "country": "gb",
        "latitude": 51.453651428222656,
        "longitude": -2.5834341049194336,
        "name": "Desk Lodge, 5th Floor, 1 Temple Way"
    },
    "org": "phpsw",
    "start_time": 1536774300,
    "title": "Software & Communities in the Real World"
}