{
    "cancelled": false,
    "description": "<p>At the end of September, due to popular demand, we've decided to hold an extra meetup in Bath. We're hosting this one on a Thursday to try and open it up to some more people too.</p> <p>Thanks to blubolt (<a href=\"https://www.blubolt.com/\" class=\"linkified\">https://www.blubolt.com/</a>) &amp; Mayden Academy (<a href=\"https://maydenacademy.co.uk/\" class=\"linkified\">https://maydenacademy.co.uk/</a>) who are helping make this extra meetup possible.</p> <p>We've got two talks lined up:</p> <p>- The Devil in our Data<br/>Thierry Draper (<a href=\"https://twitter.com/thierrydraper\" class=\"linkified\">https://twitter.com/thierrydraper</a>), Technical Director at Deep Blue Sky (<a href=\"https://deepbluesky.com/\" class=\"linkified\">https://deepbluesky.com/</a>).</p> <p>As we progress through this age of digital dependency, do we fully understand the risks we are taking with our data each and every day? From companies announcing data breaches with an ever increasing frequency, to ransomware attacks and good old fashioned phishing attempts, our digital identities are under constant threat. This talk will highlight some of the ever more complex and subtle ways in which we are under attack, and start the conversation on how we - as both end-users and developers - should approach the problem before the World is taken over by Nigerian princes, fake news authors and the NSA.</p> <p>- Squash Bugs with Static Analysis<br/>Dave Liddament (<a href=\"https://twitter.com/daveliddament\" class=\"linkified\">https://twitter.com/daveliddament</a>), Director and developer at Lamp Bristol (<a href=\"http://www.lampbristol.com/\" class=\"linkified\">http://www.lampbristol.com/</a>).</p> <p>All developers know that bugs are bad and finding them can be difficult. The good news is that tools to help us find and prevent them are becoming more powerful. Modern static analysis tools (like Psalm, Phan and PHPStan) are far more advanced than their predecessors. They can find a whole range of bugs whilst keeping the false positive rate low. This talk introduces more advanced static analysis. It will show the kinds of bugs that the more advanced static analysis tools can find. We’ll then look at how they can be added to your current development work flow. Finally, we’ll look at how we can write our code in a way to get the most out of static analysis.</p> <p>--</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, we'll let you know where on the night!</p> ",
    "end_time": 1538078400,
    "link": "https://www.meetup.com/php-sw/events/254568592/",
    "location": null,
    "org": "phpsw",
    "start_time": 1538070300,
    "title": "Bath Edition: Analyse Your Data"
}