{
    "description": "<p>In November join us at Runway East where things are all a bit back to front as we present a couple of talks which are a bit more frontend focused.</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Progressive Web Apps: Reasons, Architectures, Strategies and Tools<br/>Ismael Velasco (<a href=\"https://twitter.com/IsmaelVelasco\" class=\"linkified\">https://twitter.com/IsmaelVelasco</a>)</p> <p>If Google has the web and mobile covered, why would they invest so heavily on a hybrid? If Tinder and Facebook are already benchmarks of success, why would they invest in PWA versions? Why would those of us working on less grandiose projects want to build PWAs? This talk will answer those questions, and give a guided tour of the state of PWAs today in various platforms; architectural issues, cache and design strategies you may need to consider in order to build commercial PWAs; and the tool ecosystem available to you. It will also touch on why you wouldn't build PWAs.</p> <p>- The Web API<br/>Mike Oram (<a href=\"https://twitter.com/mporam\" class=\"linkified\">https://twitter.com/mporam</a>), Lead at Mayden Academy (<a href=\"https://mayden.academy/\" class=\"linkified\">https://mayden.academy/</a>)</p> <p>The web API has been a vital part of the JavaScript ecosystem for quite some time now, giving us AJAX, window timers and more. With the rise of progressive web apps, the web API's functionality is increasing like never before. To compete with native applications, the web API has some fantastic and powerful new features, with some awesome, and scary results. During this talk we will explore some of the newer web API features, how to use them and more importantly, the risks that they pose.</p> <p>After the talks we will stay for drinks. Yes the venue, Runway East, has it's own bar!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy. This month we'll be stopping at the venue as they have their own bar.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1542229200,
    "link": "https://www.meetup.com/php-sw/events/255620983/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45316696166992,
        "longitude": -2.590857982635498,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1542221100,
    "title": "Back to Front"
}