{
    "cancelled": false,
    "description": "<p>In January join us at Runway East for 2 exciting talks. First we'll learn all about the Test to Break principle. And then we'll discover how to tackle legacy code bases.</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Test to Break Principles<br/>Rob Waller (<a href=\"https://twitter.com/RobDWaller\" class=\"linkified\">https://twitter.com/RobDWaller</a>)</p> <p>The talk aims to highlight the importance of testing, why developers must spend more of their time testing, how testing generates more robust applications and why testing makes developers' lives easier. The talk is based around a live coding demo.<br/>The talk will:<br/>Explain the difference between tests that prove an application works and tests which aim to break the application logic<br/>- Highlight how test to break principles force developers to introduce logic to handle unexpected behaviour<br/>- Show how test to break principles result in more robust applications as developers write code that can only be used in one way<br/>- Encourage developers to apply test to break principles to all types of tests, including manual tests.</p> <p>- Let's get you geared up to tackle legacy code<br/>Frederick Vanbrabant (<a href=\"https://twitter.com/maybeFrederick\" class=\"linkified\">https://twitter.com/maybeFrederick</a>)</p> <p>The first step of working with legacy code is realizing the incredible amount of value that has dropped in your lap.<br/>In this talk, we are going to pinpoint that value. And move that value in a better to maintain and understand codebase.</p> <p>First, we will cover the general mentality that will make it easier to prepare a plan of attack.<br/>Next up are more technical tips that will make it easier to talk about the code.<br/>We will end off the session by actually porting a small piece of code.</p> <p>After the talks we will stay for drinks. Yes the venue, Runway East, has it's own bar!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy. This month we'll be stopping at the venue as they have their own bar.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), Helastel (<a href=\"https://www.helastel.com/\" class=\"linkified\">https://www.helastel.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1547067600,
    "link": "https://www.meetup.com/php-sw/events/257289640/",
    "location": null,
    "org": "phpsw",
    "start_time": 1547059500,
    "title": "Test or else... Legacy"
}