{
    "cancelled": false,
    "description": "<p>In February join us at Runway East for 2 great talks on some popular topics right now. First up we take a look at Serverless PHP and then we tackle chatbots.</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Introduction to Serverless PHP<br/>Rob Allen (<a href=\"https://twitter.com/akrabat\" class=\"linkified\">https://twitter.com/akrabat</a>)</p> <p>APIs and microservices are how we build modern web applications and serverless technologies make this easy. This session will show you how serverless applications are built and how you can leverage your PHP skills to build APIs of all shapes and sizes. We will cover how to use your current knowledge to build applications in PHP within Apache OpenWhisk or AWS Lambda, leveraging the API Gateway to build robust APIs quickly and easily. By the end of the session, you’ll be well placed to design and build your own applications that take full advantage of the power of serverless technologies.</p> <p>- The Bots Are Taking Over: Developing Conversational Agents With ChatScript and PHP<br/>Ismael Velasco (<a href=\"https://twitter.com/IsmaelVelasco\" class=\"linkified\">https://twitter.com/IsmaelVelasco</a>)</p> <p>What's the deal with chatbots (estimated market value of USD $1.34 billion by 2024)? What are the advantages and disadvantages of machine learning vs rule based systems? Is the Singularity gonna wipe us out tomorrow?</p> <p>With little things like that out of the way, this talk will focus on introducing ChatScript, the gold standard in rule-based conversational NLP (natural language processing). I'll demo how to build a chatbot of increasing sophistication, and how to harness PHP to apply the chatbot functionality to a wide range of applications</p> <p>After the talks we will stay for drinks. Yes the venue, Runway East, has it's own bar!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy. This month we'll be stopping at the venue as they have their own bar.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1550091600,
    "link": "https://www.meetup.com/php-sw/events/258342403/",
    "location": null,
    "org": "phpsw",
    "start_time": 1550083500,
    "title": "Chatting Serverless"
}