{
    "cancelled": false,
    "description": "<p>In April join us at Desklodge where the ever popular lightning talks night returns!</p> <p>We have the following talks confirmed:</p> <p>Rob Reeves asks \"Is there such a thing as rubbish code?\" He'll examine if there is such a thing as bad code and what it takes to make good code.</p> <p>Maybe you're working on an API? If so let Erica Bradbury explain the benefits that Postman will deliver.</p> <p>If you are feeling like you can't be bothered and you don't really care about work anymore then let Charlie Coggans explain how to combat developer apathy.</p> <p>Have you wondered what all those colourful elephants are? Ashley will enlighten you with a talk about Enfys and the PHP diversity project.</p> <p>Want to develop a web application quickly? Let Phil Mobbs show you have with SilverStripe CMS.</p> <p>Is setting up your development environment for Laravel projects a pain? Peter Stone show us how to make it easier with Valet.</p> <p>And finally Lucia gazes into her crystal ball to tell us what AI will look like in 10, 30 and 100 years from now.</p> <p>--</p> <p>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>), &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> ",
    "end_time": 1554926400,
    "link": "https://www.meetup.com/php-sw/events/259980550/",
    "location": null,
    "org": "phpsw",
    "start_time": 1554918300,
    "title": "Lightning Talks"
}