{
    "cancelled": false,
    "description": "<p>In May join us at Runway East for 2 great talks around the topic of monitoring</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Monitoring as a First-Class Citizen<br/>Matthew Macdonald-Wallace</p> <p>\"Trust me, our customers will tell us that the system has an issue long before any monitoring can...\"</p> <p>When Matt Wallace heard a senior developer say this nearly 10 years ago, he could hardly believe what he was hearing. Monitoring should *always* pick up issues quicker than your customers, and yet even in the age of NewRelic, DataDog, and Microsoft Insights there are a significant number of teams who only monitor whether their website is up or not.</p> <p>In this talk Matt takes us through the different layers of monitoring, explores the differences between the types and acronyms, and explains why, regardless of where you work in the stack, you should be monitoring first and writing code second.</p> <p>- Profile with Blackfire.io, and monitor a platform at scale<br/>Nick Downton</p> <p>We will take a look at some of the tools used for monitoring and issue diagnosis in a large scale PAAS hosting platform, and then take a look at how we can dig deeper to resolve performance issues using Blackfire.</p> <p>After the talks we'll head somewhere for drinks.</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1557344700,
    "link": "https://www.meetup.com/php-sw/events/260822959/",
    "location": null,
    "org": "phpsw",
    "start_time": 1557337500,
    "title": "Monitoring"
}