{
    "cancelled": false,
    "description": "<p>In June join us at DeskLodge for talks around the topic of architecture</p> <p>This month's talks are:</p> <p>- How do you Structure Your Apps?<br/>Kat Zien, Fincrime Engineer at Monzo (<a href=\"https://twitter.com/kasiazien\" class=\"linkified\">https://twitter.com/kasiazien</a>)</p> <p>How should I structure my code? What works best for object-oriented design? Is there an alternative to MVC? This talk will answer those questions and give an overview of common layouts and best practices to make projects testable, maintainable and easy to understand. We will also look at DDD and hexagonal / clean / onion architectures and go through a few different implementations of the same app to illustrate the pros and cons of each approach.</p> <p>- Tests Make Good Architects<br/>Sam Burns, PHP contractor in London (<a href=\"https://twitter.com/SamBurnsUK\" class=\"linkified\">https://twitter.com/SamBurnsUK</a>)</p> <p>This talk takes a look at the positive impacts that automated tests can have on architecture. Unit testing in PHPUnit or PhpSpec, as well as behavioural testing using tools like Behat, have a noticeable effect on software architecture. Tested (or testable) code is often easier to work with, cleaner, and has architectural advantages. We will take a look at some of the impacts that a good test suite can have on your application’s architecture, and how to let your tests be your architect.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1560369600,
    "link": "https://www.meetup.com/php-sw/events/261806422/",
    "location": null,
    "org": "phpsw",
    "start_time": 1560361500,
    "title": "Architecture"
}