{
    "cancelled": false,
    "description": "<p>In August join us at DeskLodge for talks about Background workers and Mindfulness for Developers.</p> <p>We also have a new venue sponsor - Toolstation.<br/>Toolstation is one of Britain’s fastest growing suppliers of tools, accessories and building supplies to the trade, home improvers and self-builders. With over 350 branches throughout the UK and an award winning website our multi-channel offering is developed entirely in-house.<br/>Toolstation are excited to sponsor PHPSW. As a PHP driven retailer with its roots firmly in the South West, we are looking forward to meeting other PHP evangelists to both inspire and learn from.</p> <p>This month's talks are:</p> <p>- The benefits of background workers<br/>Dan Ackroyd</p> <p>Some things that need to be processed in a web based application can take a long time to run.<br/>Moving this work to be done in a background worker can provide lots of benefits for the user and make your life easier as a developer.<br/>Dan's going to talk about this stuff, going through exactly what the problems are, how to implement background workers, and the diverse benefits they give.</p> <p>- Mindfulness for Developers: Calmness for Coders - wellbeing in the tech workplace<br/>Arabella Tresilian</p> <p>The developer’s brain works hard. Billions of neurons hyperwire to enable the coder to think multidimensionally for hours a day, under complex deadlines, day after day. An understanding of what keeps the brain/mind fresh makes for a more fulfilling and productive career. This interactive session gives participants an overview of neuropsychology for the coding mind, and presents them with a go-to tool for keeping their workplace brain-state healthy, calm and balanced.<br/>Arabella is a workplace and civil mediator, specialising in conflict prevention and mental health. She is an associate trainer to the charity Mind, leading on corporate workplace wellbeing training for the Bath region, and she's also a certified Mental Health First Aider. Most of her family members seem to be developers now, and she works from the heart of the tech world in Bath, at the Guild Co-Working Hub. Following a diagnosis of autism in her thirties, she set about hacking her mind to establish better mental health for herself, and now shares her learning with others. Find out more at arabellatresilian.com.</p> <p>Afterwards we'll head to the pub, probably the Volunteer Tavern (<a href=\"http://volunteertavern.co.uk/real-ales\" class=\"linkified\">http://volunteertavern.co.uk/real-ales</a>)!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our venue sponsor Toolstation (<a href=\"https://www.toolstation.com/\" class=\"linkified\">https://www.toolstation.com/</a>) and our regular meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; Deep Blue Sky (<a href=\"http://deepbluesky.com/\" class=\"linkified\">http://deepbluesky.com/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1565811900,
    "link": "https://www.meetup.com/php-sw/events/263566142/",
    "location": null,
    "org": "phpsw",
    "start_time": 1565804700,
    "title": "Calm coding with Background workers"
}