{
    "description": "<p>In September join us at Runway East for 2 great talks, where we take a look at The Politics of Tool-Shaming and JenkinsX</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Bro, Do You Even Code? The Politics of Tool-Shaming<br/>Jim Seconde</p> <p>Most of us have heard it at some point. “WHAT? You use X framework/tool/OS/language?! So… you’re a bad developer then?”</p> <p>I did not come from a Software Development background into this industry. I was an outsider, but it’s what I wanted to do my whole life. This is my story: how I refocused and retrained in my career to be confronted with a nightmare of gatekeeping, elistism and aggression. I saw what I thought was a problem, and I’d like to propose a solution.</p> <p>What we do is hard. We’re in a young industry full of contradictions and opinions, and sometimes it excludes people, it shapes new developers’ attitudes poorly and it causes people to walk away. In this talk I’ll focus on what I’ve experienced, what others have experienced, what is harmful to your business with this culture and what can be done about it.</p> <p>PS. I don’t care about emacs or vim. Can you ship it?</p> <p>- JenkinsX - All your repos belong to us<br/>Paul Dragoonis</p> <p>Microservices? Monolith? It doesn't matter! Let JenkinsX give you a preview environment for each Pull Request, on every repo you import JenkinsX into.In this talk, we'll take a Symfony4 application, import JenkinsX into it, and each Pull Request will have its own dynamic sub domain, running on a Kubernetes cluster, deployed using helm. This is just skimming the surface of awesome power for your Symfony projects.</p> <p>Paul Dragoonis, a member of PHP, PHP-FIG and the Jenkins teams, is a full-stack software consultant at Team Neev, where he architects, designs and implements software solutions for a variety of large organizations in the public and private sector. Paul spends a significant amount of his time rolling out CI/CD pipelines and enjoys sharing his experiences with the wider community by way of private training or conference speaking.</p> <p>After the talks we'll head somewhere for drinks.</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), Space 48 (<a href=\"https://www.space48.com/\" class=\"linkified\">https://www.space48.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1568232000,
    "link": "https://www.meetup.com/php-sw/events/264424085/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1568223900,
    "title": "Don't shame the Butler"
}