{
    "description": "<p>You're in for a treat in March, we have 2 huge names in the PHP World speaking...<br/>Derick Rethans, PHP 7.4 release manager and Xdebug author, will tell us all about what's new in 7.4.<br/>Rob Allen, a regular conference speaker who will be taking to us about the making of a great API</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- The La(te)st PHP 7 — What's new in PHP 7.4<br/>Derick Rethans (Release manager for PHP 7.4 and author of Xdebug)</p> <p>We are going to look at the new features in PHP 7.4. Join me to have a look at how the type system is strengthened with typed properties and co- and contra-variance of methods, what changes to operator precedence are, and which new features, such as pre-loading classes, have been added.</p> <p>- The Making of a Great API<br/>Rob Allen</p> <p>Everyone is writing APIs but what makes a great one? I will take you on a tour of the most important features that you should think about when creating an API. These ensure that your API plays well with HTTP and make your API a delight to maintain and work with. Give your API a competitive edge by making it great and developers will want to work with it.</p> <p>What you'll learn from this talk:</p> <p>We will cover the most important things that make up a great API. You will learn:</p> <p>The importance of following the HTTP spec in terms of key parts of RFC7321 along with the how and why of API versioning.<br/>How error handling affects usability of an API and why RC7807 is so useful.<br/>How to document and API<br/>Security and authentication issues.</p> <p>After the talks we'll head somewhere for drinks.</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1583959500,
    "link": "https://www.meetup.com/php-sw/events/268924669/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1583952300,
    "title": "PHP 7.4 and APIs"
}