{
    "description": "<p>You're in for a treat in March, we have 2 huge names in the PHP World speaking...<br/>Derick Rethans, PHP 7.4 release manager and Xdebug author, will tell us all about what's new in 7.4.<br/>Lorna Mitchell, a regular on the conference circuit and a published author, will introduce OpenAPI.</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening, allowing us to have a larger space so more people can attend. Thanks to them!</p> <p>This month's talks are:</p> <p>- Introduction to OpenAPI<br/>Lorna Mitchell (Developer advocate for Nexmo)</p> <p>OpenAPI Specification is a machine and human readable way to describe APIs. From these specs we can generate documentation, libraries, tests, and generally give users the tools they need to know exactly what to expect from our APIs. This talk shows you around OAS from the beginning, demonstrating how to create the specs and recommending some tools to help the process. Once you have the spec, things get much more interesting and this talk will showcase some of the things we can do with an API described this way. Recommended for anyone who cares about APIs and likes shiny new technology.</p> <p>- The La(te)st PHP 7 — What's new in PHP 7.4<br/>Derick Rethans (Release manager for PHP 7.4 and author of Xdebug)</p> <p>We are going to look at the new features in PHP 7.4. Join me to have a look at how the type system is strengthened with typed properties and co- and contra-variance of methods, what changes to operator precedence are, and which new features, such as pre-loading classes, have been added.</p> <p>After the talks we'll head somewhere for drinks.</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have pizza and a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1583959500,
    "link": "https://www.meetup.com/php-sw/events/268924669/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1583952300,
    "title": "PHP 7.4 and OpenAPI"
}