{
    "cancelled": false,
    "description": "<p>For April we're heading online for our first virtual meetup.</p> <p>It's going to be a bit different, but we've still got two great talks and we'll get things set up so people can chat too.<br/>You should be able to get the Zoom link from the location section of this meetup once you're RSVPd</p> <p>So grab your own pizza and a drink and join us for an evening of informative PHP talks.</p> <p>A big thanks to our sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>This month's talks are:</p> <p>- Type Integrity: The Software Engineering Behind Stricter Typing<br/>Stuart Herbert (@stuherbert)</p> <p>Back in January, PHPSW had two great talks from Rob Allen (@akrabat) and Dave Liddament (@daveliddament) on the static analysis tools that the PHP community has built around stricter typing. If you missed them, you can check them out here: <a href=\"https://joind.in/event/phpsw-jan-2020\" class=\"linkified\">https://joind.in/event/phpsw-jan-2020</a>.</p> <p>But what is \"stricter typing\"? What problems does it solve, and how do you use it to solve them?</p> <p>In this talk, Stuart will introduce you to the fundamental principles involved. He'll show you the basics of \"robustness\" and \"correctness\" in your software engineering, the costs of tackling those using defensive programming and Design by Contract(™), and how to use stricter typing to bring those costs right down.</p> <p>Although the examples are written in PHP, these are basic principles that apply to all software. You don't have to be a PHP programmer to get something out of this talk.</p> <p>- Data Intensive Applications in PHP<br/>Doug Fitzmaurice</p> <p>Programming is easy until you have to deal with data. We'll review the Designing Data Intensive Applications book, which covers different types of database, the ways to use them, and how to combine them into a complete distributed system for handling data with fewer headaches.<br/>I'll show you how I applied some of the concepts and pattern from this book in PHP in an application that cleanly handles multiple messy data sources.</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://join.slack.com/t/phpsw/shared_invite/zt-d7uzg28m-LhcVTOCaC_JB8xB~LwhE2w\" class=\"linkified\">https://join.slack.com/t/phpsw/shared_invite/zt-d7uzg28m-LhcVTOCaC_JB8xB~LwhE2w</a></p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm, but will keep chat going for a further couple of hours.</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event. We're aware of some of the concerns about it, but we were struggling to find a perfect solution.<br/>We wanted something that was friction free to join (no registration), allowed for some control over chat, but was also something people were familiar with.</p> <p>Once the link is available, you'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1586376000,
    "link": "https://www.meetup.com/php-sw/events/269729571/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1586368800,
    "title": "Type Integrity & Intensive Data (Online)"
}