{
    "cancelled": false,
    "description": "<p>For May we're going to be online again for our meetup.</p> <p>It's going to be a bit different, but we've still got two great talks and we'll get things set up so people can chat too.<br/>We're going to be using Zoom for the event - the link will be added a couple of days beforehand</p> <p>So grab your own pizza and a drink and join us for an evening of informative security talks.</p> <p>A big thanks to our sponsors SR2 (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>), Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>This month's talks are:</p> <p>- Don’t Fear The OAuth<br/>Ian Littman (@iansltx)</p> <p>Don’t know the difference between a grant type and an auth code? Know the difference but not sure how to implement OAuth 2.0 in your own application? In this talk I’ll start with OAuth 2.0 basics, then jump into implementation details using The PHP League’s oauth2-server library.</p> <p>- Talk to be Confirmed<br/>Marcus Bointon (@synchrom)</p> <p>Details coming soon!<br/>--</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://slack.phpsw.uk\" class=\"linkified\">https://slack.phpsw.uk</a><br/>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm, but will keep chat going for up to a couple of hours or until</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event. We're aware of some of the concerns about it, but we were struggling to find a perfect solution.<br/>We wanted something that was friction free to join (no registration), allowed for some control over chat, but was also something people were familiar with.</p> <p>You'll find the link for the webinar under the location section of this event from a couple of days before. You'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.<br/>On joining you will be asked for an email address. We're not messaging attendees etc. so this can be a non-real address.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1589400000,
    "link": "https://www.meetup.com/php-sw/events/270428519/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1589391900,
    "title": "Lockdown Security (Online)"
}