{
    "cancelled": false,
    "description": "<p>For June we're going to be online again for our meetup.</p> <p>We've got two great talks lined up for June as we take a look at the environmental impact of the sites we build and a deep dive on getters &amp; setters.<br/>We're going to be using Zoom for the event - the link will be added a couple of days beforehand</p> <p>So grab your own pizza and a drink and join us for an evening of informative security talks.</p> <p>A big thanks to our sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>This month's talks are:</p> <p>- Tools and techniques to reduce the impact of the tech you are responsible for<br/>Hannah Smith (@hanopcan)</p> <p>Did you know that the internet is thought to produce about the same carbon emissions as the aviation industry’s fuel consumption? And if the internet was a country it would be the sixth biggest polluter in the world. Shocking isn’t?</p> <p>Tech provides wonderful opportunities to find ways to reduce our carbon emissions, but in itself has a significant environmental cost, which most of us aren’t conscious of.</p> <p>In this talk we’ll discuss why &amp; how tech and building websites has an environmental impact. We’ll look at tools and techniques you can use to lessen your impact, whether you are responsible as a developer, designer or content creator. And of course, not only do these tools and techniques help your green credentials, they nearly always result in better performance and better user experiences too.</p> <p>- Get, Set ... STOP!<br/>Zvonimir Spajic (@konrad_126)</p> <p>Wikipedia defines Cargo cult programming as \"Ritual inclusion of code or program structures that serve no real purpose.\"</p> <p>One behaviour, deeply embedded into the hearts and minds of many software developers is the creation of getters and setter on entities. It' so widespread that IDEs have tools to do it automatically.</p> <p>Why do we do it? Does it serve some purpose or is it just a cargo cult programming ritual?</p> <p>--</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>This month, we're going to look at opening up the zoom conversation after the talks for anyone to be able to chat etc.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://slack.phpsw.uk\" class=\"linkified\">https://slack.phpsw.uk</a><br/>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish at ~9pm, but will keep chat going for up to a couple of hours or until</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event.</p> <p>You'll find the link for the webinar under the location section of this event from a couple of days before. You'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.<br/>On joining you will be asked for an email address. We're not messaging attendees etc. so this can be a non-real address.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only until after the talks.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1591819200,
    "link": "https://www.meetup.com/php-sw/events/270992548/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1591811100,
    "title": "Set Your Impact (Online)"
}