{
    "cancelled": false,
    "description": "<p>For October we will answer the question \"Are you a modern software engineer\" and show you the journey from Developer to Architect.</p> <p>We're going to be using Zoom for the event - the link will be added a couple of days beforehand.</p> <p>So grab your own pizza and a drink and join us for an evening of informative talks.</p> <p>A big thanks to our sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>- Are you a modern software engineer?<br/>Rajkumar Sakthi (@rajkumarsakthi)</p> <p>In a modern world with so many different ways to build web applications, how do we keep up with the latest trend, let alone know which one should we use?</p> <p>With all these choices, it can be easy to start off on the wrong foot or to be put off from exploring other options besides what we are used to working with.</p> <p>In this talk I want to explore the best practices we have when building the foundations of our projects.</p> <p>I’m not looking to make you a Coding Ninja, but having an understanding of each of these, along with the benefits each can bring, can help you and your team making the right decisions for the project you are creating and ensure a smoother project lifecycle.</p> <p>- The journey from Developer to Architect<br/>Mark Taylor (@willcodeforale)</p> <p>Developers come to a cross roads at a certain point in their career. Do you stay as a developer, move towards management, consultancy, or maybe architecture? I chose the path of the architect, and my talk will be a story of my journey. I'll also delve into the different types of architect, and what the main differences are between an architect and a developer.</p> <p>--</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>Once the talks are finished, we'll open up the meeting so that everyone who wants to can turn on their cameras and microphones to join in the conversation.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://slack.phpsw.uk\" class=\"linkified\">https://slack.phpsw.uk</a></p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We have our second talk<br/>* We finish talks at ~9pm, but will keep the event going till 10pm so you can join in the conversation</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event.</p> <p>You'll find the link for the webinar under the location section of this event from a couple of days before. You'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.<br/>On joining you will be asked for an email address. We're not messaging attendees etc. so this can be a non-real address.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only until after the talks.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1602705600,
    "link": "https://www.meetup.com/php-sw/events/273564199/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1602697500,
    "title": "Journeys in software"
}