{
    "cancelled": false,
    "description": "<p>It's our first meetup of 2021 and we're looking forward to getting everyone back together again (virtually) for some interesting talks.</p> <p>We're going to be using Zoom for the event - the link will be added a couple of days beforehand.</p> <p>So grab your own pizza and a drink and join us for an evening of informative talks.</p> <p>A big thanks to our sponsors SR2 (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>), Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>Our talks are:</p> <p>- The First Contact<br/>Andreas Heigl (@heiglandreas)</p> <p>So you did a great job with your website and now your customers want to get into contact with you. They actually want give you their holy grail and apply for a login. And that's where it usually starts to go south. So many things can go wrong with a registration form that your customer doesn't really feel welcome or safe. In this session we will debug a few real-life examples from a user-experience Point of View. By analysing that we will find ways to make the first contact of a user with our application a better experience. And you don't need to be a coder to see why and how to improve your next registration form.</p> <p>+ You? We've got a slot for 1 lightning talk, so get in touch if you're interested in speaking. Talks are ~10mins and can be about PHP or any of the supporting ecosystem.</p> <p>--</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>Once the talks are finished, we'll open up the meeting so that everyone who wants to can turn on their cameras and microphones to join in the conversation.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://slack.phpsw.uk\" class=\"linkified\">https://slack.phpsw.uk</a></p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have the talks<br/>* We finish talks at ~8:30pm, but will keep the event going till 9pm (or beyond) so you can join in the conversation</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event.</p> <p>You'll find the link for the webinar under the location section of this event from a couple of days before. You'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.<br/>On joining you will be asked for an email address. We're not messaging attendees etc. so this can be a non-real address.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only until after the talks.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>), BookingLive (<a href=\"https://www.bookinglive.com/\" class=\"linkified\">https://www.bookinglive.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1610571600,
    "link": "https://www.meetup.com/php-sw/events/275572935/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1610563500,
    "title": "Surviving First Contact"
}