{
    "cancelled": false,
    "description": "<p>We're back virtually for April and this month we'll be having an introduction to mental health and taking a look at the serverless LAMP stack.</p> <p>We're going to be using Zoom for the event - the link will be added a couple of days beforehand.</p> <p>So grab your own pizza and a drink and join us for an evening of informative talks.</p> <p>A big thanks to our sponsors SR2 (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>), Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>Our talks are:</p> <p>- Introducing the serverless LAMP Stack<br/>Ben Smith, Senior Developer Advocate, AWS Serverless</p> <p>AWS Lambda, Amazon API Gateway, MySQL, PHP - it’s LAMP but not as you know it. In this session, Ben will show why there has never been a better time to build serverless applications with PHP.<br/>Using this new LAMP stack to build serverless applications allows PHP developers to benefit from the agility and scalability enabled by the serverless paradigm, all without needing to manage servers.</p> <p>He’ll demo how to get started running your PHP code using functions as a service. You’ll learn how to connect to databases at scale with spiky workloads, and continue to use your favourite libraries and tools, without impacting performance or availability.<br/>Learn how to become a serverless PHP developer, and use the world’s most popular web runtime to build scalable, agile apps without the server management.</p> <p>Ben Smith is a Senior developer advocate at AWS with a passion for serverless, automation and web development. With his AWS blog series on “The serverless LAMP stack”, Ben is especially interested in making serverless technologies more accessible for PHP developers.</p> <p>--</p> <p>Mental Health – Time to drop the stigma<br/>Natalie Sidwick, Delivery Consultant, SR2</p> <p>An introduction to Mental Health and the ways in which we can look after our own Mental Health, as well as supporting others.</p> <p>--</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>Once the talks are finished, we'll open up the meeting so that everyone who wants to can turn on their cameras and microphones to join in the conversation.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://slack.phpsw.uk\" class=\"linkified\">https://slack.phpsw.uk</a></p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our lightning talk<br/>* At ~7:20pm we'll have our main talk<br/>* We finish talks at ~8:30pm, but will keep the event going till 9pm (or beyond) so you can join in the conversation</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event.</p> <p>You'll find the link for the webinar under the location section of this event. You'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.<br/>On joining you will be asked for an email address. We're not messaging attendees etc. so this can be a non-real address.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only until after the talks.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1618430400,
    "link": "https://www.meetup.com/php-sw/events/277289077/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1618422300,
    "title": "The Serverless LAMP Stack"
}