{
    "cancelled": false,
    "description": "<p>We're back virtually for July and this month we'll be taking a look at developer culture</p> <p>We're going to be using Zoom for the event - the link will be added a couple of days beforehand.</p> <p>So grab your own pizza and a drink and join us for an evening of informative talks.</p> <p>A big thanks to our sponsors SR2 (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>), Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) who are supporting us and are helping make the virtual event happen.</p> <p>Our talks are:</p> <p>- The Humble Developer Culture<br/>Rob Waller (@robdwaller)</p> <p>Culture is fundamental to the success of a software development team, a positive culture can lead to great success, but a negative culture can result in unhappy developers and bad software. The question is, what culture should you and your team adopt?</p> <p>This talk will focus on the Humble Developer Culture and how it can benefit you, your team and your software. It will explain what it means to be a humble developer and how this stands opposed to negative stereotypes such as the rockstar or 10x developer. It will highlight how the humble approach will improve team cohesion, developer wellness and software quality. And it will cover what software development techniques and approaches align with the humble developer culture.</p> <p>- A Lightning Talk?<br/>If you're interested in giving a lightning talk (only needs to be 10 minutes or less), then please let us know</p> <p>--</p> <p>Unfortunately we can't head anywhere afterwards for a drink, but we'll keep the chat going so that you can chat with each other.</p> <p>Once the talks are finished, we'll open up the meeting so that everyone who wants to can turn on their cameras and microphones to join in the conversation.</p> <p>You can also join us in Slack any time, just head to <a href=\"https://slack.phpsw.uk\" class=\"linkified\">https://slack.phpsw.uk</a></p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>It's going to be a bit different this month as we're all online, but we expect the night to roughly run as:</p> <p>* From about 6:45 you should be able to join the event.<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our lightning talk<br/>* At ~7:20pm we'll have our main talk<br/>* We finish talks at ~8:30pm, but will keep the event going till 9pm (or beyond) so you can join in the conversation</p> <p>--<br/>How is this online thing going to work?</p> <p>We've decided to use Zoom to host the event.</p> <p>You'll find the link for the webinar under the location section of this event. You'll be able to access the event from the start time and it will prompt you to install a client if you wish/need to. There is also a web client available.<br/>On joining you will be asked for an email address. We're not messaging attendees etc. so this can be a non-real address.</p> <p>Note: We will be restricting video and screen sharing to hosts and speakers only until after the talks.</p> <p>Please be aware that our code of conduct (<a href=\"https://phpsw.uk/code-of-conduct\" class=\"linkified\">https://phpsw.uk/code-of-conduct</a>) still applies.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1626292800,
    "link": "https://www.meetup.com/php-sw/events/279316554/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "phpsw",
    "start_time": 1626284700,
    "title": "Developer Culture"
}