{
    "cancelled": false,
    "description": "<p>What's this? An in person meetup?</p> <p>That's right, we're returning to in person meetups in November!</p> <p>We've got one talk scheduled (details to follow), plus space for a lightning talk if anyone wishes to volunteer. We're leaving plenty of time available for networking and speaking with others again though.</p> <p>--</p> <p>Please see the information further below for the covid measures we're putting in place.<br/>If you do have any queries about this, please contact us and we'll advise accordingly.</p> <p>At this stage we're unsure if we're going to offer pizza or not. When RSVPing, there is the option to answer a question on whether you would feel comfortable with shared pizzas - please let us know and we'll make a decision closer to the date.</p> <p>--</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening. Thanks to them!</p> <p>This month's talks are:</p> <p>- A talk from Rob Allen (TBC)</p> <p>- If you're interested in giving a lightning talk, please let us know,</p> <p>After the talks we'll head somewhere for drinks.</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We'll have a lightning talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1636578000,
    "link": "https://www.meetup.com/php-sw/events/281833825/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1636569900,
    "title": "Lets Meet in Person!"
}