{
    "cancelled": false,
    "description": "<p>After the Omicron blip we're running another in person meetup in Feb!</p> <p>We've got a talk about coding with confidence using PHPStan, plus space for a lightning talk if anyone wishes to volunteer. We're leaving plenty of time available for networking and speaking with others again though.</p> <p>--</p> <p>Covid precautions: We're asking everyone to take a lateral flow test before attending the event, and only attend if negative. We also strongly encourage the use of masks.<br/>If you do have any queries about this, please contact us and we'll advise accordingly.</p> <p>--</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening. Thanks to them!</p> <p>This month's talks are:</p> <p>- Code with confidence using PHPStan<br/>(Peter Fisher)</p> <p>With new projects starting on PHP 8 and the increasing use on data types and upgrades that PHP 8 brings, the use of static analysis has become increasingly popular. PHPStan has recently released version 1 which includes stricter checks and a pro version that offers more versatility. For new projects, the use of static analysis is a great tool to keep fresh code clean and confirmative, but how can static analysis be used on legacy projects and how can PHPstan increase our confidence when building upon our code bases?</p> <p>- If you're interested in giving a lightning talk, please let us know,</p> <p>After the talks we'll head somewhere for drinks.</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:<br/>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At ~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At ~8:10pm We'll have a lightning talk<br/>* We finish at ~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1644440400,
    "link": "https://www.meetup.com/php-sw/events/283490357/",
    "location": null,
    "org": "phpsw",
    "start_time": 1644432300,
    "title": "Coding With Confidence"
}