{
    "cancelled": false,
    "description": "<p>PHP-SW return for another in real life event on Wednesday 9th March.</p> <p>We've got 3 talks to cover off where ever you are in your PHP journey.</p> <p>Things you should know about PHP (TBC)<br/>\\- Oliver Davis<br/>An introduction to PHP and the wider eco system.</p> <p>--<br/>AssertTrue(isDecoupled(\"MyTests\"))<br/>\\- Dave Liddament</p> <p>We all know why tests are great. But every once in a while we just wish they’d never been written. One case when test regret occurs is when we want to alter our functionality slightly but in doing so half the test suite goes from green to red.<br/>This talk will investigate why this happens. In particular it looks at the coupling between tests and the code under test. We’ll investigate ways we can reduce this coupling and make out test suites more resilient to change.</p> <p>--<br/>State of the recruitment market<br/>\\- Doug Gear<br/>Everyone is looking for developers. Doug will give an overview of the current market and useful tips for finding the right role.</p> <p>--<br/>Covid precautions: We're asking everyone to take a lateral flow test before attending the event, and only attend if negative. We also strongly encourage the use of masks.<br/>If you do have any queries about this, please contact us and we'll advise accordingly.</p> <p>--</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening. Thanks to them!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:</p> <p>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At \\~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At \\~ 7:50pm we'll have our second talk<br/>* At \\~8:40pm We'll have a lightning talk<br/>* We finish at \\~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1646859600,
    "link": "https://www.meetup.com/php-sw/events/284341510/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1646851500,
    "title": "Your PHP Journey"
}