{
    "cancelled": false,
    "description": "<p>We've got 2 big name speakers for July's in person meetup on Wednesday 13th July at Runway East...</p> <p>### Auth 101</p> <p>Katy Ereira</p> <p>Auth; almost every application employs it. From verifying that a user is who they say they are, to restricting access to a protected resource. If your application isn’t secure, there’s a lot to lose. Let’s learn the difference between authentication and authorisation, and the best ways to implement them.</p> <p>### From Betamax to VCR: harden your API integration testing</p> <p>James Seconde</p> <p>This talk comes from inheriting a complete, widely used open source PHP API library. It’s complete in that it has a full test suite, but problems arise from the approach of mocking JSON responses to assert tests on. The responses have to be maintained, and that can inevitably lead to false positives if the underlying API changes without the maintainer being notified. You can be clever and use a git submodule to bring in a standardised response that can be used by the same library in other languages, but then you need someone to maintain that across various departments of engineering. A chat with my colleague who is the resident Ruby library developer revealed that VCR has been used across the Ruby world for years. Why hadn’t I come across this approach, after years of PHP development (and specifically API testing work)? My passion is for expressive, self-documenting code. After all, it’s what I do in my current role: I advocate for the PHP developer community, and PHP developers are the ones that I maintain that library for. VCR plus integration with the PEST testing framework gives that readability we should strive for - it helps developers understand what your code is doing with responses. But the biggest thing here is the ability to trigger a record when something upstream changes. If someone pushes out a change to the OpenAPI specification, you can get a webhook to trigger a build on your library. The response is different, something has been removed or added, and your test suite fails. A test written in PEST, so highly readable. If you’re a new developer on the project, you’re being told what needs fixing, and that is a story that needs telling.</p> <p>--</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening. Thanks to them!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:</p> <p>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At \\~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At \\~ 7:50pm we'll have our second talk<br/>* We finish at \\~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1657742400,
    "link": "https://www.meetup.com/php-sw/events/286628727/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1657734300,
    "title": "Auth 101 & Harden your API testing"
}