{
    "cancelled": false,
    "description": "<p>We return from our summer break with a brand new talk from Ciaran McNulty</p> <p>### Behaviour Driven Design (BDD) in Practice</p> <p>Ciaran McNulty</p> <p>We will look in-depth at a typical Behaviour Driven Development workflow, travelling from stakeholder conversation, through to active development and test automation.</p> <p>Ciaran is a developer, trainer and coach, as well as a maintainer of Behat and Cucumber</p> <p>--</p> <p>If you'd like to give a lightning talk (5-15min) talk please let us know.</p> <p>--</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening. Thanks to them!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:</p> <p>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At \\~7:10pm we'll have our first talk<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At \\~ 8:00pm we'll have any lightning talks<br/>* We finish at \\~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1663185600,
    "link": "https://www.meetup.com/php-sw/events/287901117/",
    "location": null,
    "org": "phpsw",
    "start_time": 1663177500,
    "title": "Behaviour Driven Design (BDD) in Practice"
}