{
    "cancelled": true,
    "description": "<p>They were popular last time, so we've returned with more Lightning Talks for October</p> <p>We're back at Runway East for another in person meetup. So far we have...</p> <p>API strategies for Single Page Apps<br/>\\- Chris</p> <p>My evolution from a framework builder to a PHP developer<br/>\\- Ashley Adams</p> <p>Composer 2.4<br/>\\- Tom Borealis</p> <p>Introducing Static Analysis Results Baseliner<br/>\\- Dave Liddament</p> <p>\\- And a talk from you?<br/>We've space for more lightning talks, so get in touch if you want to give one.</p> <p>--</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) in Bristol are kindly helping us host this evening. Thanks to them!</p> <p>--<br/>Your first time coming to PHPSW? Welcome!</p> <p>Here's how the evening tends to run:</p> <p>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At \\~7:10pm we'll do the first half of our lightning talks<br/>* After our first talk, there's a small break whilst we switch over speakers<br/>* At \\~ 7:50pm we'll have the rest of our lightning talks<br/>* We finish at \\~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy.</p> <p>--<br/>As always, a big thanks to our meetup sponsors Ents24 (<a href=\"http://www.ents24.com/\" class=\"linkified\">http://www.ents24.com/</a>), Brightpearl (<a href=\"http://www.brightpearl.com/\" class=\"linkified\">http://www.brightpearl.com/</a>) &amp; OneSub (<a href=\"https://onesub.io/\" class=\"linkified\">https://onesub.io/</a>) without whom we wouldn't be able to put on our meetups.</p> ",
    "end_time": 1665604800,
    "link": "https://www.meetup.com/php-sw/events/288911961/",
    "location": null,
    "org": "phpsw",
    "start_time": 1665596700,
    "title": "Lightning Talks"
}