{
    "cancelled": false,
    "description": "<p>In November we're running another Lightning Talks night! We currently have four speakers confirmed, who will be speaking on a particular topic for 5-20 minutes each. It's a great way to find out about a range of topics and ideas in a short space of time! There will typically be a diverse range of talks, but all will be of interest to those using or learning PHP.</p> <p>Currently confirmed speakers include:<br/>Dan Leech - \"Building Better TUIs (with PHP)\"<br/>Craig Francis - \"PHP, bcrypt cost, and null coercion\"<br/>Rob Allen - (title TBC)<br/>Mike Karthauser - \"What 4 words\" (TBC)<br/>Oliver Davies - \"Building 'Build Configs'\"</p> <p>**If you'd like to give a talk**, then we'd love you to get in touch. You can talk about anything related to PHP or the wider ecosystem (talks can be between 5 and 20 minutes long). If you've never given a talk with us, this is the perfect time to get started - we're a supportive audience! Just drop us a message.</p> <p>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) are kindly helping us host this evening. Thanks to them!</p> <p>Your first time coming to PHPSW? Welcome!<br/>Here's how the evening tends to run:</p> <p>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At \\~7:10pm we'll start our talks<br/>* We finish at \\~8:30pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy. 🐘</p> ",
    "end_time": 1699477200,
    "link": "https://www.meetup.com/php-sw/events/296917370/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1699469100,
    "title": "⚡ Lightning Talks Night"
}