{
    "cancelled": false,
    "description": "<p>Join us for PHPSW in July where we've got a couple of great talks lined up...</p> <p>**DDD and Transitional Architecture**<br/>\\- Simon Wallington</p> <p>Simon will share ideas and patterns that can be used to migrate away from a complex legacy system, while still releasing iteratively.</p> <p>**PHP + Static = Phanstatic**<br/>\\- Tamas Erdelyi</p> <p>You don’t need a CMS or a progressive JavaScript framework to create your own blog. Welcome to Phanstatic, a small side project of Tamas Erdelyi and yet another static site generator written in pure PHP.</p> <p>In his talk, Tamas will remind us why the size of websites still matters in 2024. He will also demonstrate how to build and deploy blogs and microsites using this command-line PHP package by creating just a few files and folders. No need to step out of your PHP comfort zone or worry about a new template engine syntax!</p> <p>\\-\\-\\-\\-<br/>SR2 – Socially Responsible Recruitment (<a href=\"https://www.sr2rec.co.uk/\" class=\"linkified\">https://www.sr2rec.co.uk/</a>) are kindly helping us host this evening. Thanks to them!</p> <p>Your first time coming to PHPSW? Welcome!<br/>Here's how the evening tends to run:</p> <p>* Feel free to turn up from 6:30pm.<br/>* We'll have a selection of soft drinks &amp; alcoholic drinks available from about 6:45pm, all free of charge thanks to our sponsors. It's a great chance to speak to people (we're a friendly bunch!) and do a bit of networking. Just speak to an organiser if you'd like an introduction to people, or just dive in and say \"hello!\".<br/>* At 7pm, we'll do a quick welcome talk and some community announcements<br/>* At \\~7:10pm we'll start our talks<br/>* We finish at \\~9pm. We always go for a drink somewhere afterwards to discuss the talks and anything else that takes your fancy. 🐘</p> ",
    "end_time": 1720639800,
    "link": "https://www.meetup.com/php-sw/events/301945171/",
    "location": {
        "address": "1, Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.453147888183594,
        "longitude": -2.5912439823150635,
        "name": "Runway East"
    },
    "org": "phpsw",
    "start_time": 1720632600,
    "title": "DDD and Transitional Architecture / PHP + Static = Phanstatic "
}