{
    "cancelled": false,
    "description": "<p>18:30 - arrive. Beers, pizza, networking</p> <p>18:50 first talk delivered by Jorge Marin (former @bitnami) Jorge will talk about the idea of using disposable containers in the cloud as remote development environments. It will cover the journey of setting up individual remote development environments for a whole engineering team based on the cloud using containers. Advantages, issues, limitations and more.</p> <p>19:20 second talk delivered by Nat from Netflix!</p> <p>Nat will explain in detail how Netflix delivers streaming contents to millions of users daily, resulting in 15% of all internet traffic. Also describing their own in-house CDN \"Open Connect\" and how their AWS presence is one of the largest in the world. Netflix is famous for its culture of \"Freedom and Responsibility\".</p> <p>--- Nat's bio ---</p> <p>Nat (<a href=\"https://nat.ms\" class=\"linkified\">https://nat.ms</a>) has been at Netflix (<a href=\"https://netflix.com\" class=\"linkified\">https://netflix.com</a>) for over 3 years and has written many of their network configuration and automation toolsets from the ground up. He works from home on a farm in rural Pembrokeshire. Before joining Netflix he managed the DevOps customer engineering team for Cumulus Networks a Silicon Valley-based networking startup. Prior to that, he consulted for a variety of UK FTSE100 organisations and government organisations. He began his career in 1998 migrating customers from Netware to NT4.</p> <p>He is passionate about Python, distributed systems, network automation, rural networks, and border terriers. He runs an extensive home network that spans over 50 miles, providing gigabit internet to his neighbours and other locals. Over the past couple of years, he has spent many weekends stood in fields, laying miles of fibre ducting in the ground.</p> <p>He was previously a director of UKNOF, a trade forum for UK internet service providers. He also volunteers at a local CodeClub group teaching primary school students.</p> ",
    "end_time": 1548880200,
    "link": "https://www.meetup.com/bristol-cloud-native-devops/events/256999575/",
    "location": null,
    "org": "Cloud-Native-DevOps",
    "start_time": 1548873000,
    "title": "'Freedom & Responsibility' - Cloud Native & DevOps talks - Netflix"
}