{
    "cancelled": false,
    "description": "<p>Address: ADP, 10 Temple Back Bristol</p> <p>19:00 - 19:25: food, drink, networking</p> <p>19:30: Ali Asad Lotia and Dan Mitchell from Equal Experts will give a talk on \"Superpowers have finally come to Linux\"</p> <p>Blurb<br/>So said Brendan Gregg who daily forgets more about Operating Systems and performance tuning than most of us will ever know. (Source of quote <a href=\"https://lwn.net/Articles/740157/\" class=\"linkified\">https://lwn.net/Articles/740157/</a> indicating that he said this during his talk at linux.conf.au 2017)</p> <p>As our systems have gotten more complex they have become increasingly harder to observe and secure. The Linux extended Berkeley Packet Filter (eBPF) and associated tooling provides a whole new bag of tricks to help us get a handle on some of this complexity. In this talk we'll provide and overview of eBPF and do some demos that you may find useful. At the very least, you'll see that the Linux kernel does have superpowers.</p> <p>20:10: Keith Edmunds, MD of Tiger Computing, will give a talk on how he built his business, a tech company focused on Linux support and consultancy services.</p> <p>Synopsis:</p> <p>In 2002, I started Tiger Computing, a business that provides Linux support and consultancy services. We also - as one would expect - run our business on Linux. This is the story of how we built up a half million pound business on Linux. I'll talk about the highs and lows, the tools we use, and show some insight to the commercial use of Linux. I'll also have some copies of my book, The Linux Solution, and who knows, I may even give one or two copies.</p> <p>About Keith Edmunds:</p> <p>I've been working in the IT industry since 1980, initially repairing hardware before moving on to a consultancy role. In 2002, I set up Tiger Computing to help businesses make the most of Linux. Over the years I've worked with Citibank, Birds Eye Walls, Unilever, Ericsson plus a host of bioscience companies. In March 2019, my book \"The Linux Solution\" was published.</p> ",
    "end_time": 1556136000,
    "link": "https://www.meetup.com/Bristol-Cloud-Native-DevOps/events/260243422/",
    "location": null,
    "org": "Cloud-Native-DevOps",
    "start_time": 1556128800,
    "title": "Talks - \"Superpowers have finally come to Linux\" & Building a business on Linux"
}