{
    "cancelled": false,
    "description": "<p>19:00 arrive</p> <p>19:00 - 19:20 - refreshments &amp; networking</p> <p>19:30 Justyn Roberts, Senior Solutions Architect at Instana, will give a talk on 'Monitoring and Observability: Why microservices present a unique set of observability challenges'</p> <p>He will talk a little about the history of major app architectures, and how you cannot apply traditional techniques to todays observability requirements. Why pages of metrics are complex, and modern architectures move too quickly for a human to comprehend.<br/>How he's working with a combination of real knowledge, dependency mapping and machine learning to understand signals for troubleshooting, alerting and optimising microservices.</p> <p>20:00 Joshua Van Leeuwen will give a talk on 'kube-oidc-proxy: Reclaiming lost features moving to managed Kubernetes'</p> <p>Blurb:<br/>Provisioning and managing Kubernetes clusters has become much easier with services such as GKE, EKS and AKS. However, there is a trade-off for this convenience, with less opportunity for customisation with a managed control plane - including authentication to third-party systems. This is made all the more difficult with multi-cloud Kubernetes where you are locked into cloud IAM without any consistency and feature parity.</p> <p>In this talk, I'll explain authn/z in Kubernetes and how to use OIDC for<br/>authentication. With our newly open source and experimental tool, I'll show how we can help bring parity in authentication and authorization across clouds with an OIDC proxy for the Kubernetes API server.</p> <p>Bio;<br/>I'm a Solutions Engineer at Jetstack, a solely Kubernetes focused company providing consultancy, training, and contributing to the open-source. I've been working for Jetstack since toward the end of my university degree and am coming up to a year as a full time employee.</p> ",
    "end_time": 1559160000,
    "link": "https://www.meetup.com/Bristol-Cloud-Native-DevOps/events/260908762/",
    "location": {
        "address": "1 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45319747924805,
        "longitude": -2.590938091278076,
        "name": "Runway East Bristol"
    },
    "org": "Cloud-Native-DevOps",
    "start_time": 1559152800,
    "title": "'Monitoring & Observability' & 'Kube-oidc-proxy: Reclaiming features'"
}