{
    "description": "<p>--- thanks to Scott Logic for hosting and providing refreshments ---</p> <p>18:30 - arrive, mingle, eat food and drink</p> <p>19:00 - first talk from Jose Navarro at Cookpad on 'Using the power of Kubernetes to run distributed and parallel hyperparameters tunning jobs'</p> <p>Abstract:</p> <p>In Machine Learning, hyperparameters optimisation is the process of searching a set of hyperparameters that optimises a given model for a particular task.</p> <p>As a Machine Learning Infrastructure engineer, one of my responsibilities is to make life easier for ML researchers finding and testing tools that could potentially optimise laborious processes. In my talk, I will present the journey from running these jobs locally or through cloud instances to finally use Cloud Native tools to distribute and parallelise them on Kubernetes.</p> <p>Jose Navarro is a Machine Learning Infrastructure Engineer making everyday cooking fun at Cookpad, where its recipe platform has more than 40 million monthly users. He holds a MSc in Machine Learning and High Performance Computing from the University of Bristol. He is interested in Cloud Native technologies, serverless, and event-driven architecture. When his daughter was 6 months old, he thought that it was a great idea to also adopt a 6 month old puppy. He was wrong, but now it is OK (sometimes).</p> <p>19:35 - 20:05 - second talk from Matt Jarvis on 'KUDO: universal operators for K8S'</p> <p>Kubernetes Operators are the next phase of the journey towards automating complex applications in containers. The KUDO project introduces an easy way to build Kubernetes operators using declarative YAML. Many Operators that exist today handle initial deployment, but they don’t provide automation for tasks like binary upgrades, configuration updates, and failure recovery. Implementing a production-grade controller for a complex workload typically requires thousands of lines of code and many months of development. As a result, the quality of operators that are available today varies. The KUDO project provides a universal operator to enable automated creation of operators for Kubernetes, in most cases just using YAML. In this talk, I’ll introduce the KUDO project, and demo the creation of a Kubernetes operator using KUDO.</p> <p>// About Matt</p> <p>Matt Jarvis is Senior Director of Community and Evangelism at D2iQ ( formerly Mesosphere). Matt has spent more than 15 years building products and services around open source software, on everything from embedded devices to large scale distributed systems. Most recently he has been focused on the open cloud infrastructure space, and in emerging patterns for cloud native applications.</p> ",
    "end_time": 1585254600,
    "link": "https://www.meetup.com/Bristol-Cloud-Native-DevOps/events/269001335/",
    "location": {
        "address": "1 Redcliff Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.452877044677734,
        "longitude": -2.590496063232422,
        "name": "Scott Logic"
    },
    "org": "Cloud-Native-DevOps",
    "start_time": 1585247400,
    "title": "DevOps & cloud native talks - leveraging the power of Kubernetes"
}