{
    "cancelled": false,
    "description": "<p>Welcome to the second edition of Cloud Natives UK taking place on May 6th. This is a joint virtual event being put together by the Cloud groups in Manchester, Wales, Glasgow, Edinburgh that now incorporates the brilliant Bristol community as well. Together we represent nearly 5000 people from cloud-native communities across the UK.</p> <p>We’re really pleased to welcome our very special guest Justin Garrison, who’ll be joining us live from Los Angeles. Justin is a Developer Advocate at AWS where he helps improve container services for everyone. In the past he has helped make Oscar winning movies, built infrastructure for Disney+, and has been active in open source for a long time. Justin is the author of Cloud Native Infrastructure ( <a href=\"https://www.amazon.co.uk/Cloud-Native-Infrastructure-Justin-Garrison/dp/1491984309\" class=\"linkified\">https://www.amazon.co.uk/Cloud-Native-Infrastructure-Justin-Garrison/dp/1491984309</a> ), a great contributor to the Cloud Native community, and a fantastic speaker.</p> <p>Justin’s talk will be:</p> <p>“I learned containers solve problems with repeatable, isolated application deployments. Now individual applications aren’t a problem and my environment is much more complex. Containers has proven to be the little standard that could adapt. No matter if you’re new to containers or an experienced user we’ll look at how containers are used for packaging more than traditional web apps.”</p> <p>In addition to Justin, we’ve also got some phenomenal lightning talks lined up from speakers across the UK Cloud Native communities:</p> <p>“An open source way to manage significant scaling needs in Kubernetes” - Andreas Krivas - Engineering Manager at Container Solutions</p> <p>How often can we comfortably, timely and reliably scale a whole microservices platform in Kubernetes without anticipating crashed pods or broken connections? This is even worse when we anticipate high peak load where we need everything to be up and running in seconds.</p> <p>To address this problem, we decided to build an open source Kubernetes operator which scales multiple applications together in anticipation of higher load. It achieves that by defining a platform state and ensuring that all applications are scaled in a controlled, declarative and secure way. In this talk, we’ll go more into the idea behind the operator and explain its working principles.</p> <p>“Cloud Native Bare Metal” - Dan Finneran, Senior Manager - Developer Relations, Equinix Metal</p> <p>Abstract TBC</p> <p>“Do I need to backup my Kubernetes app running in the Public Cloud?” - Kevin Jackson, Trilio</p> <p>Running Kubernetes applications on public cloud infrastructure means I don’t have to worry about backup, right? The cloud providers SLAs cover this, right? Wrong. Most cloud providers offer additional services to accommodate recovery strategies, but careful scrutiny of these services will reveal pros and cons to these approaches. By taking a cloud-native, Kubernetes-first approach, will give you the ultimate control and flexibility of your backups regardless of where your Kubernetes deployments live. In this lightning talk by Kevin Jackson from Trilio, you can manage your backup strategy to encompass DR and migration of complex applications beyond the walls of your cloud provider.</p> <p>We’ve got some questions up our sleeves that we’ll be asking, but we’d also love to have your questions that you’d like us to put to Justin, or to any of the panelists. Let us know on any of the usual channels and we’ll send you some free swag!</p> <p>The event will be live-streamed to YouTube so RSVP to grab the link.</p> ",
    "end_time": 1620327600,
    "link": "https://www.meetup.com/bristol-cloud-native-devops/events/277828414/",
    "location": null,
    "org": "Cloud-Native-DevOps",
    "start_time": 1620320400,
    "title": "Cloud Natives UK - with special guest Justin Garrison"
}