{
    "cancelled": false,
    "description": "<p>Bristol Cloud Native &amp; DevOps are excited to announce our next installment; with open source enthusiast, experienced public speaker, and principal architect, Paul Dragoonis.</p> <p>On Thursday 29th, Paul will be talking to us about \"The Future of Continuous Delivery\"</p> <p>\"It's the year 2021, an exciting time for the tech industry. Globally, software organisations and internet companies are delivering more and more software, at a rate and scale that we've never faced before.</p> <p>This unprecedented demand has created new challenges for us all, which have been hurting our organizations when creating continuous delivery solutions.</p> <p>The great thing about these new challenges is that they've sparked new and amazing innovations in the CI/CD industry.</p> <p>In Paul's talk he will be showing you:</p> <p>* What new innovations the CI/CD, Cloud Native and Open Source communities have been developing.<br/>* Where these innovations are taking the world of continuous delivery.<br/>* What to expect, from the CD community, later this year, and into the future.\"</p> <p>A little about Paul:</p> <p>* Open source contributor<br/>* A member of the Jenkins (Blue Ocean and JenkinsX) projects.<br/>* A member of the PHP core language team, and PHP-FIG member and standards author.<br/>* A member of the CDF (Continuous Delivery Foundation), which is part of the Linux Foundation.</p> <p>Paul works as an independent consultant in roles ranging from CTO, to Head of Engineering, to principal architect/developer/QA/DevOps consultant.</p> <p>Paul spends a significant amount of his time rolling out CI/CD pipelines, and embedding continuous delivery processes and solutions into companies in the public and private sector.</p> <p>Paul is very passionate about what he does and enjoys sharing his experiences with the wider community by way of private training or confernce/meetup speaking.</p> <p>Twitter: @dr4goonis<br/>Linkedin: <a href=\"https://www.linkedin.com/in/pauldragoonis\" class=\"linkified\">https://www.linkedin.com/in/pauldragoonis</a><br/>JenkinsX: <a href=\"https://jenkins-x.io/\" class=\"linkified\">https://jenkins-x.io/</a><br/>CDF: <a href=\"https://cd.foundation/\" class=\"linkified\">https://cd.foundation/</a><br/>PHP-FIG: <a href=\"https://www.php-fig.org/psr/\" class=\"linkified\">https://www.php-fig.org/psr/</a><br/>PHP: <a href=\"https://www.php.net/\" class=\"linkified\">https://www.php.net/</a></p> ",
    "end_time": 1628166600,
    "link": "https://www.meetup.com/Bristol-Cloud-Native-DevOps/events/279731460/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "Cloud-Native-DevOps",
    "start_time": 1628163000,
    "title": "The Future of Continuous Delivery"
}