{
    "cancelled": false,
    "description": "<p>[<a href=\"https://us06web.zoom.us/j/86516386972](https://us06web.zoom.us/j/86516386972\" class=\"linkified\">https://us06web.zoom.us/j/86516386972](https://us06web.zoom.us/j/86516386972</a>)</p> <p>\"𝑫𝒆𝒗𝑶𝒑𝒔 𝑪𝒖𝒍𝒕𝒖𝒓𝒆\"</p> <p>This is a broad topic to say the least and when you ask 10 people what DevOps means, you’ll undoubtedly get 10 different definitions.</p> <p>However, ‘DevOps Culture’ will be the next topic and the first installment of the DevOps &amp; Cloud Native meetup in 2022 – What an event to kick off with!</p> <p>This will be a panel event consisting of three consultancy speakers and one ‘end customer’ speaker to explore all things DevOps Culture<br/>and how consultancies and end customers interact to ensure a harmonious culture and mindset.<br/>More topic details to be released soon!</p> <p>We are excited to introduce our three panelists:</p> <p>Adam Coles (Head of DevOps and Cloud Engineering at Opencast Software) – Opencast are an independent consultancy operating in both the public and private sector. Adam comes from a development background having worked in both public and private sector, now heads up the DevOps and Cloud Service at Opencast Software.</p> <p>Jim Lamb (Head of Engineering at Airwalk Reply) – Airwalk deliver end-to-end digital transformation, from strategy and ideation through to execution and optimisation. Jim heads up the engineering side of Airwalk Reply, managing DevOps and Development teams and delivering cloud transformation projects across various industries.</p> <p>Nic Whittaker (Senior Technical Enablement Specialist, Way of Working at Nationwide Building Society) – Nationwide is the world’s largest building society. Nic’s career spans across multiple industries, coming from Head of Platform Engineer and DevOps into his current role of Cloud, DevOps and Ways of Working enablement across Nationwide’s Missions.</p> <p>The event will be facilitated by:</p> <p>Tina Howell (Exec for Cloud Engineering at AND Digital) – AND Digital are a consultancy that work with organisations to accelerate their digital delivery from defining digital strategies to building digital products and stronger teams. Tina still gets hands-on with the engineering but also leads a number of business units within AND Digital.</p> <p>𝗠𝗲𝗲𝘁𝘂𝗽 𝗗𝗲𝘁𝗮𝗶𝗹𝘀:<br/>📆 Wednesday 23rd February 2022<br/>⏰12:30 – 1:30pm<br/>💻Zoom (details to follow)</p> <p>This will undoubtedly be a very exciting event with loads of good takeaways for those in both the consultancy and end customer space. It will shed light on how to manage cultures within these types of businesses and how to ensure they are complimented for sustained growth and performance.</p> <p>Can’t wait to see everyone on the 23rd!</p> ",
    "end_time": 1645623000,
    "link": "https://www.meetup.com/bristol-devops-cloud-native/events/283547425/",
    "location": null,
    "org": "Cloud-Native-DevOps",
    "start_time": 1645619400,
    "title": "DevOps Culture"
}