{
    "cancelled": false,
    "description": "<p>We are kicking off 2023 in February with some brilliant speakers who will be taking the stage to chat about some exciting topics.</p> <p>On Wednesday 22nd February, we are hosting a double talk event with one speaker confirmed and another lined up and soon to be announced.</p> <p>The first speaker will be Sam Clift - Lead Engineer at Cookpad.<br/>Sam's talk is titled: \"How Cookpad Uses Sloth for SLOs\"<br/>Synopsis: \"Cookpad uses Sloth to create and manage our service SLOs. I'll talk about what SLOs are, how Cookpad used to write SLOs and how we now use Sloth to write them\".</p> <p>The second speaker will be Mattias Gees - Director of Technology at Jetstack.<br/>Mattias's talk is titled: \"A Cloud Native Journey at Scale\"<br/>Synopsis: \"Enterprises on their Cloud Native journey have 2 options, buy a Kubernetes Platform with all the bells and whistles or build one from scratch. When picking the latter, it allows you to create your own PaaS solution that fits your company's DNA and culture. This talk focuses on how an international financial institution leveraged the cloud and the Cloud Native landscape to build a scalable single-tenant Kubernetes platform that fits its culture and security requirements. Building out a scalable Kubernetes platform to more than 100 Kubernetes clusters comes with a lot of challenges in a big enterprise. During this talk, I will tell the story from where we started to today, the challenges we encountered and how we manage more than 100 Kubernetes clusters in an efficient way\"</p> <p>We are excited to be back for our first 2023 event which, as always, will have complimentary drinks (beer and soft drinks) and food (pizza).</p> <p>Cookpad have been kind enough to host us in their event space.<br/>Location: 1 Broad Plain, Bristol, BS2 0JP</p> <p>The office is just off Old Market roundabout, a short walk from Temple Meads for those travelling in and close to a few centrally located car parks.</p> <p>I look forward to welcoming everyone back in February.</p> <p>Thanks,<br/>Steve</p> ",
    "end_time": 1677096000,
    "link": "https://www.meetup.com/bristol-cloud-native-devops/events/291206368/",
    "location": {
        "address": "1 Broad Plain",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.454139709472656,
        "longitude": -2.5822019577026367,
        "name": "Cookpad"
    },
    "org": "Cloud-Native-DevOps",
    "start_time": 1677090600,
    "title": "2023 Cloud Native & DevOps Kick Off Event"
}