{
    "cancelled": false,
    "description": "<p>We are excited to announce the final meetup of the year for the end of November.</p> <p>We have two brilliant speakers lined up.</p> <p>Firstly, I am delighted to welcome back Mattias Gees - Director of Technology at Venafi. </p> <p>**Title**:<br/>Solving ‘secret zero’, why you should care about SPIFFE!</p> <p>**Description**:<br/>In today's rapidly evolving digital landscape, security teams face the daunting challenge of protecting complex and dynamic Cloud Native environments. As organisations embrace the power of Kubernetes for their container orchestration needs, ensuring robust machine identity security measures becomes paramount. That's where the Secure Production Identity Framework for Everyone (SPIFFE) steps in as a game-changer. SPIFFE offers security teams a standardised approach to establish and manage solid identities for workloads in Kubernetes, hybrid cloud infrastructures and data centres. In this talk, Venafi‘s Head of Tech, Mattias, will describe real-world examples of how SPIFFE can be leveraged for modern machine identity. Using SPIFFE, security teams can solve the secret zero problem and take machine identity to a new level.</p> <p>Our second speaker is John Ellwood, Platform Engineer at BJSS. This talk will be an interactive session, allowing everyone to get involved on your own laptop and will involve: </p> <p>* What Helm is and its benefits for managing k8s deployments<br/>* Writing your first Helm chart<br/>* Refactoring existing k8s deployments to use Helm along with some gotchas<br/>* Q&amp;A</p> <p>Details:</p> <p>📍 - BJSS Offices - 90 Victoria St, Redcliffe, Bristol BS1 6DP<br/>🗓️ 30th November<br/>🕠 18:30 kick off<br/>📢 Presentation Event<br/>🍕🍺/🥤 Pizza and Beer/Soft drinks will be provided</p> <p>To join the LinkedIn group, head to the link [here](<a href=\"https://www.linkedin.com/company/devops-cloud-native/\" class=\"linkified\">https://www.linkedin.com/company/devops-cloud-native/</a>)<br/>Join the Slack channel to interact and chat with other community members! - <a href=\"https://join.slack.com/t/bristol-devops-and-cn/shared_invite/zt-26idjpyva-YD3lKsZ64iRog1SDt4BgRw\" class=\"linkified\">https://join.slack.com/t/bristol-devops-and-cn/shared_invite/zt-26idjpyva-YD3lKsZ64iRog1SDt4BgRw</a></p> ",
    "end_time": 1701376200,
    "link": "https://www.meetup.com/bristol-devops-cloud-native/events/297217510/",
    "location": {
        "address": "90 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45127868652344,
        "longitude": -2.586751937866211,
        "name": "James Tudor House"
    },
    "org": "Cloud-Native-DevOps",
    "start_time": 1701369000,
    "title": "DevOps & Cloud Native November Meetup"
}