{
    "cancelled": false,
    "description": "<p>Our second evening session being held at the Just Eat offices in central Bristol; there will be a chance to network and, of course, free pizza &amp; drinks will be provided.</p> <p>Following the session we'll be going out for drinks nearby, all are welcome (and indeed encouraged!) to come along for some networking.</p> <p>There will be two excellent hour long talks from the guys at Purple Frog Systems; details of which are as follows: -</p> <p><b>Alex Whittles</b></p> <p><b>BI in Azure</b> <i>(Business Intelligence/Cloud Services)</i></p> <p>Azure offers many great tools and services, but how to they fit together and what are your options when trying to architect an end to end Azure BI platform?</p> <p>We'll take a high level look at the available Azure services, discussing what their capabilities are and how they fit together. Covering Azure Data Factory, Data Lake, Table Storage, Blob Storage, U-SQL, HDInsight, SQL Data Warehouse, Machine Learning, Power BI, Event Hub, Stream Analytics and more.</p> <p>Bio:</p> <p>Alex is a Data Platform MVP, and is the owner and principle consultant at Purple Frog, a SQL Server Business Intelligence consultancy in the UK with multinational clients in a variety of sectors. He specialises in all aspects of data modelling, data warehousing, ETL and cubes using the SQL Server stack. Alex has an MSc in Business Intelligence, is a chartered engineer, is on the organising committee for both SQLBits and SQL Relay, and leader of the Birmingham SQL Server User Group and the Birmingham Azure user group. Alex is also a regular speaker at many SQL Server events around the world including SQL Relay, SQL Bits, SQL Saturdays, 24 HOP and the PASS Summit.</p> <p><b>Paul Andrew</b></p> <p><b>Building an End to End IoT Solution Using Raspberry Pi Sensors &amp; Azure </b><i>(Internet of Things/Cloud Services)</i></p> <p>The Internet of Things is the new kid on the block offering a wealth of possibilities for data streaming and rich analytics. Using a Raspberry Pi 3 I will take an end to end look at how to interact with the physical world collecting sensor values and feeding that data in real-time into cloud services for manipulation and consumption. This will be a heavily demonstrated session looking at how such an environment can be setup using the Microsoft offerings including; Windows 10 IoT Core, a C# Universal Windows Platform application, an Azure IoT Event Hub, Azure Stream Analytics, Azure SQL DB and Power BI. This is an overview of what's possible, but showing exactly how to build such a simplified solution with a session which will be 90% demonstrations. In addition, spare Raspberry Pi devices will be available for the audience to pass around and look at. This will hopefully add that level excitement of what hardware is now available and what it can do when setup with Microsoft software.</p> <p>Bio:</p> <p>Paul has 10+ years' experience working with the complete on premises SQL Server stack in a variety of roles and industries. Now as the senior developer at Purple Frog Systems is focusing on the Internet of Things (IoT) using Microsoft Azure and specialising in real-time data streaming. Paul is also an ambassador for the STEM Networking education in schools' programme, an organiser of the Birmingham SQL Server and Azure user groups as well as a very active member within the SQL Server community.</p> ",
    "end_time": 1486501200,
    "link": "https://www.meetup.com/databristol/events/234827450/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "databristol",
    "start_time": 1486490400,
    "title": "SQL-Bristol Evening Session (February 2017)"
}