{
    "cancelled": false,
    "description": "<p>For our third evening session, we are very pleased to have two excellent speakers lined up.  This time round, the meeting is being held at the offices of Ovo Energy who have generously agreed to host us.</p> <p><b>Terry McCann</b></p> <p><i><b>Why TSQL was language of the year! </b>(Database Developer/Administrator)</i></p> <p>TSQL was voted best programming language in 2013, let’s explore why! In this session we will explore what make SQL such a fascinating language. We will do this through looking at a few real life problems and common design challenges.  What in particular will we look at? Well… Tally tables, CURSORS, hidden CURSORS, CTEs, Recursive CTE, Manual Pivot, TSQL Pivot, CROSS JOIN, CROSS APPLY, CORRELATED QUERIES, STUFF(), RANK(),GO, DENSE_RANK(),LAG(), LEAD(), ROW_NUMBER(), XML PATH, MOD %,  STRING_AGG(), DBCC DROPCLEANBUFFERS, DBCC FREEPROCCACHE, STATISTICS IO &amp; TIME.  (A bit of TSQL)</p> <p><b>Bio:</b></p> <p>Data warehouse/Big data/Data science consultant for Adatis consulting limited a Microsoft Data &amp; Analytics consultancy. Passion for advanced analytics and automation. Specialising in Microsoft BI architecture. Frequent speaker at SQL Saturdays in the UK and Europe. Organiser of the Data Science user group in Exeter and previous co-organiser of SQL Saturday Exeter. </p> <p><b>Simon Whiteley</b></p> <p><i><b>Azure SQL DataWarehouse Reflections </b>(Cloud Services)</i></p> <p>Azure SQL DataWarehouse is here and being pushed as the answer to huge structured data stores in the cloud, but what does that mean to you? Reflecting on a large-scale Azure SQLDW project, this session gathers together learnings, successes, failures and general opinions into a crash course in using Azure SQL DataWarehouse “properly”.</p> <p>We'll start by quickly putting the technology in context, so you know WHEN to use it, WHERE its appropriate and WHY it works the way it does.</p> <p>• Introducing the SQLDW technology</p> <p>• Explaining distributions &amp; performance</p> <p>• Explaining polybase</p> <p>We will then dive into HOW to use it, looking at some real-life design patterns, best practice and some “tales from the trenches” from a recent large Azure SQLDW project.</p> <p>• Performance tips &amp; tricks (designing for minimal data movement, managing distribution skew, CTAS, Resource classes and more)</p> <p>• ETL Patterns (Surrogate keys &amp; Orchestration)</p> <p>• Common Mistakes &amp; Pitfalls</p> <p>• Conclusions &amp; Recommendations</p> <p><b>Bio:</b></p> <p>Simon is a principal consultant with Adatis Consulting, a Microsoft Data &amp; Analytics consultancy. Emerging from a world of traditional BI structures, Simon is now obsessed with utilising cloud technologies to revolutionise these traditions. He’ll dive into any interesting BI problem, whether it’s ETL patterns, analysis models, lakes, custom 3D visualisations or dabbling in cloud new architectures.</p> ",
    "end_time": 1493150400,
    "link": "https://www.meetup.com/DataBristol/events/237498964/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol BS1 6ED ",
        "country": "gb",
        "latitude": 51.45027160644531,
        "longitude": -2.5840630531311035,
        "name": "Ovo Energy"
    },
    "org": "databristol",
    "start_time": 1493139600,
    "title": "SQL-Bristol Evening Session (April 2017)"
}