{
    "cancelled": false,
    "description": "<p><b>Chris Webb</b></p> <p><b>Introduction to Azure Analysis Services</b> (Business Intelligence)</p> <p>With the release of Azure Analysis Services we have, at long last, got a crucial piece of the Microsoft BI stack available in the cloud. Azure Analysis Services is a SaaS version of Analysis Services, and in this session you’ll learn about:</p> <p>• What Azure Analysis Services is</p> <p>• When you should use it</p> <p>• Configuring Azure Analysis Services in the Azure portal </p> <p>• Developing and deploying Azure Analysis Services models </p> <p>• Building reports in Excel and Power BI using Azure Analysis Services </p> <p>• Connecting to on-premises data sources from Azure Analysis Services </p> <p>• Automation with PowerShell </p> <p>• Integration with other cloud BI services </p> <p>• Sizing and pricing </p> <p>• Monitoring</p> <p><b>Prathy Kamasani</b></p> <p><b>What's new in SQL Server Reporting Services</b> (Business Intelligence)</p> <p>After years of abandon, Microsoft exhibited great love towards SSRS with SQL Server 2016 release. But it doesn't stop there. There are some exciting features in the preview for the next release. </p> <p>In this session, Prathy will show top features of SSRS 2016 and vNext. Various ways of designing and publishing reports to SSRS web portal using SQL Server Data Tools (SSDT), Report Builder, SQL Server Mobile Report Publisher and Power BI (Technical Preview of Power BI reports in SQL Server Reporting Services)</p> ",
    "end_time": 1497988800,
    "link": "https://www.meetup.com/databristol/events/239426105/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "databristol",
    "start_time": 1497978000,
    "title": "SQL-Bristol Evening Session (June 2017)"
}