{
    "cancelled": false,
    "description": "<p>Back after a summer break and what a line up, the <b><a href=\"http://dlmconsultants.com/\">DLM Consultants</a></b> are coming to Bristol...</p> <p><b>Talk #1: Speakers: Alex Yates &amp; Rob Sewell (joint talk)<br/></b></p> <p><b>DevOps 101 for the IT Professional – how your jobs will change<br/></b></p> <p>In 2009 John Allspaw and Paul Hammond delivered the session “10 deploys per day - Dev &amp; ops cooperation at Flickr”. In forty six minutes they changed the way millions of people would think about the software delivery process for years to come. It didn’t have a name yet, but DevOps was born. DevOps folk preached about the cloud, automation, rapid delivery and any database technology that wasn’t relational.</p> <p>In 2013 Kenny Gorman declared “The DBA is Dead”.</p> <p>For the record, we don't believe that, but a lot of people do. What is certain is that the world of IT is changing and traditional roles are changing with it. We all need to adapt.</p> <p>In this interactive talk we will explain what DevOps is, where it came from, and its implications for SQL Server. We'll demo example solutions to some of the foundational technical challenges (source control and test/deployment automation) and we will leave plenty of time at the end to answer your questions.</p> <p><b>Talk #2: Speaker: Luke Merrett (short talk)<br/></b></p> <p><b>NoSQL...for people who like SQL</b></p> <p>In 2010 NoSQL databases surged in popularity in response to the increasing need to scale rapidly whilst serving more data to users in less time.</p> <p>But what is \"NoSQL\"?  What does BASE consistency mean?  And why does it have such a misleading name?</p> <p>We'll walk through the philosophies of the NoSQL class of databases, how they differentiate from SQL Server &amp; when you may choose to use them.</p> <p>Whilst we're at it, we'll look at the difference between ACID and BASE and how to cater for eventual consistency.</p> <p><b>Biographies</b></p> <p><b>Alex Yates </b><a href=\"https://twitter.com/_AlexYates_\">@_AlexYates_</a></p> <p>DevOps Expert, Principal Consultant, Microsoft Data Platform MVP</p> <p>Alex has been helping organisations to apply DevOps principles to relational database development and deployment since 2010. He's most proud of helping Skyscanner develop the ability to deploy 95 times a day. Originally for Redgate, later for DLM Consultants, Alex has worked with clients on every continent except Antarctica - so he's keen to meet anyone who researches penguins. A keen community member, he co-organises the London Continuous Delivery meetup and SQL Relay.</p> <p><b>Rob Sewell </b><a href=\"https://twitter.com/sqldbawithbeard\">@sqldbawithbeard</a></p> <p>SQL Server DBA and PowerShell guru, Microsoft CDM MVP</p> <p>Rob is a SQL Server DBA with a passion for Powershell, Azure, Automation, and SQL Server. Rob works with clients to enable automation, SQL Server best practices and DevOps. He is most proud of being able to test several thousand database backup settings in only a few minutes using PowerShell and of being a founder of the popular open source module dbatools. He is an officer for the PASS PowerShell Virtual Chapter and has spoken at and volunteered at many events.</p> <p><b>Luke Merrett </b><a href=\"https://twitter.com/ClickRex\">@ClickRex</a></p> <p>Senior Engineer, JUST EAT</p> <p>Luke has 7 years experience working with everything from SQL Server to RavenDB, Azure Table Storage to AWS DynamoDB &amp; Neo4J to Redis. He has seen graph databases perform magic, caching services slowing down servers &amp; SQL stretched to the edge of sanity.</p> <p>Currently an organiser of SQL Bristol, Golang enthusiast &amp; F# advocate.</p> ",
    "end_time": 1506456000,
    "link": "https://www.meetup.com/databristol/events/242593613/",
    "location": null,
    "org": "databristol",
    "start_time": 1506443400,
    "title": "SQL-Bristol Evening Session (September 2017)"
}