{
    "cancelled": false,
    "description": "<p>Last session for the year, very happy to announce the following great speakers, including our second from a SQL Bristol member... another one not to miss!</p> <p><b>Talk #1: Tobiasz Koprowski</b><b><br/></b></p> <p><b>Secure your data at rest - on demand, now!</b></p> <p>The new release of Microsoft SQL Server: SQL Server 2016 brings new functionality for Data Security Professionals.  Now you can protect your data in your database anywhere (on-premise, in the cloud, even in the hybrid environment) even more simply than before.  Transparent Data Encryption with better algorithms and better support for backup, Row-Level Security, Dynamic Data Masking and AlwaysEncrypted for your application are now simple features.  We focus on hard theory and of course, on demos.  We look a little closer for few specific files that exist in our environment.  We work on all three different environments, but our goal is only one: protect your data.</p> <p>New Security Features, SQL Server 2016, Microsoft Azure SQL Database, Encryption, Data Security</p> <p><b>Talk #2: Phil Austin (short talk)<br/></b></p> <p><b>Automated deployment with Octopus Deploy </b></p> <p>Following the introduction to DevOps at our last session, this short talk will cover some practical implementation advice and examples using Octopus Deploy.  Exploring what it is, what it does, when to use it and how it fits with DevOps more widely.  Further, demonstrating several benefits including deployment using SQL Server Data Tools (SSDT), workflow options, versioning and more.</p> <p>SQL Server, Automated Deployment, Continuous Deployment, DevOps</p> <p><b>Biographies</b></p> <p><b>Tobiasz Koprowski </b><a href=\"https://twitter.com/KoprowskiT\">@KoprowskiT</a><b><br/></b></p> <p>CEO of <a href=\"https://shadowlandconsulting.co.uk/\">Shadowland Consulting</a>.  In January 2015 decided to permanently leave Poland and discover new worlds. Actually settled in Last Byron‘s Home.  Community leader focused on SQL Server, SharePoint, security, collaboration and ITIL, DR, BCM, and SLA. Love licensing stuff.  MCT, freelancer, and consultant.  Subject Matter Expert at CQURE &amp; Microsoft.  Member of Microsoft Terminology Community, Friends of RedGate PLUS, PASS, ISSA, ACM and several communities in the world.  Since 1st July 2010 Data Platform MVP.  Former President of the Polish SQL Server USer Group.  Creator of SQLDAY Conference and Conference CEO[masked].  Co-Leader of PASS East Midlands Group.  Speaker at group meetings and conferences.</p> <p><b>Phil Austin<br/></b></p> <p>Phil has spent almost 20 years down the SQL mines, working for household names and total unknowns.  He knows a fair bit about BI and data warehousing using SQL Server and <a href=\"https://phil-austin.blogspot.co.uk/\">blogs </a>every now and then.  He also takes an interest in automation, development lifecycle and what is now known as DevOps, but don’t hold that against him.  Outside of that you might see him hacking around Bristol on a bike or taking his son to see the latest Marvel offering.  If you buy him a drink he might tell you about the time a Nokia executive told him Apple don’t know anything about phones…</p> <p>Note: Please RSVP before Thursday so we have a good idea of numbers!</p> ",
    "end_time": 1509656400,
    "link": "https://www.meetup.com/DataBristol/events/242642319/",
    "location": null,
    "org": "databristol",
    "start_time": 1509643800,
    "title": "SQL-Bristol Evening Session (November 2017)"
}