{
    "description": "<p>We are excited to have Steph Locke talking about Agile Databases and Richard Swinbank showing us ways to orchestrate our ETL in T-SQL. The schedule will be:</p> <p>18:00 arrival<br/>18:15 ETL orchestration in T-SQL<br/>19:00 Pizza<br/>19:30 Anchor Modelling - Agile Databases<br/>20:30 Close - everyone welcome to join us at the pub afterwards</p> <p>Talk 1: ETL orchestration in T-SQL<br/>Richard Swinbank</p> <p>In this session Richard will present a simple approach to orchestrating SQL-heavy ETL processes. We will look at desirable behaviours -- including error handling, diagnosis support, fault tolerance, resume-after-error and parallel processing -- and see how we can obtain these using tools built in pure T-SQL. Not just for ETL developers, there should be something here for anyone with an interest in T-SQL beyond data manipulation.</p> <p>Bio: Richard is an independent DW/BI consultant specialising in the SQL Server stack. Long experience of inheriting ETL developments in a variety of conditions has given him a strong interest in building fault-tolerant, diagnostic-rich systems. He's particularly interested in using metadata to drive code generation, automate documentation and to reduce human error.</p> <p>Talk 2: Anchor Modelling - Agile Databases<br/>Steph Locke</p> <p>Anchor Modelling is a fantastic database modelling paradigm that uses sixth normal form (6NF) to store data and provides third normal form (3NF) views for ease of use.<br/>This session deep dives into all the concepts behind Anchor Modelling (and indeed databases generally!) and then takes you through how Anchor Modelling uses these concepts to move away from the traditional data warehouse paradigm to deliver a purely additive, agile database.</p> <p>Bio: Steph is the founder of Locke Data, a consultancy in the UK. Her talks, blog posts, conferences, and business all have one thing in common – they help people get started with data science. Steph holds the Microsoft MVP award for her community contributions. In her spare time, Steph plays board games with her husband and takes copious pictures of her doggos.</p> <p>Note from the organisers: We're always keen to hear from people who may be interested in doing a talk. If you or someone you know would like to present to our friendly audiences, we welcome those looking to gain experience of speaking as well as seasoned pro's. We can discuss/support co-presenting for speakers who prefer to share the limelight, and are happy to run through ideas and draft presentations. Please get in touch at: [masked]!</p> ",
    "end_time": 1526412600,
    "link": "https://www.meetup.com/DataBristol/events/249751193/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "databristol",
    "start_time": 1526403600,
    "title": "SQL-Bristol Evening Session May 2018"
}