{
    "date": 1542736800,
    "description": "<p>The SQL Bristol meetup is informal and friendly, usually around 40 people. It's a great opportunity to network with folk either interested in, or who work with SQL, and learn something new from our great speakers. We also have free pizza and drinks from our kind sponsors Just Eat. Afterwards some of us head to a local pub for a bit more relaxing and chatting. Feel free to come along.</p> <p>We have 2 speakers lined up.</p> <p>Martin Bell was presenting about Graph Databases but unfortunately he cannot make it, so he'll present at a future meet up instead.</p> <p>We have our own member Niall Langley presenting \"An Introduction to Azure for Data Professionals\":</p> <p>Getting started with Azure can be a bit of a minefield for people . who have only worked with SQL Server on premises. There are a lot of different services available, all with differing prices, and functionality. In this session we take an overview of the services that are of interest to data professionals, looking at the intended uses and comparing to the equivalent on premises technologies. We will understand where improvements have been made possible by the cloud, and look at some of the limitations you could run into.</p> <p>Also, Prathy K MVP is presenting \"Power BI deployment strategy for publishing and maintenance\":</p> <p>Power BI: Minutes to create and seconds to impress.</p> <p>Yes, it takes minutes to create and share Power BI reports. Which means every user who has relevant Power BI access can create work spaces, apps, reports, dashboards and schedules. With no deployment strategy, maintaining Power BI service could become a terrible job.<br/>In this session, I will cover how having a having deployment strategy can make a terrible maintenance job seamless.</p> <p>This session will include:<br/>• What happens when a user creates a Power BI app workspace<br/>• How to control user access<br/>• Working with different environments<br/>• Creating and sharing reports using Power BI Apps<br/>• How to monitor dataset schedules and failure notifications<br/>• How to use Power BI API to document your organisation Power BI Service</p> <p>Look out for organisers with an orange lanyard if you need any info (or just for a chat!). Some of us might be wearing SQL Bristol t shirts.</p> <p>If you're a twitterer you can find us at <a href=\"https://twitter.com/SQLBristol\" class=\"linkified\">https://twitter.com/SQLBristol</a> and please do message us or comment below if you have any questions in advance.</p> ",
    "link": "https://www.meetup.com/DataBristol/events/251688379/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "databristol",
    "title": "Power BI Deployment Strategy and an Intro to Azure"
}