{
    "date": 1547575200,
    "description": "<p>The SQL Bristol meetup is informal and friendly, usually around 40 people. It's a great opportunity to network with folk either interested in, or who work with SQL, and learn something new from our great speakers. We also have free pizza and drinks from our kind sponsors Just Eat. Afterwards some of us head to a local pub for a bit more relaxing and chatting. Feel free to come along.</p> <p>We have Chris Webb coming to talk to us about the Q&amp;A functionality in Power BI, and Andrew Pruski talking about SQL Server Containers.</p> <p>Chris Webb is an independent consultant specialising in Analysis Services, MDX, Power BI, Power Pivot and Power Query. He is the author of \"Power Query for Power BI and Excel\" and a co-author of \"SQL Server Analysis Services 2012: The BISM Tabular Model\",<br/>\"Expert Cube Development with SQL Server 2008 Analysis Services\", and \"MDX Solutions with Microsoft SQL Server Analysis Services 2005 and Hyperion Essbase\".<br/>He blogs at <a href=\"http://blog.crossjoin.co.uk\" class=\"linkified\">http://blog.crossjoin.co.uk</a><br/>His Twitter handle is @cwebb_bi</p> <p>Q&amp;A in Power BI: gimmick or game-changer?</p> <p>You have probably seen the Q&amp;A feature in Power BI demoed many times, but is it just a demo feature? Do users really want to type questions and see Power BI visuals generated for them automatically? In this session you’ll learn:</p> <p>What Q&amp;A is, where it can be accessed by users and who it might be useful to<br/>How the design of your dataset and reports can influence how well Q&amp;A works<br/>How advanced features like Synonyms and editing the Linguistic Schema file can enable more complex interactions<br/>Whether it’s worth your time and effort to use Q&amp;A in your Power BI deployment</p> <p>Andrew Pruski - @dbafromthecold<br/>SQL Server DBA &amp; Data Platform MVP originally from Swansea, Wales but currently exploring Ireland.<br/>He has been working with relational databases (in one form or another) for over 10 years and has a real passion for the technology.<br/>There's a lot of buzz about containers in tech at the moment and this technology has benefits that the SQL Server community simply shouldn't be ignoring.</p> <p>This demo based session will provide an introduction to SQL Server containers, explore the various options when running containers,<br/>and give a real-world example of implementing containers in a development environment.</p> <p>Attendees will be taken through the following: -<br/>The definition of containers<br/>Virtual Machines vs Containers<br/>Pulling SQL images from the docker repository<br/>Running SQL Server containers<br/>Creating custom container images<br/>Persisting data in containers<br/>Using Portainer to manage containers<br/>A real world implementation of containers</p> <p>Look out for organisers with an orange lanyard if you need any info (or just for a chat!).</p> <p>If you're a twitterer you can find us at <a href=\"https://twitter.com/SQLBristol\" class=\"linkified\">https://twitter.com/SQLBristol</a> and please do message us or comment below if you have any questions in advance.</p> ",
    "link": "https://www.meetup.com/DataBristol/events/251688432/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "databristol",
    "title": "Chris Webb on Power BI QnA and Andrew Pruski on SQL Containers"
}