{
    "date": 1537290000,
    "description": "<p>The SQL Bristol meetup is informal and friendly, usually around 40 people. It's a great opportunity to network with folk either interested in, or who work with SQL, and learn something new from our great speakers. We also have free pizza and drinks from our kind sponsors Just Eat. Afterwards some of us head to a local pub for a bit more relaxing and chatting. Feel free to come along.</p> <p>Alex Yates (Twitter @_AlexYates_) will be presenting DevOps, Dev Data and the GDPR: 5 Solutions.</p> <p>Alex Yates has been helping organisations to apply DevOps principles to relational database development and deployment since 2010. He’s most proud of helping Skyscanner develop the ability to deploy 95 times a day. Originally for Redgate, later for DLM Consultants, Alex has worked with clients on every continent except Antarctica – so he’s keen to meet anyone who researches penguins.</p> <p>A keen community member, he co-organises SQL Relay, is the founder of www.SpeakingMentors.com and has been recognised as a Microsoft Data Platform MVP since 2017.</p> <p>Alex Whittles from Purple Frog Systems will be presenting a session on 'Cubes in the Cloud - Analysis Services in Azure'. Learn how to deploy and manage cubes in Azure Analysis Services. Including partition management, scale up and scale out for performance, backups, security, upgrading from Power BI and much more. We’ll also look at how to choose between Power BI and SSAS.</p> <p>Look out for organisers with an orange lanyard if you need any info (or just for a chat!).</p> <p>The pub we'll be heading to after is The Prince Street Social, just round the corner (37-41 PRINCE STREET BRISTOL BS1 4PS)</p> <p>If you're a twitterer you can find us at <a href=\"https://twitter.com/SQLBristol\" class=\"linkified\">https://twitter.com/SQLBristol</a> and please do message us or comment below if you have any questions in advance.</p> ",
    "link": "https://www.meetup.com/DataBristol/events/251688224/",
    "location": {
        "address": "2nd Floor  Broad Quay House, Prince Street, BS1 4DJ",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.451744079589844,
        "longitude": -2.5968730449676514,
        "name": "JUST EAT"
    },
    "org": "databristol",
    "title": "DevOps, Dev Data and the GDPR, and Azure Analysis Services"
}