{
    "cancelled": false,
    "description": "<p>If you are interested in AI, ML and Deep Learning, we have lined up two excellent speakers, beginning with an introductory talk and followed by somewhat more of a deep dive session. This is the first joint event of the now merged Big Data Bristol and SQL Bristol group, coming together as Data Bristol.</p> <p>AGENDA<br/>----------<br/>18.15 – 18:30 Meet &amp; Greet<br/>----------</p> <p>18:30 - 19:20<br/>TALK #1 - Alex Whittles \"Introduction to AI, ML &amp; Deep Learning\" (Level 1)<br/>----------<br/>So what’s this Machine Learning all about? This talk provides an accessible, non-technical introduction that covers the history, high level concepts and differences between AI, ML &amp; Deep Learning. Hands on examples and demos of doing cool stuff in Azure ML Studio and locally in Python. Plus, a quick discussion around the morals, ethics and impact of these technologies.</p> <p>-- Bio -- Alex is the owner and principle consultant at Purple Frog, a SQL Server Business Intelligence consultancy in the UK with multinational clients in a variety of sectors. He specialises in all aspects of dimensional data modelling, data warehousing, ETL and cubes using the SQL Server stack. See www.PowerBISentinel.com and www.PurpleFrogSystems.com.</p> <p>----------<br/>19.20 – 19:40 Break &amp; Pizza<br/>----------</p> <p>19:40 - 20:30<br/>TALK #2 – Dan Cook \"Winning Atari Games with AI\" (Level 3)<br/>----------<br/>March 2016, AlphaGo beats Lee Sedol. Reinforcement learning, so hot right now! Baffled by the Bellman equation and gradient backpropagation, I had to sit through a Data Science degree to get to the bottom of it. Why does everyone prefer to explain things with maths and obscure symbols? This talk takes a step back and will run through the intuition and practical code examples of both reinforcement learning and convolutional neural nets so you can create your own AI to win at Pong or whatever Atari game takes your fancy.</p> <p>-- Bio -- Dan is an independent Technical Architect. He’s just delivered a novel mobile phone indoor positioning system fusing together WiFi signals, gyroscope and accelerometer data to give a position fix accurate to 5m in airports and shopping centres. Previously he’s led the development of a Hadoop-as-a-Service offering and built software streaming frameworks long before the rise of Apache Spark and Storm.</p> <p>EVENT SPONSORS<br/>----------<br/>We would like to thank our generous sponsors for supporting us:</p> <p>Ovo Energy (www.ovoenergy.com)</p> <p>WHEN AND WHERE<br/>----------<br/>The venue is: Ovo Energy, 1 Rivergate Temple Quay, Bristol, BS1 6ED. If for any reason, you cannot make it, please un-RSVP in good time.</p> <p>LEVELS<br/>----------<br/>Level 1: Introductory and overview material<br/>Level 2: Intermediate material (background knowledge useful)<br/>Level 3: Advanced (assumes prior subject matter knowledge)<br/>Level 4: Expert (deep level of technical knowledge)</p> ",
    "end_time": 1568835900,
    "link": "https://www.meetup.com/databristol/events/262550158/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45012664794922,
        "longitude": -2.584080934524536,
        "name": "OVO Energy"
    },
    "org": "databristol",
    "start_time": 1568826900,
    "title": "Data Bristol: Machines VS Games - AI, ML and Deep Learning"
}