{
    "cancelled": true,
    "description": "<p>** Unfortunately due to several factors relating to corona virus this event has been postponed. **</p> <p>Chris Lewis, Heads of DevOps at Funds Library will be sharing his experience of data wrangling in the financial sector.</p> <p>James Harris, Director of Blue Sparrow Apps, will be speaking on how data and AI has been used across some different applications.</p> <p>----------</p> <p>AGENDA</p> <p>----------<br/>18.00 – 18:30 Meet &amp; Greet<br/>----------</p> <p>18:30 - 19:20<br/>TALK #1 - Chris Lewis; Data wrangling for insurers and investors – common use cases, problems and solutions. (Level 1)</p> <p>Chris has worked in development roles in financial services for 15 years across leasing, insurance and investment. Over the course of his career he has spotted common themes and trends which crisscross these industries. His talk will focus on lessons he has learned which apply anywhere where data wrangling is concerned. Chris is Head of Devops at FundsLibrary (<a href=\"https://fundslibrary.com\" class=\"linkified\">https://fundslibrary.com</a>), formerly Head of Development at Confused.com.</p> <p>----------<br/>19.20 – 19:40 Break &amp; Pizza<br/>----------</p> <p>19:40 - 20:30<br/>TALK #2 – James Harris; AI, APIs, and data (Level 1)</p> <p>APIs have taken over the world, and connecting them together has become a key competitive advantage for companies, particularly when they can be used in conjunction with AI. James will talk through some of the tools that have appeared in this space over the last few years, and how they’re changing. He’ll also show some cool real-world examples of their use.</p> <p>James is the Managing Director of Blue Sparrow Apps; an award winning digital agency based in Bristol. Over his career he’s worked as a developer in a wide range of industries including finance, defence and policing. During his 20 years in tech, he’s coded on some awesome projects, drunk a lot of coffee and read a lot of Stack Overflow posts.<br/>(<a href=\"https://www.bluesparrowapps.com\" class=\"linkified\">https://www.bluesparrowapps.com</a>)</p> <p>----------<br/>20:30 - Pub<br/>----------</p> <p>EVENT SPONSORS<br/>----------<br/>We would like to thank our generous sponsors for supporting us:</p> <p>Just Eat (<a href=\"https://www.just-eat.co.uk/\" class=\"linkified\">https://www.just-eat.co.uk/</a>)</p> <p>WHEN AND WHERE<br/>----------<br/>The venue is: Just Eat, Broad Quay House, Broad Quay, Bristol BS1 4DJ. If for any reason, you cannot make it, please un-RSVP in good time.</p> <p>LEVELS<br/>----------<br/>Level 1: Introductory and overview material<br/>Level 2: Intermediate material (background knowledge useful)<br/>Level 3: Advanced (assumes prior subject matter knowledge)<br/>Level 4: Expert (deep level of technical knowledge)</p> ",
    "end_time": 1584565200,
    "link": "https://www.meetup.com/DataBristol/events/265016043/",
    "location": null,
    "org": "databristol",
    "start_time": 1584554400,
    "title": "POSTPONED! APIs with AI, and Finance"
}