{
    "date": 1574187300,
    "description": "<p>An evening of Azure, Niall Langley and Kamil Nowinski are kindly coming to talk about ETL in the cloud and migrating your data warehouse on the Microsoft Azure platform. We are still finalising the details, but a general (subject to change) outline is below:</p> <p>AGENDA<br/>----------<br/>18.15 – 18:30 Meet &amp; Greet<br/>----------</p> <p>18:30 - 19:20<br/>TALK #1 : Niall Langley \"Azure Data Factory: Data Flow vs DataBricks\" (Level 2)<br/>----------<br/>In this talk we start with an intro to Data Factory and DataBricks, to understand where they come from, and their place in the wider Azure ecosystem. We then move on to demo both tools to see how we would use them to accomplish a simple data transform. We finish with a review, comparing the features and limitations of each, and considering why we might choose one tool vs the other.</p> <p>-- Bio -- Niall has been working with SQL Server since 2007, mostly designing and building data warehouses, most recently building modern data warehouse platforms in Azure. Niall blogs occasionally and regularly speaks at user groups and conferences in the UK, including presenting at SQL Bits for the first time in 2019.</p> <p>----------<br/>19.20 – 19:40 Break &amp; Pizza<br/>----------</p> <p>19:40 - 20:30<br/>TALK #2 : Kamil Nowinski \"Data Warehouse Migration to Azure\" (Level 2)<br/>----------<br/>Azure is cheaper, is faster and is more secure!?! Sooner or later you'll be considering (yes, believe me): moving a data warehouse from on-premise to the cloud. This session will discuss the ideas supporting this and compare methods and approaches. I will describe potential issues and give hints to avoid them. Finally, seeing what speed we can achieve during a migration.</p> <p>-- Bio -- Kamil is a Principal Consultant at Altius Data, a Microsoft Data Platform MVP and the founder of the SQLPlayer blog. He is an active international speaker and community member, including co-organising of the biggest SQL conference in Poland. His interests include data exploration, modeling, cloud solutions, DevOps, automation and optimizations!</p> <p>EVENT SPONSORS<br/>----------<br/>We would like to thank our generous sponsors for supporting us:</p> <p>Ovo Energy (www.ovoenergy.com)</p> <p>WHEN AND WHERE<br/>----------<br/>The venue is: Ovo Energy, 1 Rivergate Temple Quay, Bristol, BS1 6ED. If for any reason, you cannot make it, please un-RSVP in good time.</p> <p>LEVELS<br/>----------<br/>Level 1: Introductory and overview material<br/>Level 2: Intermediate material (background knowledge useful)<br/>Level 3: Advanced (assumes prior subject matter knowledge)<br/>Level 4: Expert (deep level of technical knowledge)</p> ",
    "link": "https://www.meetup.com/DataBristol/events/265016012/",
    "location": {
        "address": "1 Rivergate",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45039367675781,
        "longitude": -2.583983898162842,
        "name": "OVO Energy"
    },
    "org": "databristol",
    "title": "Data Bristol: Cloud Migration - Data Warehousing & ETL in Azure"
}