{
    "description": "<p>AGENDA<br/>----------<br/>18.00 – 18:30 Meet &amp; Greet<br/>----------</p> <p>18:30 - 19:20<br/>TALK #1 (level 2) - The Modern Data Warehouse - Better, Faster, Cheaper</p> <p>David Rice and Tom Bruce from Snap Analytics share their ideas on the innovations in Data Warehousing, and explain how the old adage \"Fast, good or cheap. Pick two\" can be broken.</p> <p>They will discuss how Cloud Data Warehousing, Automated Data Pipelines and Agile Modelling are changing the equation.</p> <p>The talk will include a look at Snowflake Data Warehouse (<a href=\"https://www.snowflake.com/\" class=\"linkified\">https://www.snowflake.com/</a>).</p> <p>David is the founder of Snap Analytics, a business designed to leverage modern data platforms to deliver better business insights, faster. With more than 15 years experience in data analytics - including data warehouse design, ETL (data integration) and delivering self service analytics - he’s worked with clients including ING Bank, Barclays Capital and Jaguar Land Rover. In life and in business David is inspired by his three children and believes we should all be more inquisitive and have more fun.\". LinkedIn: <a href=\"https://www.linkedin.com/company/18507124\" class=\"linkified\">https://www.linkedin.com/company/18507124</a></p> <p>Tom is the Co-founder and Delivery Lead at Snap Analytics, a business designed to leverage modern data platforms to deliver better business insights, faster. He has extensive experience designing and delivering enterprise data warehouse and analytics solutions, with core functional expertise in Finance and Marketing. His previous clients include Jaguar Land Rover, Deutsche Bank and Carlsberg. A key focus for Tom is ensuring that functions across the business collaborate as a team to help foster innovation.</p> <p>----------<br/>19.20 – 19:40 Break &amp; Pizza<br/>----------</p> <p>19:40 - 20:30<br/>TALK #2 (level 1) – SQL Server Master Data Services</p> <p>John Kirby takes a look at MDS in SQL Server and how it provides a robust solution for manual reference/seed master data, rather than error-prone shared network files.</p> <p>If you don't know about MDS, and/or are frustrated with unreliable source files in your ETL process, this talk is for you.</p> <p>MDS is a component of SQL Server 2008R2 to[masked]-bit Enterprise and BI editions. It plugs in to Excel to provide data stewards a familiar, easy way to provide manual master data to the data warehouse. The data is validated and stored in a central database which your ETL can pull from.</p> <p>It hasn't changed a lot along the SQL lifespan. The differences will be mentioned in the talk.</p> <p>John is the organiser of the Subject Data: Bristol meetup (formerly Data Bristol). He is a Microsoft Data consultant with 8 years experience, mainly in finance, following 6 years as a web systems engineer.<br/><a href=\"https://www.linkedin.com/in/john-kirby-2b252154/\" class=\"linkified\">https://www.linkedin.com/in/john-kirby-2b252154/</a></p> <p>----------<br/>20:30 - Pub<br/>----------</p> <p>EVENT SPONSORS<br/>----------<br/>We would like to thank our generous sponsors for supporting us:</p> <p>Just Eat (<a href=\"https://www.just-eat.co.uk/\" class=\"linkified\">https://www.just-eat.co.uk/</a>)</p> <p>WHEN AND WHERE<br/>----------<br/>The venue is: Just Eat, Broad Quay House, Broad Quay, Bristol BS1 4DJ. If for any reason, you cannot make it, please un-RSVP in good time.</p> <p>LEVELS<br/>----------<br/>Level 1: Introductory and overview material<br/>Level 2: Intermediate material (background knowledge useful)<br/>Level 3: Advanced (assumes prior subject matter knowledge)<br/>Level 4: Expert (deep level of technical knowledge)</p> ",
    "end_time": 1579120200,
    "link": "https://www.meetup.com/DataBristol/events/266899199/",
    "location": {
        "address": "Broad Quay",
        "city": "City of Bristol",
        "country": "gb",
        "latitude": 51.4517936706543,
        "longitude": -2.596950054168701,
        "name": "Just Eat"
    },
    "org": "databristol",
    "start_time": 1579111200,
    "title": "Cloud Data Warehousing and Master Data Services"
}