{
    "cancelled": false,
    "description": "<p>We're very pleased to announce our upcoming event exploring Scala on Microsoft Azure Databricks (an Apache Spark-based analytics platform). This is an online event and one of a number we are planning in the coming weeks that we would like to welcome you to.</p> <p>AGENDA: 19:00 - 20:00<br/>----------<br/>SPEAKER: Anna Maria-Wykes (Subject Data: Bristol co-organiser)<br/>TOPIC: Taking the Scary out of Scala (Level 2)</p> <p>Databricks is one of the fastest growing tech startups, but did you know that spark is mostly written in Scala? And yet many people focus on the familiar, sticking to our trusted friends Python, SQL or R. But if you want to get deep into Databricks, it is inevitable you will have to dip your toes at some point into those uncharted Scala waters... but it's not as scary as you think.</p> <p>In this session we will explore some of the basics when writing Scala. Empowering you to start writing some code, and giving you a basic tool-set to pull out when Scala comes knocking in your Databricks projects.</p> <p>-- Bio --<br/>Anna is a veteran software &amp; data engineer, with over 14 years of experience. She’s tackled projects from real-time analytics with Scala &amp; Kafka, building out Data Lakes with spark and applying engineering to Data Science. Anna is a senior consultant with Advancing Analytics, helping shape &amp; evolve their data engineering practice. She has a real passion for data and strives to bring the worlds of Software Development and Data Science closer together. Other areas of interest include UX, Agile methodologies, and helping to organize/run local Code Clubs.</p> <p>WHEN AND WHERE<br/>----------<br/>This is an online event via the Microsoft Teams platform. Full meeting details will be emailed to attendees no later than 1 hour prior to the event. You can view the event via your web browser or using the Teams application.</p> <p>LEVELS<br/>----------<br/>Level 1: Introductory and overview material<br/>Level 2: Intermediate material (background knowledge useful)<br/>Level 3: Advanced (assumes prior subject matter knowledge)<br/>Level 4: Expert (deep level of technical knowledge)</p> ",
    "end_time": 1593027000,
    "link": "https://www.meetup.com/DataBristol/events/271271340/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "databristol",
    "start_time": 1593021600,
    "title": "Taking the Scary out of Scala [Online Event]"
}