{
    "cancelled": false,
    "description": "<p>Please note, this is an online event and one of a number we are planning in the coming weeks that we would like to welcome you to.</p> <p>TALK<br/>Database DevOps Anti-patterns (aka. How to screw up your ability to deliver database updates in 16 simple steps)</p> <p>A cheerful review of the 16 most popular strategies for screwing up your ability to deliver your users’ data requirements. In the session I describe fifteen database DevOps anti-patterns:</p> <p>- Fear every change<br/>- Wait until you are already screwed<br/>- Build a tangled web of databases<br/>- Customize each production instance<br/>- Don’t use a standard source control process<br/>- Impose new process on underlings<br/>- Don’t provide any training<br/>- Use the wrong model/migration approach<br/>- Hot-fix all the problems in production<br/>- Don’t use branching or tagging<br/>- Use branches to solve every problem<br/>- Re-invent the wheel<br/>- Have a functional stand-off<br/>- Create a DevOps teams/role<br/>- Give up</p> <p>SPEAKER<br/>Alex Yates</p> <p>BIO<br/>Alex Yates has been helping organisations to apply DevOps principles to relational database development and deployment since 2010. He’s most proud of helping Skyscanner develop the ability to deploy 95 times a day. Originally for Redgate, later for DLM Consultants, Alex has worked with clients on every continent except Antarctica – so he’s keen to meet anyone who researches penguins.</p> <p>A keen community member, he co-organises Data Relay, is the founder of www.SpeakingMentors.com and has been recognised as a Microsoft Data Platform MVP since 2017.</p> ",
    "end_time": 1593630000,
    "link": "https://www.meetup.com/DataBristol/events/271393105/",
    "location": {
        "address": null,
        "city": null,
        "country": "",
        "latitude": null,
        "longitude": null,
        "name": "Online event"
    },
    "org": "databristol",
    "start_time": 1593626400,
    "title": "Database DevOps Anti-patterns [Online Event]"
}