{
    "cancelled": false,
    "description": "<p>Data Bristol are excited to announce our first IN PERSON event in over two years! We will be at an amazing new venue, Immersive Labs</p> <p>AGENDA</p> <p>18.00 – 18:30 Meet &amp; Greet<br/>18:30 - 19:20 TALK #1 **Andrew Pruski: Deploying SQL Server to Kubernetes using Helm**</p> <p>Blog: [dbafromthecold.com](<a href=\"https://t.co/THf4L9N3JO\" class=\"linkified\">https://t.co/THf4L9N3JO</a>) Twitter: @dbafromthecold</p> <p>Helm is a package manager for Kubernetes which simplifies deployments to Kubernetes.<br/>With Helm, applications are bundled into Charts which makes it easy to build, install, upgrade, and share complex Kubernetes applications.</p> <p>In this session we'll go over exactly what Helm is, the benefits it brings, and how to deploy SQL Server to Kubernetes.<br/>Then we'll look at upgrading SQL Server using Helm and then rolling back to a previous version.<br/>Once that's covered, we'll look at creating our own SQL Server Helm Charts and storing them in a Chart Repository.</p> <p>This session is for anyone who has worked with Kubernetes and want to learn about Helm. Each topic covered in this session will be accompanied with live demos.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19.20 – 19:40 Break &amp; Pizza</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19:40 - 20:30 Talk 2: We are still finalising our second speaker, and will update you as soon as we have anything to share.......</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>20:30 - Chat and pub</p> <p>**EVENT SPONSORS**</p> <p>We would like to thank our generous sponsors for supporting us:<br/>Immersive Labs (<a href=\"https://www.immersivelabs.com/\" class=\"linkified\">https://www.immersivelabs.com/</a>), Huboo (<a href=\"https://www.huboo.com/\" class=\"linkified\">https://www.huboo.com/</a>)</p> <p>**WHEN AND WHERE**</p> <p>The venue is: Immersive Labs, The Programme, All Saints’ St, Bristol, United Kingdom, BS1 2LZ</p> ",
    "end_time": 1657827000,
    "link": "https://www.meetup.com/databristol/events/286684384/",
    "location": null,
    "org": "databristol",
    "start_time": 1657818000,
    "title": "Deploying SQL Server to Kubernetes using Helm"
}