{
    "cancelled": false,
    "description": "<p>Data Bristol are excited to announce our first IN PERSON event in over two years! We will be at an amazing new venue, Immersive Labs</p> <p>AGENDA</p> <p>18.00 – 18:30 Meet &amp; Greet<br/>18:30 - 19:20 TALK #1 **Andrew Pruski: Deploying SQL Server to Kubernetes using Helm**</p> <p>Blog: [dbafromthecold.com](<a href=\"https://t.co/THf4L9N3JO\" class=\"linkified\">https://t.co/THf4L9N3JO</a>) Twitter: @dbafromthecold</p> <p>Helm is a package manager for Kubernetes which simplifies deployments to Kubernetes.<br/>With Helm, applications are bundled into Charts which makes it easy to build, install, upgrade, and share complex Kubernetes applications.</p> <p>In this session we'll go over exactly what Helm is, the benefits it brings, and how to deploy SQL Server to Kubernetes.<br/>Then we'll look at upgrading SQL Server using Helm and then rolling back to a previous version.<br/>Once that's covered, we'll look at creating our own SQL Server Helm Charts and storing them in a Chart Repository.</p> <p>This session is for anyone who has worked with Kubernetes and want to learn about Helm. Each topic covered in this session will be accompanied with live demos.</p> <p>Andrew Pruski is a SQL Server DBA, Microsoft Data Platform MVP, and Certified Kubernetes Administrator. You can find him on twitter @dbafromthecold and blogging at [dbafromthecold.com](<a href=\"http://dbafromthecold.com\" class=\"linkified\">http://dbafromthecold.com</a>) or LinkedIn<br/>[<a href=\"https://www.linkedin.com/in/andrewpruski/](https://www.linkedin.com/in/andrewpruski/\" class=\"linkified\">https://www.linkedin.com/in/andrewpruski/](https://www.linkedin.com/in/andrewpruski/</a>)</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19.20 – 19:40 Break &amp; Pizza</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19:40 - 20:30 Talk 2# **Phil Austin: SQL querying: Pick &amp; Mix of Tips and Tricks**</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/phil-austin-44147415/\" class=\"linkified\">https://www.linkedin.com/in/phil-austin-44147415/</a></p> <p>Short talk about common querying situations and what works and what doesn’t work quite as well, when writing SQL. Based on an entirely subjective choice of 4-5 scenarios and examples seen in the field, its intended to guide people to write more efficient and performant SQL and expand the understanding of the options developers and engineers have when writing queries.</p> <p>Phil has spent over 20 years down the data mines, working for household names and total unknowns. He knows a fair bit about BI and data warehousing using SQL Server and Azure. He also takes an interest in automation, development lifecycle and what is now known as DevOps, but don’t hold that against him. Outside of that you might see him hacking around Bristol on a bike, sometimes for charity. If you buy him a drink he might tell you about the time a Nokia executive told him Apple don’t know anything about phones</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>20:30 - Chat and pub</p> <p>**EVENT SPONSORS**</p> <p>We would like to thank our generous sponsors for supporting us:<br/>Immersive Labs (<a href=\"https://www.immersivelabs.com/\" class=\"linkified\">https://www.immersivelabs.com/</a>), Huboo (<a href=\"https://www.huboo.com/\" class=\"linkified\">https://www.huboo.com/</a>)</p> <p>**WHEN AND WHERE**</p> <p>The venue is: Immersive Labs, The Programme, All Saints’ St, Bristol, United Kingdom, BS1 2LZ</p> ",
    "end_time": 1657827000,
    "link": "https://www.meetup.com/databristol/events/286684384/",
    "location": {
        "address": "All Saints' Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.456138610839844,
        "longitude": -2.5929958820343018,
        "name": "Immersive Labs"
    },
    "org": "databristol",
    "start_time": 1657818000,
    "title": "Deploying SQL Server to Kubernetes using Helm / SQL: Pick & Mix of Tips & Tricks"
}