{
    "cancelled": false,
    "description": "<p>AGENDA</p> <p>18.00 – 18:30 Meet &amp; Greet</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>18:30 - 19:00 TALK #1 **Niall Langley**<br/>**Introduction to Databricks Delta Live Tables - Part 1**</p> <p>Delta Live Tables is a new framework available in Databricks that aims to accelerate building data pipelines by providing out of the box scheduling, dependency resolution, data validation and logging.</p> <p>We'll cover the basics, and then get into the demo's to show how we can:<br/>\\- Setup a notebook to hold our code and queries<br/>\\- Ingest quickly and easily into bronze tables using Auto Loader<br/>\\- Create views and tables on top of the ingested data using SQL and/or python to build our silver and gold layers<br/>\\- Create a pipeline to run the notebook<br/>\\- See how we can run the pipeline as either a batch job\\, or as a continuous job for low latency updates<br/>\\- Use APPLY CHANGES INTO to upsert changed data into a live table<br/>\\- Apply data validation rules to our live table definition queries\\, and get detailed logging info on how many records caused problems on each execution\\.</p> <p>By the end of the session you should have a good view of whether this can help you build our your next data project faster, and make it more reliable.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19.00 – 19:30 Break &amp; Pizza</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19:30 - 20:00 Talk 2# **Niall Langley**<br/>**Introduction to Databricks Delta Live Tables - Part 2**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>20:00 - Chat and pub</p> <p>**EVENT SPONSORS**</p> <p>We would like to thank our generous sponsors for supporting us:<br/>Immersive Labs (<a href=\"https://www.immersivelabs.com/\" class=\"linkified\">https://www.immersivelabs.com/</a>), Huboo (<a href=\"https://www.huboo.com/\" class=\"linkified\">https://www.huboo.com/</a>)</p> <p>**WHEN AND WHERE**</p> <p>The venue is: Immersive Labs, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ</p> <p>**Speaker Bios:**</p> <p>Niall is a data engineer / architect that has been working with the Microsoft Data Platform tools for over 13 years. Originally working with SQL Server and SSIS, these days he's busy building Modern Data Platforms in Azure using Data Factory, Databricks, Data Lakes and a few other tools.</p> <p>Niall blogs occasionally, and regularly speaks at user groups and conferences in the UK, including presenting at SQL Bits for the first time in 2019. Niall also helps run the Bristol user group, and is a helper for SQL Bits and Data Relay.</p> <p>[Twitter @NiallLangley](<a href=\"https://twitter.com/NiallLangley\" class=\"linkified\">https://twitter.com/NiallLangley</a>)<br/>[LinkedIn](<a href=\"https://www.linkedin.com/in/niall-langley\" class=\"linkified\">https://www.linkedin.com/in/niall-langley</a>)<br/>[Blog](<a href=\"https://www.sqlsmarts.com/\" class=\"linkified\">https://www.sqlsmarts.com/</a>)<br/>[Company](<a href=\"https://www.sqlsmarts.com/\" class=\"linkified\">https://www.sqlsmarts.com/</a>)</p> ",
    "end_time": 1664998200,
    "link": "https://www.meetup.com/databristol/events/287146701/",
    "location": null,
    "org": "databristol",
    "start_time": 1664989200,
    "title": "Introduction to Databricks Delta Live Tables"
}