{
    "cancelled": false,
    "description": "<p>AGENDA</p> <p>18.00 – 18:30 Meet &amp; Greet</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>18:30 - 19:20 TALK #1 **Olivier Van Steenlandt**</p> <p>**Title**: Improving Team Collaboration Using Database Projects and Azure DevOps<br/>**Abstract**:<br/>Having source control in place sounds like the default these days. Although, a lot of companies didn't implement source control yet. This session will guide you how to set up source control step by step, using Database Projects and Azure DevOps. At the beginning of the session, a couple of use cases will be explained why it is important to use source control within your organization (use cases out of personal experiences). Some examples: deployments take a lot of time, change of priorities, urgent bugfixing, fast growing team perhaps... During the session, the ease of use will become clear and multiple ways how to set up source control will be explained step by step. Do you want to have everything in source control at once or would you like a phased approach, everything is possible if you know how to start. The principles of Git will be explained shortly. Near the end of the session, a couple of topics will be covered on how to move forward after a successful implementation of database projects and Azure DevOps since this is only the beginning. At the end of the session, you should have a starting position to be able to start your adventure and where you might get to in the end.</p> <p><a href=\"https://www.linkedin.com/in/oliviervansteenlandt/\" class=\"linkified\">https://www.linkedin.com/in/oliviervansteenlandt/</a></p> <p>###</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19.20 – 19:40 Break &amp; Pizza</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19:40 - 20:30 Talk 2# **Falek Miah**</p> <p>**Title:**<br/>Deploy Synapse using Terraform &amp; DevOps<br/>**Abstract:**<br/>Provision infrastructure as code is great approach to deploy resources in reliable and consistent way.<br/>Terraform and Azure DevOps can be used to automate the provisioning of Synapse in an effective and efficient way.<br/>This session will be introducing you to Terraform, Azure DevOps and Synapse providers so you can provision Synapse workspace and components into Azure cloud platform using Terraform.</p> <p><a href=\"https://www.linkedin.com/in/falekmiah/\" class=\"linkified\">https://www.linkedin.com/in/falekmiah/</a></p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>20:30 - Chat and pub</p> <p>**EVENT SPONSORS**</p> <p>We would like to thank our generous sponsors for supporting us:<br/>Immersive Labs (<a href=\"https://www.immersivelabs.com/\" class=\"linkified\">https://www.immersivelabs.com/</a>), Huboo (<a href=\"https://www.huboo.com/\" class=\"linkified\">https://www.huboo.com/</a>)</p> <p>**WHEN AND WHERE**</p> <p>The venue is: Immersive Labs, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ</p> ",
    "end_time": 1669235400,
    "link": "https://www.meetup.com/databristol/events/287146708/",
    "location": {
        "address": "All Saints' Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45588302612305,
        "longitude": -2.5926589965820312,
        "name": "Immersive Labs"
    },
    "org": "databristol",
    "start_time": 1669226400,
    "title": "DataOps: Terraform and Improving Team Collaboration Using Database Projects"
}