{
    "cancelled": false,
    "description": "<p>AGENDA</p> <p>18.00 – 18:30 Meet &amp; Greet</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>18:30 - 19:20 TALK #1 **Rob Sewell:**<br/>**Why every project needs a dev container - an introduction.**<br/>In this session we'll cover why dev containers, a VS Code feature, can be so useful, show off an example, and how you can easily add a dev container to your own projects.<br/>Further abstract and bio below.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19.20 – 19:40 Break &amp; Pizza</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>19:40 - 20:30 Talk 2# **John Martin**<br/>**Terraform - up and running.**<br/>In this session we will look at all of the elements needed to get up and running with Terraform, an Infrastructure as Code (IaC) first approach.<br/>Further abstract and bio below.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>20:30 - Chat and pub</p> <p>**EVENT SPONSORS**</p> <p>We would like to thank our generous sponsors for supporting us:<br/>Immersive Labs (<a href=\"https://www.immersivelabs.com/\" class=\"linkified\">https://www.immersivelabs.com/</a>), Huboo (<a href=\"https://www.huboo.com/\" class=\"linkified\">https://www.huboo.com/</a>)</p> <p>**WHEN AND WHERE**</p> <p>The venue is: Huboo, 41 Corn St, Bristol BS1 1HT</p> <p>**Rob Sewell: Why every project needs a dev container - an introduction**<br/>Dev containers are a VS Code feature that allow us to define the perfect development environment for our project.<br/>This enables a definition of a working development environment for all of your team or your open-source contributors to be quickly and easily provisioned and updated. It will even work in a browser! No more worrying about the right hardware, software installations, dependencies, or updates. You can control it all with dev containers and make it simple and easy.<br/>In this session we'll cover why dev containers can be so useful, show off an example we built to make contributing to dbachecks (an open-source module combining pester &amp; dbatools to test our infrastructure) easy, and how you can easily add a dev container to your own projects.<br/>**BIO**:<br/>Rob was a SQL Server DBA with a passion for PowerShell, Azure, Automation, and SQL (PaaS geddit?). Now he just helps people make things. He is a Cloud and Data Center MVP and a Data Platform MVP, co-leader of Data South West UK User Group and PSConf EU organiser and has spoken at and volunteered at many Data and PowerShell events all over the world. He is a proud supporter of the Data and PowerShell communities.<br/>He relishes sharing and learning and can be found doing both via Twitter and his blog. He spends most of his time looking at a screen and loves to solve problems. He knows that looking at a screen so much is bad for him because his wife tells him so. Thus, he is often out riding his bike as his eyes are not good enough to play cricket any more<br/>He has a fabulous beard</p> <p>**John Martin: Terraform - up and running**<br/>When working with cloud platforms we really ought to be taking an Infrastructure as Code (IaC) first approach. Meaning, we should be defining our resources as code for repeatable, reliable, deployment. Each cloud vendor has their own flavour of IaC, but what if we work with multiple cloud providers or hybrid environments?<br/>Terraform is an IaC option which provides a cloud agnostic syntax for defining resources for all the major cloud vendors, VMware, and many other SaaS and software systems. What does this mean? Well, it means that we can standardise on one tool to work with for cloud specific resource definitions, speeding up our time to value and delivering results.<br/>In this session we will look at all of the elements needed to get up and running with Terraform. We will look at the key elements of the Terraform syntax, software components, and development environment. Then we will dive in to look at how to create a Terraform project to deploy Amazon RDS for SQL Server ready for us to use. This will cover how to declare variables, resource definitions, use of locals, implicit and explicit dependencies and outputs.<br/>By the end of this session you will be able to implement basic Terraform projects to deploy resources for your environments with the appropriate provider.<br/>**BIO:**<br/>Data Platform and Cloud specialist, Chartered IT Professional.<br/>John is an experienced data platform professional having spent over a decade working with Several data and cloud platform technologies.<br/>Currently specialising in Amazon Redshift but also with a long history in Microsoft SQL Server wherever it is deployed as well as key Amazon data platform technologies including Amazon Aurora, and Amazon Athena.<br/>Throughout his career, John has learned how to get the most out of these platforms as well as the key pitfalls that should be avoided.</p> ",
    "end_time": 1663183800,
    "link": "https://www.meetup.com/databristol/events/287146629/",
    "location": null,
    "org": "databristol",
    "start_time": 1663174800,
    "title": "Dev Containers and Terraform IAC"
}