{
    "cancelled": false,
    "description": "<p>Sponsored by Broadridge Fund Communication Solutions - [<a href=\"https://www.broadridge.com/resource/fund-communication-solutions](https://www.broadridge.com/resource/fund-communication-solutions\" class=\"linkified\">https://www.broadridge.com/resource/fund-communication-solutions](https://www.broadridge.com/resource/fund-communication-solutions</a>)<br/>Location: St Catherine's Court, Berkeley Pl, Clifton, Bristol BS8 1BQ</p> <p>AGENDA<br/>**18.00 – 18:30 Meet &amp; Greet**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:30 - 19:15 Getting started with Visual Studio database projects, what, how, and why by Chris Johnson**</p> <p>Visual Studio database projects (or SSDT projects) are often compared to other source control systems, and usually found wanting. They are a bit clunkier, and require a developer to jump through more hoops to achieve the same results as they could with another product.<br/>However, this is largely because they are not just designed as a source control tool. In fact, I would argue their primary purpose is to turn a database into a coding project, and being able to put that project under source control is just one of the benefits that come with that.<br/>In this session I will take you through what I mean by that, how you can leverage this technology, and why you would want to use it over other source control systems. This will be a mix of slides to go through some of the principals involved, and demos that will import databases into database projects and deploy them back out to a server. In doing this I will cover what it means to turn a database into a code project, including features like easy refactoring, code validation, and (most exciting) the ability to split your database across several projects, and re-use code from one project across many databases.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**19:15 - 19:45 Pizza and Networking**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Talking the “Public” out of Public Clouds: Getting Started with Azure Private Endpoints by Grace O'Halloran**</p> <p>If you're working in the cloud, sooner or later you'll come across someone who cries out that the cloud is not secure, that your data is exposed to the internet as a whole. With the right structures in place, this is simply not true… but what are the right structures? How do you go about changing a public-facing resource into a private resource only accessible from your own networks, whilst still retaining all the benefits of the cloud? This is where private endpoints come in - they're a powerful tool you can use to secure your Azure data estate.</p> <p>We’ll begin by covering what a private endpoint is and why they make your platform more secure. We’ll then go through the core elements required to facilitate private endpoint connectivity, including Private DNS Zones, A Records and Virtual Network Links. We’ll also step through a demo of how to deploy and configure a private endpoint, and we’ll wrap up by discussing some common mistakes to avoid when working with private endpoints.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**20:30 - Pub**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> ",
    "end_time": 1682020800,
    "link": "https://www.meetup.com/databristol/events/291953978/",
    "location": {
        "address": "Berkeley Place",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45613479614258,
        "longitude": -2.6085519790649414,
        "name": "Broadridge Fund Communication Solutions"
    },
    "org": "databristol",
    "start_time": 1682010000,
    "title": "VS Database Projects , Azure Private Endpoints"
}