{
    "cancelled": false,
    "description": "<p>Sponsored by Broadridge Fund Communication Solutions - [<a href=\"https://www.broadridge.com/resource/fund-communication-solutions](https://www.broadridge.com/resource/fund-communication-solutions\" class=\"linkified\">https://www.broadridge.com/resource/fund-communication-solutions](https://www.broadridge.com/resource/fund-communication-solutions</a>)<br/>Location: St Catherine's Court, Berkeley Pl, Clifton, Bristol BS8 1BQ</p> <p>AGENDA<br/>**18.00 – 18:30 Meet &amp; Greet**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:30 - 19:15 Adventures of an Analytics Engineer: Bringing Power BI to Databricks by Johnny Winter**</p> <p>Picture the scene... you've just joined a world-renowned data engineering practice with one of the THE cutting edge Data Lakehouse frameworks. And your imposter syndrome is running wild, as you're \"just the Power BI guy\". How can you bring your craft to the table whilst also drawing inspiration from the world class engineers you're surrounded by? This is the tale of Aggreg8. A Power BI framework designed to bring data ops and engineering principles to enterprise Power BI development, striving to be THE best way to implement Power BI on the Lakehouse.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**19:15 - 19:45 Pizza and Networking**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Talking the “Public” out of Public Clouds: Getting Started with Azure Private Endpoints by Grace O'Halloran**</p> <p>If you're working in the cloud, sooner or later you'll come across someone who cries out that the cloud is not secure, that your data is exposed to the internet as a whole. With the right structures in place, this is simply not true… but what are the right structures? How do you go about changing a public-facing resource into a private resource only accessible from your own networks, whilst still retaining all the benefits of the cloud? This is where private endpoints come in - they're a powerful tool you can use to secure your Azure data estate.</p> <p>We’ll begin by covering what a private endpoint is and why they make your platform more secure. We’ll then go through the core elements required to facilitate private endpoint connectivity, including Private DNS Zones, A Records and Virtual Network Links. We’ll also step through a demo of how to deploy and configure a private endpoint, and we’ll wrap up by discussing some common mistakes to avoid when working with private endpoints.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**20:30 - Pub**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> ",
    "end_time": 1682020800,
    "link": "https://www.meetup.com/databristol/events/291953978/",
    "location": {
        "address": "Berkeley Place",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45613479614258,
        "longitude": -2.6085519790649414,
        "name": "Broadridge Fund Communication Solutions"
    },
    "org": "databristol",
    "start_time": 1682010000,
    "title": "Power BI with Databricks, Azure Private Endpoints"
}