{
    "cancelled": false,
    "description": "<p>Sponsored by Made Talent - [<a href=\"https://www.madetalent.co.uk/](https://www.madetalent.co.uk/\" class=\"linkified\">https://www.madetalent.co.uk/](https://www.madetalent.co.uk/</a>)<br/>Location: Made Talent , 31 Great George St, Bristol BS1 5QD</p> <p>AGENDA<br/>**18.00 – 18:30 Meet &amp; Greet**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**18:30 - 19:15 Why the Lakehouse?** by **Craig Porteous**</p> <p>Everyone's talking about data Lakehouse's but what is a Lakehouse other than a nice place to go fishing? Why do you need to know about the Lakehouse architecture, what's the benefits and is it all just hype?</p> <p>In this session I'll cover what the Data Lakehouse architecture is, where it fits against existing architectures like a data warehouse, and why you should build one. We'll also cover the underlying technology options to arm you with all of the information you need to plan your next data platform.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**19:15 - 19:45 Pizza and Networking**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Deep Dive into Databricks SQL  by** **Zach Stagers**</p> <p>Data lakes continue to grow into an industry standard method of storing data for analytical and data science workloads, but lakes themselves are just that - storage. We need a tool offering compute to give us the ability to explore and query data in the lake. There are several options available to supply this compute, but they each operate in different ways and have different capabilities. <br/> <br/>This demo-heavy session we'll begin by introducing the Lakehouse and where it's evolved from. We'll discuss the challenges of querying lake-based data and why a serving tool is required, briefly explore some serving options, before diving deeper into Databricks SQL. We'll look at it as a standard serving and querying tool, but also review it's unique selling points, internals, and integrations. <br/> <br/>This session is intended for anyone wanting to learn more about how to query lake-based data. We'll begin with a level 100 introduction before building into some intermediate topics. This session expects you to be comfortable with SQL.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**20:30 - Pub**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**About Made Talent**<br/>We engage passionate people to build communities of highly skilled talent who want to apply their skills for good. We supply this passionate talent into the Tech for Good sector and increase recruitment and retention success for Tech for Good businesses. We help new people apply their skills for good across booming industries in the Tech for Good world.</p> ",
    "end_time": 1684958400,
    "link": "https://www.meetup.com/databristol/events/292112365/",
    "location": {
        "address": "31 Great George Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4527587890625,
        "longitude": -2.605180025100708,
        "name": "Made Talent"
    },
    "org": "databristol",
    "start_time": 1684947600,
    "title": "Lakehouse and Databricks SQL"
}