{
    "cancelled": false,
    "description": "<p>Sponsored by Amdaris - [<a href=\"https://amdaris.com](https://amdaris.com\" class=\"linkified\">https://amdaris.com](https://amdaris.com</a>)<br/>Amdaris is your trusted partner for high velocity extended delivery teams.<br/>Location: Amdaris, Finzels Reach, Aurora, Bristol BS1 6BX</p> <p>AGENDA<br/>**18.00 – 18:30 Meet &amp; Greet**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**18:30 - 19:15 DataOps** by **Jonathan D'Aloia**</p> <p>In this session I will demonstrate how you can implement private link technology to secure your PAAS components across your Data-Platform.</p> <p>Private endpoints are talked about more and more therefore as part of this session I will describe what Private Link technology is. I'll then go on to demonstrate the use cases for Private Link, the considerations that need to be taken into account and some example architectures that can be used when implementing across modern Data-Platforms.</p> <p>I will also show how Private Link can be deployed and implemented through Infrastructure as code to enable you to scale and deploy Private Link in a consistent and secure way.</p> <p>In this session I'll cover what the Data Lakehouse architecture is, where it fits against existing architectures like a data warehouse, and why you should build one. We'll also cover the underlying technology options to arm you with all of the information you need to plan your next data platform.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**19:15 - 19:45 Pizza and Networking**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Introduction to Data Build Tools** by **Zach Stagers**</p> <p>DBT stands for Data Build Tools and has become a leading choice for Transformation in the ELT data stack. DBT is a transformation workflow that can generate boilerplate, modularize your logic and generate test and error logic on the data itself. We will see how this can help us manage our SQL and business logic.</p> <p>We'll begin with a level 100 introduction that will build on concepts. This session expects you to be comfortable with SQL and a very basic understanding on python.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**20:30 - Pub**<br/>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**About Amdaris**<br/>Of course, we’re obsessed with cutting-edge technology but it’s how much we care about people that sets us apart. Whether that’s looking after our clients, our staff or the next generation of tech talent, we know that exceptional software development is only possible with exceptional teamwork.<br/>**If you need help extending your team, building your big idea or application support, we offer a better way to do software.**</p> ",
    "end_time": 1690488000,
    "link": "https://www.meetup.com/databristol/events/294885539/",
    "location": {
        "address": "Finzels Reach",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45358657836914,
        "longitude": -2.5879149436950684,
        "name": "Amdaris"
    },
    "org": "databristol",
    "start_time": 1690477200,
    "title": "DataOps and Data Build Tools DBT"
}