{
    "cancelled": false,
    "description": "<p>Sponsored by Amdaris - [<a href=\"https://amdaris.com](https://amdaris.com\" class=\"linkified\">https://amdaris.com](https://amdaris.com</a>)</p> <p>Amdaris is your trusted partner for high velocity extended delivery teams.</p> <p>Location: Amdaris, Finzels Reach, Aurora, Bristol BS1 6BX</p> <p>AGENDA</p> <p>**18.00 – 18:30 Meet &amp; Greet**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:30 - 19:15 Introduction to Tuning Spark on Databricks and Fabric** by **Niall Langley**</p> <p>More details coming soon</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:15 - 19:45 Pizza and Networking**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Want End-to-End MLOps?** **Look no further than Databricks!** by **Tori Tompkins**</p> <p>Arguably the largest challenge in ML today is effectively deploying reliable and efficient models into production, with experts quoting that as many as 90% of model created never make it to production. MLOps streamlines the process of taking machine learning models to production, and then maintaining and monitoring them. With new MLOps micro-venders popping up every day, is there a tool that does everything?</p> <p>In this session, we will consider Databricks as an end-to-end MLOps tool, exploring collaborative workspaces, feature stores, model registries and model serving. We will also touch upon other critical MLOps practices such as model fairness, explainability and monitoring.</p> <p>Including practical demos of Databricks Feature Store, MLFlow and real-time Model Serving, this session is suitable for Data Scientists and Machine Learning Engineers of all levels.</p> <p><a href=\"https://www.linkedin.com/in/tompkinstori/\" class=\"linkified\">https://www.linkedin.com/in/tompkinstori/</a></p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**20:30 - Pub**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**About Amdaris**</p> <p>Of course, we’re obsessed with cutting-edge technology but it’s how much we care about people that sets us apart. Whether that’s looking after our clients, our staff or the next generation of tech talent, we know that exceptional software development is only possible with exceptional teamwork.</p> <p>**If you need help extending your team, building your big idea or application support, we offer a better way to do software.**</p> ",
    "end_time": 1694721600,
    "link": "https://www.meetup.com/databristol/events/295786274/",
    "location": {
        "address": "Finzels Reach",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45358657836914,
        "longitude": -2.5879149436950684,
        "name": "Amdaris"
    },
    "org": "databristol",
    "start_time": 1694710800,
    "title": "Databricks & Fabric Tuning, and MLOps "
}