{
    "cancelled": false,
    "description": "<p>Talks about Artificial Intelligence and Human Interaction. More details below. Open to EVERYONE, Data Bristol and [Bristol Girl Geek Dinners](<a href=\"https://www.meetup.com/bristol-girl-geek-dinners/\" class=\"linkified\">https://www.meetup.com/bristol-girl-geek-dinners/</a>) team up to bring some great talks and some networking at our awesome hosts [Amdaris](<a href=\"https://amdaris.com/\" class=\"linkified\">https://amdaris.com/</a>), an Insight company.</p> <p>Data Bristol is, and has always been, an inclusive group. Teaming up with Bristol Girl Geek Dinners, and Women's Tech Hub, is a great opportunity to increase our support for equality and diversity.</p> <p>**6:00pm Arrive, drinks and networking**.</p> <p>**6:30pm Talk by Tamsin Huggins and Alexandra Craciun:**</p> <p>***AI and Human Interaction***</p> <p>Tamsin and Alexandra are teaming up to discuss Human-AI Interaction. Tamsin will kick things off by outlining the landscape of Human-Centred AI (HCAI), an interdisciplinary field which furthers AI to complement human capabilities, needs, and values. Tamsin will then dive into the topic of her research master’s: interactive AI for creative collaboration. Seeing as speech is a crucial mode of human-AI interaction, Alexandra will explore the fascinating journey of how speech interaction evolved: from chatbots, to smart devices and even to multimodal general artificial intelligence (GAI). She will talk about the importance of natural, human-like speech interaction, as well as the crucial aspect of speech privacy. Get ready for an enlightening discussion that bridges the gap between humans and technology!</p> <p>**7:15pm Talk by Adebola “Debs” Adegbulugbe:**</p> <p>***The Perfect Blend: Combining Generative AI and Human Ingenuity for Content Marketing Success***</p> <p>The presentation will explore the powerful fusion of generative AI and human creativity in the world of content marketing. Looking at a couple of examples we’ll delve into the ways in which these two forces can collaboratively transform and optimize content creation processes, ultimately leading to enhanced marketing outcomes. Lastly, we’ll touch on future job titles predicted to grow out of this collaboration.</p> <p>**7:45pm Pizza, Drinks, Networking**</p> <p>**8:30pm Pub - Left Handed Giant**</p> <p>**About Amdaris - [<a href=\"https://amdaris.com/](https://amdaris.com/\" class=\"linkified\">https://amdaris.com/](https://amdaris.com/</a>)**<br/>We are Amdaris, an Insight company, and at our core we specialise in extending teams with highly skilled software experts. With bespoke Software Development, Product Design, Strategy and Consultation, Managed Services and Data Solutions, we seamlessly integrate into your business and culture, bringing passion, care, and technical proficiency directly to you.</p> <p>Here's some links to Women's Tech Hub and Girl Geek socials you might like to check out:</p> <p>**Facebook:**<br/>[Bristol Girl Geek Dinners](<a href=\"https://www.facebook.com/groups/231632375942\" class=\"linkified\">https://www.facebook.com/groups/231632375942</a>)<br/>[Bath Girl Geek Dinners](<a href=\"https://www.facebook.com/groups/BathGirlGeeks\" class=\"linkified\">https://www.facebook.com/groups/BathGirlGeeks</a>)<br/>[Womens' Tech Hub group](<a href=\"https://www.facebook.com/groups/201134810219833\" class=\"linkified\">https://www.facebook.com/groups/201134810219833</a>)<br/>[Womens' Tech Hub Page](<a href=\"https://www.facebook.com/wthub.dit2017\" class=\"linkified\">https://www.facebook.com/wthub.dit2017</a>)</p> <p>**Linkedin:**<br/>[Womens Tech Hub Group](<a href=\"https://www.linkedin.com/groups/8494838/\" class=\"linkified\">https://www.linkedin.com/groups/8494838/</a>)<br/>[Womens' Tech Hub Page](<a href=\"https://www.linkedin.com/company/21816989/admin/feed/posts/\" class=\"linkified\">https://www.linkedin.com/company/21816989/admin/feed/posts/</a>)</p> <p>**Web:**<br/>[Women's Tech Hub](<a href=\"https://www.wthub.org/what-we-do/networking/\" class=\"linkified\">https://www.wthub.org/what-we-do/networking/</a>)</p> <p>**X Pro (twitter):**<br/>@Women’sTechHub<br/>@bristolggd<br/>@bathggd<br/>@womentechfounders</p> <p>Photos: We ask that you do NOT take photos at this meetup. We will invite people to be included in a group photo/s during the event. Speakers will let you know if it's okay to photograph their presentation (excluding other attendees).</p> <p>You may see organisers taking photos during the talks. These will be of speakers, if they have agreed to this, and will not include faces of attendees.</p> ",
    "end_time": 1697745600,
    "link": "https://www.meetup.com/databristol/events/296249019/",
    "location": {
        "address": "Finzels Reach",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45358657836914,
        "longitude": -2.5879149436950684,
        "name": "Amdaris"
    },
    "org": "databristol",
    "start_time": 1697734800,
    "title": "AI and Human Interaction - Joint Talks with Bristol Girl Geek Dinners"
}