{
    "cancelled": false,
    "description": "<p>Hosted by Amdaris, an Insight company - [<a href=\"https://amdaris.com](https://amdaris.com\" class=\"linkified\">https://amdaris.com](https://amdaris.com</a>) and sponsored by Cloud Formations - [<a href=\"https://www.cloudformations.org](https://www.cloudformations.org/\" class=\"linkified\">https://www.cloudformations.org](https://www.cloudformations.org/</a>)</p> <p>Amdaris is your trusted partner for high velocity extended delivery teams.</p> <p>Cloud Formations provides No Nonsense Consulting on Data Strategy, Design, Delivery, and Training.</p> <p>Location: Amdaris, Finzels Reach, Aurora, Bristol BS1 6BX</p> <p>AGENDA</p> <p>**18.00 – 18:30 Meet &amp; Greet**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:30 - 19:15 From Theory to Practice - Building a Data Mesh Architecture in Azure** by **[Paul Andrew](<a href=\"https://www.linkedin.com/in/mrpaulandrew/\" class=\"linkified\">https://www.linkedin.com/in/mrpaulandrew/</a>)**</p> <p>The principals of a data mesh architecture have been around for a while now, but we still don’t have a clear way to deliver such a platform in Azure. Are the concepts so abstract that it’s hard to translate the principals into real world requirements and maybe even harder to think about what technology you might need to deploy within your Azure tenant.</p> <p>In this session, we’ll explore options for building scalable data products in Azure, following Data Mesh architecture principals. Turning the theory into practice. What data storage technology should be used? Does it matter? What endpoints should be exposed for the products across the overall mesh? And what resource(s) should sit at the centre of the Data Mesh? Answers to all these questions are more as we turn the theory of a Data Mesh architecture into practice. Including, how to dissect the planes of the Data Mesh using Azure concepts.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:15 - 19:45 Pizza and Networking**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Migrating to Azure - Panel QnA** with \\*\\*[Paul Andrew](<a href=\"https://www.linkedin.com/in/mrpaulandrew/\" class=\"linkified\">https://www.linkedin.com/in/mrpaulandrew/</a>), [Rob Sewell ](<a href=\"https://www.linkedin.com/in/robsewellsqldba/)\\*\\*and\" class=\"linkified\">https://www.linkedin.com/in/robsewellsqldba/)\\*\\*and</a> **[Dan Addy](<a href=\"https://www.linkedin.com/in/daniel-addy/\" class=\"linkified\">https://www.linkedin.com/in/daniel-addy/</a>)**</p> <p>Bring your questions and challenges about migrating to Azure Data Platform for an open question-and-answer session with an exceptionally skilled and experienced panel! This is a rare opportunity. Talk and connect with other data professionals considering or implementing migration projects.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**20:30 - Pub**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**Notes**</p> <p>* **Bicycle parking**: We do *not* have arrangements with the venue for secure storage. There are public bicycle stands by Spicer and Cole/Premier Inn (to the left of Amdaris). Bicycles are left at your own risk</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**About Amdaris - [<a href=\"https://amdaris.com/](https://amdaris.com/\" class=\"linkified\">https://amdaris.com/](https://amdaris.com/</a>)**</p> <p>We are Amdaris, an Insight company, and at our core we specialise in extending teams with highly skilled software experts. With bespoke Software Development, Product Design, Strategy and Consultation, Managed Services and Data Solutions, we seamlessly integrate into your business and culture, bringing passion, care, and technical proficiency directly to you.</p> <p>**About Cloud Formations - [<a href=\"https://www.cloudformations.org/](https://www.cloudformations.org/\" class=\"linkified\">https://www.cloudformations.org/](https://www.cloudformations.org/</a>)**</p> <p>We partner for the journey to achieve a common goal, from siloed data solutions to scalable, value driven data platforms. Ensuring foundations that support the strategic direction of the business. Our loyalty is to your success through innovation and excellence, informed by decades of experience in the industry.</p> ",
    "end_time": 1700168400,
    "link": "https://www.meetup.com/databristol/events/296405353/",
    "location": {
        "address": "Finzels Reach",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45358657836914,
        "longitude": -2.5879149436950684,
        "name": "Amdaris"
    },
    "org": "databristol",
    "start_time": 1700157600,
    "title": "Building a Data Mesh and Migrating to Azure QnA"
}