{
    "cancelled": false,
    "description": "<p>Hosted by Amdaris, an Insight company - [<a href=\"https://amdaris.com](https://amdaris.com\" class=\"linkified\">https://amdaris.com](https://amdaris.com</a>) and sponsored by Data Masterminds - [<a href=\"https://datamasterminds.io/](https://datamasterminds.io/\" class=\"linkified\">https://datamasterminds.io/](https://datamasterminds.io/</a>)</p> <p>Data Masterminds will hold a free raffle to win a couple of ebooks - [Learn dbatools in a Month of Lunches (manning.com)](<a href=\"https://www.manning.com/books/learn-dbatools-in-a-month-of-lunches\" class=\"linkified\">https://www.manning.com/books/learn-dbatools-in-a-month-of-lunches</a>)</p> <p>Amdaris, an Insight company, is your trusted partner for high velocity extended delivery teams.</p> <p>Data Masterminds is a leading Microsoft Data Platform consultancy and managed service provider to customers across the globe.</p> <p>Location: Amdaris, Finzels Reach, Aurora, Bristol BS1 6BX</p> <p>AGENDA</p> <p>**18.00 – 18:30 Meet &amp; Greet**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:30 - 19:15 dba tools** by **[Jess Pomfret](<a href=\"https://www.linkedin.com/in/jpomfret/\" class=\"linkified\">https://www.linkedin.com/in/jpomfret/</a>)**</p> <p>Folks - the wait is over! - REPLICATION commands are in dbatools.</p> <p>One of the most highly requested dbatools features was for commands to manage snapshot, transactional... and even merge replication and now they're here. The wait is over!</p> <p>In this session, we'll run through the available commands and work through demos including:</p> <p>\\- Enabling publication and distribution for our instance<br/>\\- Creating publications<br/>\\- Adding articles to publications<br/>\\- Adding subscriptions<br/>\\- Confirm it's all working<br/>\\- Tearing it all back down again\\!</p> <p>If you have been managing replication through the GUI and dreaming of a better way - come and join me for this action-packed session.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:15 - 19:45 Pizza and Networking**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:45 - 20:30 Deploy your Azure Data Solutions with Bicep and Azure DevOps or GitHub Actions** by **[Rob Sewell](<a href=\"https://www.linkedin.com/in/robsewellsqldba/\" class=\"linkified\">https://www.linkedin.com/in/robsewellsqldba/</a>)**</p> <p>Lets migrate to the cloud.</p> <p>You can go to the portal and click in the blades and manually create all of the resources that you need. Such as Azure SQL Databases, Azure SQL VMs, Azure Arc Enabled Managed Instances, Azure Databricks or Azure Data Factory for example. You will want to ensure that they are all logging to Log Analytics and have monitoring enabled, maybe you need all of them to have Private Endpoints set up.</p> <p>But you will forget something, you will mistype something, you will need to create multiple environments and they will need to be the same. Manually creating things is time consuming and mistake prone. Humans make mistakes.</p> <p>Come and join me and I will show you how to deploy your data infrastructure into Azure using Bicep and Azure DevOps. How to ensure that when you deploy your resources, you automatically include Log Analytics or monitoring or add Private Endpoints.</p> <p>You will learn<br/>• What Bicep is<br/>• How to compose Bicep with VS Code<br/>• How to create a pipeline in Azure DevOps to deploy the code<br/>• How to add Logging and Monitoring to your Azure Data Platform<br/>• How to create modules so that you can ensure that you deploy all of the resources that you require quickly, easily and repeatedly</p> <p>You are<br/>• Someone interested in Infrastructure as Code for cloud data resources<br/>• Interested in learning new things<br/>• Want to deploy consistently to Azure<br/>• Never heard of Bicep or pipelines</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**20:30 - Pub**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**Notes**</p> <p>* **Bicycle parking**: We do *not* have arrangements with the venue for secure storage. There are public bicycle stands by Spicer and Cole/Premier Inn (to the left of Amdaris). Bicycles are left at your own risk</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**About Amdaris - [<a href=\"https://amdaris.com/](https://amdaris.com/\" class=\"linkified\">https://amdaris.com/](https://amdaris.com/</a>)**</p> <p>We are Amdaris, an Insight company, and at our core we specialise in extending teams with highly skilled software experts. With bespoke Software Development, Product Design, Strategy and Consultation, Managed Services and Data Solutions, we seamlessly integrate into your business and culture, bringing passion, care, and technical proficiency directly to you.</p> <p>**About Data Masterminds - [<a href=\"https://datamasterminds.io/](https://datamasterminds.io/\" class=\"linkified\">https://datamasterminds.io/](https://datamasterminds.io/</a>)**</p> <p>Data Masterminds is a leading Microsoft Data Platform consultancy and managed service provider to customers across the globe.</p> <p>Our expert team offers comprehensive guidance and mentorship throughout the entire data lifecycle, whether your systems are on-premises, in the cloud, or a hybrid environment.</p> <p>Utilizing our [Data Platform Maturity Model](<a href=\"https://datamasterminds.io/maturity-model/\" class=\"linkified\">https://datamasterminds.io/maturity-model/</a>), we can optimize your systems and enhance your team’s skills, ensuring your Data Platform delivers superior performance, stability, and relevance to meet your business objectives.</p> <p>**\\-\\-\\-\\-**<br/>**Photos**<br/>*We ask that you do NOT take photos at this meetup.*</p> <p>We will invite people to be included in a group photo/s during the event. Speakers will let you know if it's okay to photograph their presentation (excluding other attendees).</p> <p>You may see organisers taking photos during the talks. These will be of speakers, if they have agreed to this, and will not include faces of attendees.</p> ",
    "end_time": 1708635600,
    "link": "https://www.meetup.com/databristol/events/298462792/",
    "location": {
        "address": "Finzels Reach",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45358657836914,
        "longitude": -2.5879149436950684,
        "name": "Amdaris"
    },
    "org": "databristol",
    "start_time": 1708624800,
    "title": "dba tools and data infrastructure automation"
}