{
    "cancelled": false,
    "description": "<p>Updated agenda below. Hosted and Sponsored by Snap Analytics - [snapanalytics.co.uk](<a href=\"https://snapanalytics.co.uk/\" class=\"linkified\">https://snapanalytics.co.uk/</a>) \\- an enterprise partner to help connect data\\, technology and teams to deliver exceptional business outcomes\\.</p> <p>Location: Runway East Bristol Bridge, 1 Victoria St, Redcliffe, Bristol BS1 6AA</p> <p>AGENDA</p> <p>**18.00 – 18:20 Meet &amp; Greet**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:20 - 19:10 Intro to Generative AI** by **[Calvin Fuss](<a href=\"https://www.linkedin.com/in/calvinfuss/\" class=\"linkified\">https://www.linkedin.com/in/calvinfuss/</a>)**</p> <p>Note, this talk was \"From Words to Wisdom: Creating SQL and Insights using Conversational AI\" by [Isaac Ben-Akiva](<a href=\"https://www.linkedin.com/in/benakiva/\" class=\"linkified\">https://www.linkedin.com/in/benakiva/</a>) but unfortunately Isaac is poorly and unable to make it.</p> <p>Intro to Generative AI<br/>Query your data using AI - Demo<br/>Solve real world business problems using AI – Demo<br/>AI Product architecture<br/>Business benefits</p> <p>**BIO**</p> <p>Calvin’s career has allowed him to apply real world experience to his academical groundings in computer science. His passion for data and software development has driven impactful projects for some of the world’s largest corporations, including BAT, Imperial Tobacco, and Unilever, where he led data analytics, data science, and artificial intelligence consulting engagements.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:10 - 19:40 Pizza and Networking**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:40 - 20:30 From Buzzwords to Breakthroughs: How to create an effective Data Strategy** by **[David Rice](<a href=\"https://www.linkedin.com/in/david-rice-84841914/\" class=\"linkified\">https://www.linkedin.com/in/david-rice-84841914/</a>)**</p> <p>Are you tired of playing buzzword bingo with every new data announcement, and want to get practical, this one is for you. In this session, you’ll get to learn about: The 4 Pillars of an Effective Data Strategy, Creating the Data Value Map to Identify Use Cases, The Prioritisation Matrix for Data &amp; Analytics and Getting Buy-In To Fund Your Project.</p> <p>**BIO**</p> <p>David has 20 years of experience in business intelligence, data warehousing, and analytics, He is passionate about helping businesses leverage data to achieve their strategic goals.</p> <p>As the CEO and Co-founder of Snap Analytics, He leads a team of data experts who deliver solutions that simplify and accelerate data projects for some of the world's biggest brands.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**20:30 - Pub**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**About Snap Analytics - [<a href=\"https://snapanalytics.co.uk/](https://snapanalytics.co.uk/\" class=\"linkified\">https://snapanalytics.co.uk/](https://snapanalytics.co.uk/</a>)**</p> <p>Snap Analytics partners with enterprises to help them to connect their data, technology and teams to deliver exceptional business outcomes.</p> <p>**\\-\\-\\-\\-**<br/>**Photos**<br/>*We ask that you do NOT take photos at this meetup.*</p> <p>We will invite people to be included in a group photo/s during the event. Speakers will let you know if it's okay to photograph their presentation (excluding other attendees).</p> <p>You may see organisers taking photos during the talks. These will be of speakers, if they have agreed to this, and will not include faces of attendees.</p> ",
    "end_time": 1720468800,
    "link": "https://www.meetup.com/databristol/events/300993178/",
    "location": {
        "address": "1 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4532356262207,
        "longitude": -2.5910940170288086,
        "name": "Runway East Bristol Bridge"
    },
    "org": "databristol",
    "start_time": 1720458000,
    "title": "Data Strategy and an Intro to Generative AI"
}