{
    "cancelled": false,
    "description": "<p>Agenda below. Hosted and Sponsored by Snap Analytics - [snapanalytics.co.uk](<a href=\"https://snapanalytics.co.uk/\" class=\"linkified\">https://snapanalytics.co.uk/</a>) \\- an enterprise partner to help connect data\\, technology and teams to deliver exceptional business outcomes\\.</p> <p>Location: Runway East Bristol Bridge, 1 Victoria St, Redcliffe, Bristol BS1 6AA</p> <p>AGENDA</p> <p>**18.00 – 18:20 Meet &amp; Greet**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**18:20 - 19:10 From Words to Wisdom: Creating SQL and Insights using Conversational AI** by **[Isaac Ben-Akiva](<a href=\"https://www.linkedin.com/in/benakiva/\" class=\"linkified\">https://www.linkedin.com/in/benakiva/</a>)**</p> <p>Unlock the power of conversational AI to transform plain English queries into SQL commands, enabling intuitive and efficient database interactions. \"From Words to Wisdom: Creating SQL and Insights using Conversational AI\" explores how Large Language Models (LLMs) democratise data access, allowing non-technical users to retrieve and visualise data effortlessly.</p> <p>This talk covers the integration of LLMs and Retrieval-Augmented Generation (RAG) with Python and Streamlit to build a powerful, user-friendly data querying system. Key areas include:<br/>Conversational AI and LLMs: Leveraging LLMs for natural language processing and SQL query generation.</p> <p>RAG Framework: Enhancing query accuracy and relevance.<br/>Building the Solution: Implementing the system using Python and Streamlit, from model training to user interface design.<br/>Real-World Applications: Demonstrating practical use cases and benefits.</p> <p>By attending, you'll learn how to create an intuitive data querying and visualisation tool that empowers everyone in your organisation to make data-driven decisions. Join us to discover the future of seamless data interaction and insight generation.</p> <p>**BIO**</p> <p>Isaac is the Head of Applied AI at Snap Analytics. He has over 25 years experience in data, intelligent systems and software development and management. He holds a Ph.D. in Machine Learning from the University of Toronto and several other specialisations in Machine Learning and Deep Learning. He has been working with Machine Learning since early 2000’s and has applied it to solve problems in diverse areas. Prior to joining Snap Analytics, he led the largest Brazilian FinTech, PicPay, through their data transformation, contributing to their exponential growth from 12M to over 50M users. When Isaac is not working, you can find him playing Golf or hiking with his family.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:10 - 19:40 Pizza and Networking**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**19:40 - 20:30 From Buzzwords to Breakthroughs: How to create an effective Data Strategy** by **[David Rice](<a href=\"https://www.linkedin.com/in/david-rice-84841914/\" class=\"linkified\">https://www.linkedin.com/in/david-rice-84841914/</a>)**</p> <p>Are you tired of playing buzzword bingo with every new data announcement, and want to get practical, this one is for you. In this session, you’ll get to learn about: The 4 Pillars of an Effective Data Strategy, Creating the Data Value Map to Identify Use Cases, The Prioritisation Matrix for Data &amp; Analytics and Getting Buy-In To Fund Your Project.</p> <p>**BIO**</p> <p>David has 20 years of experience in business intelligence, data warehousing, and analytics, He is passionate about helping businesses leverage data to achieve their strategic goals.</p> <p>As the CEO and Co-founder of Snap Analytics, He leads a team of data experts who deliver solutions that simplify and accelerate data projects for some of the world's biggest brands.</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-</p> <p>**20:30 - Pub**</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**About Snap Analytics - [<a href=\"https://snapanalytics.co.uk/](https://snapanalytics.co.uk/\" class=\"linkified\">https://snapanalytics.co.uk/](https://snapanalytics.co.uk/</a>)**</p> <p>Snap Analytics partners with enterprises to help them to connect their data, technology and teams to deliver exceptional business outcomes.</p> <p>**\\-\\-\\-\\-**<br/>**Photos**<br/>*We ask that you do NOT take photos at this meetup.*</p> <p>We will invite people to be included in a group photo/s during the event. Speakers will let you know if it's okay to photograph their presentation (excluding other attendees).</p> <p>You may see organisers taking photos during the talks. These will be of speakers, if they have agreed to this, and will not include faces of attendees.</p> ",
    "end_time": 1720468800,
    "link": "https://www.meetup.com/databristol/events/300993178/",
    "location": {
        "address": "1 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.4532356262207,
        "longitude": -2.5910940170288086,
        "name": "Runway East Bristol Bridge"
    },
    "org": "databristol",
    "start_time": 1720458000,
    "title": "Data Strategy and Conversational AI SQL"
}