{
    "cancelled": false,
    "description": "<p>Networking event for data professionals, students, academics, scientists, engineers, analysts, heads of.</p> <p>Hosted and Sponsored by BJSS - [www.bjss.com](<a href=\"https://www.bjss.com/\" class=\"linkified\">https://www.bjss.com/</a>) \\- a leading technology and engineering consultancy for business\\.</p> <p>Special Guest interview with [Simon Josling](<a href=\"https://www.linkedin.com/in/simonjosling/\" class=\"linkified\">https://www.linkedin.com/in/simonjosling/</a>), Head of Technology Advisory at BJSS. We'll be chatting about how he got to his role, some fantastic AI projects he's been involved with, and the future of Data and AI technologies.</p> <p>Pizzas and Drinks during the event - thanks BJSS!</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**About BJSS - [<a href=\"https://www.bjss.com/](https://www.bjss.com/\" class=\"linkified\">https://www.bjss.com/](https://www.bjss.com/</a>)**<br/>BJSS is a leading technology and engineering consultancy for business. Trusted by our clients, we collaborate with some of the world’s leading organisations to deliver complex, innovative technology, engineering, and industry solutions that millions of people use every day.<br/>**\\-\\-\\-\\-**<br/>**Photos**<br/>*We ask that you do NOT take photos at this meetup.*<br/>We will invite people to be included in a group photo/s during the event. Speakers will let you know if it's okay to photograph their presentation (excluding other attendees).<br/>You may see organisers taking photos during the talks. These will be of speakers, if they have agreed to this, and will not include faces of attendees.</p> ",
    "end_time": 1718910000,
    "link": "https://www.meetup.com/databristol/events/301558153/",
    "location": {
        "address": "90 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45137023925781,
        "longitude": -2.5864291191101074,
        "name": "BJSS"
    },
    "org": "databristol",
    "start_time": 1718902800,
    "title": "Networking for Data People"
}