{
    "cancelled": false,
    "description": "<p>AGENDA<br/>**18.00 – 18:20 Meet &amp; Greet**</p> <p>**18:20 - 19:10 Quack: A sensational 18thC robot duck, and its links to modern AI** by [Miranda Mowbray](<a href=\"https://www.linkedin.com/in/mirandamowbray/\" class=\"linkified\">https://www.linkedin.com/in/mirandamowbray/</a>)</p> <p>In the last few years, developments in generative AI have been associated with jaw-dropping technical advances and feats of engineering, public spectacle, wildly exuberant predictions, and controversies about the nature of life itself. This kind of atmosphere has occurred before. My talk will be about the Digesting Duck, a clockwork-driven robot duck which was a sensation across Europe in the 18th Century. I’ll describe some links between the Digesting Duck and modern AI, both in terms of technological development, and of the philosophical questions raised in discussions about them. What can be learned from the Digesting Duck that is applicable to modern AI?</p> <p>**BIO**<br/>Miranda Mowbray is an honorary lecturer at the University of Bristol, where she teaches ethics for AI. She is not a robot, honest. </p> <p>**19:10 - 19:40 Pizza and Networking**</p> <p>**19:40 - 20:30 (TBC)**</p> <p>Hosted and Sponsored by BJSS - [www.bjss.com](<a href=\"https://www.bjss.com/\" class=\"linkified\">https://www.bjss.com/</a>) \\- a leading technology and engineering consultancy for business\\.</p> <p>Pizzas and Drinks during the event - thanks BJSS!</p> <p>\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-<br/>**About BJSS - [<a href=\"https://www.bjss.com/](https://www.bjss.com/\" class=\"linkified\">https://www.bjss.com/](https://www.bjss.com/</a>)**<br/>BJSS is a leading technology and engineering consultancy for business. Trusted by our clients, we collaborate with some of the world’s leading organisations to deliver complex, innovative technology, engineering, and industry solutions that millions of people use every day.<br/>**\\-\\-\\-\\-**<br/>**Photos**<br/>*We ask that you do NOT take photos at this meetup.*<br/>We will invite people to be included in a group photo/s during the event. Speakers will let you know if it's okay to photograph their presentation (excluding other attendees).<br/>You may see organisers taking photos during the talks. These will be of speakers, if they have agreed to this, and will not include faces of attendees.</p> ",
    "end_time": 1731618000,
    "link": "https://www.meetup.com/databristol/events/302036919/",
    "location": {
        "address": "90 Victoria Street",
        "city": "Bristol",
        "country": "gb",
        "latitude": 51.45137023925781,
        "longitude": -2.5864291191101074,
        "name": "BJSS"
    },
    "org": "databristol",
    "start_time": 1731607200,
    "title": "Quack:  A sensational 18thC robot duck, and its links to modern AI"
}